[Killed] ArrowFunction
dto/base/decorators/composition-has-villager.decorator.ts:14:38
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.VILLAGERS);
+  const werewolfRoles = roles.filter(() => undefined);
   return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
dto/base/decorators/composition-has-villager.decorator.ts:15:72
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.VILLAGERS);
-  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
+  return players.some(({ role }) => werewolfRoles.find(werewolfRole => false));
 }
 
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
