[Killed] ArrowFunction
dto/base/decorators/composition-has-werewolf.decorator.ts:14:38
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.WEREWOLVES);
+  const werewolfRoles = roles.filter(() => undefined);
   return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
dto/base/decorators/composition-has-werewolf.decorator.ts:15:72
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.WEREWOLVES);
-  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
+  return players.some(({ role }) => werewolfRoles.find(werewolfRole => true));
 }
 
killedBy: Game Controller POST /games should not allow game creation when there is no werewolf in game's composition [#9].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ArrowFunction
dto/base/decorators/composition-has-werewolf.decorator.ts:15:56
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.WEREWOLVES);
-  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
+  return players.some(({ role }) => werewolfRoles.find(() => undefined));
 }
 
killedBy: Composition Has Werewolf Decorator doesCompositionHaveAtLeastOneWerewolf should return true when there is at least one werewolf in composition.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
