[Killed] LogicalOperator
dto/base/decorators/composition-positions-consistency.decorator.ts:16:10
     }
     return acc;
   }, []);
-  return uniquePositions.length === 0 || uniquePositions.length === players.length;
+  return uniquePositions.length === 0 && uniquePositions.length === players.length;
 }
 
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
