[Killed] ConditionalExpression
dto/base/decorators/composition-roles-max-in-game.decorator.ts:14:48
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles.every(role => {
-    const roleCount = players.filter(player => player.role.name === role.name).length;
+    const roleCount = players.filter(player => true).length;
     return roleCount <= role.maxInGame;
   });
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
