[Killed] MethodExpression
dto/base/decorators/composition-roles-min-in-game.decorator.ts:10:32
 import type { Role } from "../../../../role/types/role.type";
 
 function areCompositionRolesMinInGameRespected(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.every(player => !isObject(player) || !has(player, ["role", "name"]))) {
     return false;
   }
killedBy: Composition Roles Min In Game Decorator areCompositionRolesMinInGameRespected should return false when one of the players is not an object.
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ArrowFunction
dto/base/decorators/composition-roles-min-in-game.decorator.ts:10:43
 import type { Role } from "../../../../role/types/role.type";
 
 function areCompositionRolesMinInGameRespected(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(() => undefined)) {
     return false;
   }
killedBy: Composition Roles Min In Game Decorator areCompositionRolesMinInGameRespected should return false when one of the players is not an object.
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
dto/base/decorators/composition-roles-min-in-game.decorator.ts:17:50
   return roles
     .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
     .every(role => {
-      const roleCount = players.filter(player => player.role.name === role.name).length;
+      const roleCount = players.filter(player => true).length;
       return roleCount === 0 || roleCount >= role.minInGame;
     });
killedBy: Game Controller POST /games should not allow game creation when there is only one brother in the same game [#6].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
dto/base/decorators/composition-roles-min-in-game.decorator.ts:18:33
     .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
     .every(role => {
       const roleCount = players.filter(player => player.role.name === role.name).length;
-      return roleCount === 0 || roleCount >= role.minInGame;
+      return roleCount === 0 || false;
     });
 }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getGameRandomComposition should return random composition when called [#1].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
