[Killed] ConditionalExpression
base/game-player/transformers/player-side.transformer.ts:8:7
 import type { ROLE_SIDES, ROLE_NAMES } from "../../../../../role/enums/role.enum";
 
 function playerSideTransformer(params: TransformFnParams): unknown {
-  if (!isObject(params.value) || !isObject(params.obj) || !has(params.obj as object, ["role", "name"])) {
+  if (false) {
     return params.value;
   }
killedBy: Player Side Transformer playerSideTransformer should return null when value is null.
statusReason: TypeError: Cannot set properties of null (setting 'current')
