[Killed] EqualityOperator
dto/base/transformers/game-players-position.transformer.ts:9:28
     return params.value;
   }
   const value = params.value as unknown[];
-  if (value.some(player => typeof player !== "object" ||
+  if (value.some(player => typeof player === "object" ||
     has(player, "position") && (player as { position: number | undefined }).position !== undefined)) {
     return value;
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
dto/base/transformers/game-players-position.transformer.ts:10:102
   }
   const value = params.value as unknown[];
   if (value.some(player => typeof player !== "object" ||
-    has(player, "position") && (player as { position: number | undefined }).position !== undefined)) {
-    return value;
-  }
+    has(player, "position") && (player as { position: number | undefined }).position !== undefined)) {}
   const players = value as { position: number | undefined }[];
   for (let i = 0; i < value.length; i++) {
killedBy: Game Players Position Transformer gamePlayersPositionTransformer should return same value when one value of the array is not object.
statusReason: TypeError: Cannot create property 'position' on string 'toto'

[Killed] ConditionalExpression
dto/base/transformers/game-players-position.transformer.ts:14:19
     return value;
   }
   const players = value as { position: number | undefined }[];
-  for (let i = 0; i < value.length; i++) {
+  for (let i = 0; false; i++) {
     players[i].position = i;
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500
