[Killed] ArrowFunction
game/helpers/game-history-record/game-history-record.helper.ts:7:38
 import type { GameSource } from "../../types/game.type";
 
 function getLastGamePlayFromHistory(gameHistoryRecords: GameHistoryRecord[], source: GameSource, action: GAME_PLAY_ACTIONS): GameHistoryRecord | undefined {
-  return gameHistoryRecords.findLast(({ play }) => play.action === action && play.source.name === source);
+  return gameHistoryRecords.findLast(() => undefined);
 }
 
killedBy: Game Plays Validator Service validateGamePlayGuardTargets should throw error when targeted player is the same as previous guard play and game option doesn't allow this.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Guard can't protect this target"

Received function did not throw

[Killed] LogicalOperator
game/helpers/game-history-record/game-history-record.helper.ts:11:52
 }
 
 function getLastGamePlayTieInVotesFromHistory(gameHistoryRecords: GameHistoryRecord[]): GameHistoryRecord | undefined {
-  return gameHistoryRecords.findLast(({ play }) => play.action === GAME_PLAY_ACTIONS.VOTE && play.votingResult === GAME_HISTORY_RECORD_VOTING_RESULTS.TIE);
+  return gameHistoryRecords.findLast(({ play }) => play.action === GAME_PLAY_ACTIONS.VOTE || play.votingResult === GAME_HISTORY_RECORD_VOTING_RESULTS.TIE);
 }
 
killedBy: Game History Record Helper getLastGamePlayTieInVotesFromHistory should return undefined when tie in votes is not found.
statusReason: Error: expect(received).toBeUndefined()
