[Killed] BlockStatement
modules/game/helpers/game-play.helper.ts:21:31
   return makeGamePlayDto.votes.reduce<MakeGamePlayVoteWithRelationsDto[]>((acc, vote) => {
     const source = getPlayerWithId(game.players, vote.sourceId);
     const target = getPlayerWithId(game.players, vote.targetId);
-    if (source === undefined) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, vote.sourceId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
-    }
+    if (source === undefined) {}
     if (target === undefined) {
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, vote.targetId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
killedBy: Game Play Helper getVotesWithRelationsFromMakeGamePlayDto should throw error when votes contains one unknown source.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"9fbeefa1d3f814ecb5e23aba\" not found : Game Play - Player in `votes.source` is not in the game players"

Received function did not throw

[Killed] BlockStatement
modules/game/helpers/game-play.helper.ts:24:31
     if (source === undefined) {
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, vote.sourceId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
     }
-    if (target === undefined) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, vote.targetId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
-    }
+    if (target === undefined) {}
     const plainToInstanceOptions = { ...plainToInstanceDefaultOptions, excludeExtraneousValues: true };
     const voteWithRelations = plainToInstance(MakeGamePlayVoteWithRelationsDto, { ...vote, source, target }, plainToInstanceOptions);
killedBy: Game Play Helper getVotesWithRelationsFromMakeGamePlayDto should throw error when votes contains one unknown target.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"33ef86fe170fd1af4d2fef4f\" not found : Game Play - Player in `votes.target` is not in the game players"

Received function did not throw

[Killed] EqualityOperator
modules/game/helpers/game-play.helper.ts:39:9
   }
   return makeGamePlayDto.targets.reduce<MakeGamePlayTargetWithRelationsDto[]>((acc, target) => {
     const player = getPlayerWithId(game.players, target.playerId);
-    if (player === undefined) {
+    if (player !== undefined) {
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, target.playerId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
     }
killedBy: Game Play Helper getTargetsWithRelationsFromMakeGamePlayDto should throw error when targets contains one unknown player.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"f2c7aded5e79bf097b2dc6a0\" not found : Game Play - Player in `targets.player` is not in the game players"
Received message:   "Player with id \"d09c5ce1b8ad7daf630991ae\" not found : Game Play - Player in `targets.player` is not in the game players"

      132 |           } else {
      133 |             stryCov_9fa48

[Killed] BlockStatement
modules/game/helpers/game-play.helper.ts:39:31
   }
   return makeGamePlayDto.targets.reduce<MakeGamePlayTargetWithRelationsDto[]>((acc, target) => {
     const player = getPlayerWithId(game.players, target.playerId);
-    if (player === undefined) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, target.playerId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
-    }
+    if (player === undefined) {}
     const plainToInstanceOptions = { ...plainToInstanceDefaultOptions, excludeExtraneousValues: true };
     const targetWithRelations = plainToInstance(MakeGamePlayTargetWithRelationsDto, { ...target, player }, plainToInstanceOptions);
killedBy: Game Play Helper getTargetsWithRelationsFromMakeGamePlayDto should throw error when targets contains one unknown player.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"7e88eafdc05f0aafcbd9fae1\" not found : Game Play - Player in `targets.player` is not in the game players"

Received function did not throw

[Killed] EqualityOperator
modules/game/helpers/game-play.helper.ts:53:7
     return;
   }
   const chosenCard = getAdditionalCardWithId(game.additionalCards, makeGamePlayDto.chosenCardId);
-  if (chosenCard === undefined) {
+  if (chosenCard !== undefined) {
     throw new ResourceNotFoundError(API_RESOURCES.GAME_ADDITIONAL_CARDS, makeGamePlayDto.chosenCardId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_CHOSEN_CARD);
   }
killedBy: Game Play Helper getChosenCardFromMakeGamePlayDto should throw error when chosen card is unknown from game cards.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Additional card with id \"fdcbb4bac43f5dddcdbbd8e1\" not found : Game Play - Chosen card is not in the game additional cards"

Received function did not throw

[Killed] BlockStatement
modules/game/helpers/game-play.helper.ts:53:33
     return;
   }
   const chosenCard = getAdditionalCardWithId(game.additionalCards, makeGamePlayDto.chosenCardId);
-  if (chosenCard === undefined) {
-    throw new ResourceNotFoundError(API_RESOURCES.GAME_ADDITIONAL_CARDS, makeGamePlayDto.chosenCardId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_CHOSEN_CARD);
-  }
+  if (chosenCard === undefined) {}
   return chosenCard;
 }
killedBy: Game Play Helper getChosenCardFromMakeGamePlayDto should throw error when chosen card is unknown from game cards.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Additional card with id \"d522ed5f85dedef54b67bd92\" not found : Game Play - Chosen card is not in the game additional cards"

Received function did not throw
