[Killed] EqualityOperator
game/helpers/game-victory/game-victory.helper.ts:34:62
 function doesWhiteWerewolfWin(players: Player[]): boolean {
   const whiteWerewolfPlayer = getPlayerWithCurrentRole(players, ROLE_NAMES.WHITE_WEREWOLF);
   return !!whiteWerewolfPlayer && players.every(({ role, isAlive }) =>
-    role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || role.current !== ROLE_NAMES.WHITE_WEREWOLF && !isAlive);
+    role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || role.current === ROLE_NAMES.WHITE_WEREWOLF && !isAlive);
 }
 
killedBy: Game Victory Helper doesWhiteWerewolfWin should return true when all players are dead except white werewolf.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:72:7
     const inLovePlayers = getPlayersWithAttribute(game.players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.LOVERS, winners: inLovePlayers }, plainToInstanceDefaultOptions);
   }
-  if (doesPiedPiperWin(game)) {
+  if (true) {
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.PIED_PIPER, winners: [piedPiperPlayer] }, plainToInstanceDefaultOptions);
