[Timeout] ConditionalExpression
modules/game/helpers/game.helper.ts:13:33
 import { doesPlayerHaveAttribute } from "./player/player.helper";
 
 function getPlayerDtoWithRole(players: CreateGamePlayerDto[], role: ROLE_NAMES): CreateGamePlayerDto | undefined {
-  return players.find(player => player.role.name === role);
+  return players.find(player => false);
 }
 

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:17:33
 }
 
 function getPlayerWithCurrentRole(players: Player[], role: ROLE_NAMES): Player | undefined {
-  return players.find(player => player.role.current === role);
+  return players.find(player => true);
 }
 
killedBy: Game Helper getPlayerWithCurrentRole should return player with role when a player has this role.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Player {
-   "_id": "5f1daa754bbaa59b51d3bd3d",
+   "_id": "bcafba0ebb40f715ad2f93a7",

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:17:33
 }
 
 function getPlayerWithCurrentRole(players: Player[], role: ROLE_NAMES): Player | undefined {
-  return players.find(player => player.role.current === role);
+  return players.find(player => player.role.current !== role);
 }
 
killedBy: Game Plays Manager Service areLoversPlayableForNight should return false when there is no cupid in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:25:35
 }
 
 function getPlayersWithCurrentSide(players: Player[], side: ROLE_SIDES): Player[] {
-  return players.filter(player => player.side.current === side);
+  return players.filter(player => false);
 }
 
killedBy: Game Helper getPlayersWithCurrentSide should return werewolves when they have this side.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 70
+ Received  +  1

- Array [
-   Player {
-     "_id": "fde46bbfaeac86ed224a5cd9",

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:29:36
 }
 
 function getPlayerWithId(players: Player[], id: Types.ObjectId): Player | undefined {
-  return players.find(({ _id }) => _id.toString() === id.toString());
+  return players.find(({ _id }) => true);
 }
 
killedBy: Game Play Helper getVotesWithRelationsFromMakeGamePlayDto should throw error when votes contains one unknown source.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"324e6df9dd1eeaa6ace7efc1\" not found : Game Play - Player in `votes.source` is not in the game players"

Received function did not throw

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:33:35
 }
 
 function getAdditionalCardWithId(cards: GameAdditionalCard[] | undefined, id: Types.ObjectId): GameAdditionalCard | undefined {
-  return cards?.find(({ _id }) => _id.toString() === id.toString());
+  return cards?.find(({ _id }) => _id.toString() !== id.toString());
 }
 
killedBy: Game Play Helper getChosenCardFromMakeGamePlayDto should throw error when chosen card is unknown from game cards.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Additional card with id \"a183e1683ec980cac8d1cccb\" not found : Game Play - Chosen card is not in the game additional cards"

Received function did not throw

[Killed] MethodExpression
modules/game/helpers/game.helper.ts:38:40
 
 function areAllWerewolvesAlive(players: Player[]): boolean {
   const werewolfPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.WEREWOLVES);
-  return werewolfPlayers.length > 0 && werewolfPlayers.every(werewolf => werewolf.isAlive);
+  return werewolfPlayers.length > 0 && werewolfPlayers.some(werewolf => werewolf.isAlive);
 }
 
killedBy: Game Helper areAllWerewolvesAlive should return true when at least one werewolf is dead.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:43:10
 
 function areAllVillagersAlive(players: Player[]): boolean {
   const villagerPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
-  return villagerPlayers.length > 0 && villagerPlayers.every(villager => villager.isAlive);
+  return false;
 }
 
killedBy: Game Helper areAllVillagersAlive should return true when all villagers are alive.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:43:10
 
 function areAllVillagersAlive(players: Player[]): boolean {
   const villagerPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
-  return villagerPlayers.length > 0 && villagerPlayers.every(villager => villager.isAlive);
+  return villagerPlayers.length >= 0 && villagerPlayers.every(villager => villager.isAlive);
 }
 
killedBy: Game Helper areAllVillagersAlive should return false when empty array is provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:47:10
 }
 
 function areAllPlayersDead(players: Player[]): boolean {
-  return players.length > 0 && players.every(({ isAlive }) => !isAlive);
+  return true;
 }
 
killedBy: Game Helper areAllPlayersDead should return false when empty array is provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:59:121
 }
 
 function getLeftToCharmByPiedPiperPlayers(players: Player[]): Player[] {
-  return players.filter(player => player.isAlive && !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.CHARMED) && player.role.current !== ROLE_NAMES.PIED_PIPER);
+  return players.filter(player => player.isAlive && !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.CHARMED) && player.role.current === ROLE_NAMES.PIED_PIPER);
 }
 
killedBy: Game Helper getLeftToCharmByPiedPiperPlayers should get left to charm by pied piper players when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 22
+ Received  +  5

  Array [
    Player {
-     "_id": "aa30acb27f1c9a3dae6e9cd7",

[Killed] ArrowFunction
modules/game/helpers/game.helper.ts:59:25
 }
 
 function getLeftToCharmByPiedPiperPlayers(players: Player[]): Player[] {
-  return players.filter(player => player.isAlive && !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.CHARMED) && player.role.current !== ROLE_NAMES.PIED_PIPER);
+  return players.filter(() => undefined);
 }
 
killedBy: Game Helper getLeftToCharmByPiedPiperPlayers should get left to charm by pied piper players when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 36
+ Received  +  1

- Array [
-   Player {
-     "_id": "cc1d7cb2ac040a93394aace3",

[Timeout] ConditionalExpression
modules/game/helpers/game.helper.ts:63:7
 }
 
 function getGroupOfPlayers(players: Player[], group: PLAYER_GROUPS): Player[] {
-  if (group === PLAYER_GROUPS.ALL) {
+  if (true) {
     return players;
   } else if (group === PLAYER_GROUPS.LOVERS) {

[Killed] BlockStatement
modules/game/helpers/game.helper.ts:65:46
 function getGroupOfPlayers(players: Player[], group: PLAYER_GROUPS): Player[] {
   if (group === PLAYER_GROUPS.ALL) {
     return players;
-  } else if (group === PLAYER_GROUPS.LOVERS) {
-    return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-  } else if (group === PLAYER_GROUPS.CHARMED) {
+  } else if (group === PLAYER_GROUPS.LOVERS) {} else if (group === PLAYER_GROUPS.CHARMED) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.CHARMED);
   } else if (group === PLAYER_GROUPS.VILLAGERS) {
killedBy: Game Helper getGroupOfPlayers should return players in love when group is lovers.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  9
+ Received  + 26

@@ -1,28 +1,45 @@
  Array [
    Player {

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:69:14
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   } else if (group === PLAYER_GROUPS.CHARMED) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.CHARMED);
-  } else if (group === PLAYER_GROUPS.VILLAGERS) {
+  } else if (false) {
     return getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
   }
killedBy: Game Helper getGroupOfPlayers should return villagers when group is villagers.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 33
+ Received  + 26

  Array [
    Player {
-     "_id": "dbbaec3ca48e9bc8ed653dda",
