[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:10:56
 }
 
 function canPiedPiperCharm(piedPiperPlayer: Player, isPowerlessIfInfected: boolean): boolean {
-  return isPlayerAliveAndPowerful(piedPiperPlayer) && (!isPowerlessIfInfected || piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
+  return isPlayerAliveAndPowerful(piedPiperPlayer) && (true);
 }
 
killedBy: Player Helper canPiedPiperCharm should return false when pied piper is infected and thus is powerless.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:18:10
 }
 
 function isPlayerOnWerewolvesSide(player: Player): boolean {
-  return player.side.current === ROLE_SIDES.WEREWOLVES;
+  return true;
 }
 
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WHITE_WEREWOLF and targeted player is from villagers side.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : White werewolf can't eat this target"

Received function did not throw

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:22:10
 }
 
 function isPlayerOnVillagersSide(player: Player): boolean {
-  return player.side.current === ROLE_SIDES.VILLAGERS;
+  return false;
 }
 
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should do nothing when big bad wolf eaten target is valid.
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Bad game play payload : Big bad wolf can't eat this target"

      266 |         } else {
      267 |           stryCov_9fa48("884");
    > 268 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
