[Timeout] BlockStatement
providers/services/game-history/game-history-record.service.ts:25:96
     return this.gameHistoryRecordRepository.find({ gameId, ...filter });
   }
 
-  public checkGameHistoryRecordToInsertPlayData(play: GameHistoryRecordPlay, game: Game): void {
-    const unmatchedSource = getNonexistentPlayer(game.players, play.source.players);
-    if (unmatchedSource) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedSource._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_SOURCE);
-    }
-    const unmatchedTarget = getNonexistentPlayer(game.players, play.targets?.map(target => target.player));
-    if (unmatchedTarget) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedTarget._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
-    }
-    const unmatchedVoter = getNonexistentPlayer(game.players, play.votes?.map(vote => vote.source));
-    if (unmatchedVoter) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedVoter._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
-    }
-    const unmatchedVoteTarget = getNonexistentPlayer(game.players, play.votes?.map(vote => vote.target));
-    if (unmatchedVoteTarget) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedVoteTarget._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
-    }
-    if (play.chosenCard && !getAdditionalCardWithId(game.additionalCards, play.chosenCard._id)) {
-      throw new ResourceNotFoundError(API_RESOURCES.GAME_ADDITIONAL_CARDS, play.chosenCard._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_CHOSEN_CARD);
-    }
-  }
+  public checkGameHistoryRecordToInsertPlayData(play: GameHistoryRecordPlay, game: Game): void {}
 
   public async checkGameHistoryRecordToInsertData(gameHistoryRecordToInsert: GameHistoryRecordToInsert): Promise<void> {

[Killed] BlockStatement
providers/services/game-history/game-history-record.service.ts:27:26
 
   public checkGameHistoryRecordToInsertPlayData(play: GameHistoryRecordPlay, game: Game): void {
     const unmatchedSource = getNonexistentPlayer(game.players, play.source.players);
-    if (unmatchedSource) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedSource._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_SOURCE);
-    }
+    if (unmatchedSource) {}
     const unmatchedTarget = getNonexistentPlayer(game.players, play.targets?.map(target => target.player));
     if (unmatchedTarget) {
killedBy: Game History Record Service checkGameHistoryRecordToInsertPlayData should throw resource not found error when a source is not in the game [#0].
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"ffa3877cb789b83ad57ac1cb\" not found : Game Play - Player in `source.players` is not in the game players"

Received function did not throw

[Killed] BlockStatement
providers/services/game-history/game-history-record.service.ts:31:26
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedSource._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_SOURCE);
     }
     const unmatchedTarget = getNonexistentPlayer(game.players, play.targets?.map(target => target.player));
-    if (unmatchedTarget) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedTarget._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
-    }
+    if (unmatchedTarget) {}
     const unmatchedVoter = getNonexistentPlayer(game.players, play.votes?.map(vote => vote.source));
     if (unmatchedVoter) {
killedBy: Game History Record Service checkGameHistoryRecordToInsertPlayData should throw resource not found error when a target is not in the game [#1].
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"7278daabdadbde3e782cfc5a\" not found : Game Play - Player in `targets.player` is not in the game players"

Received function did not throw

[Killed] BlockStatement
providers/services/game-history/game-history-record.service.ts:35:25
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedTarget._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
     }
     const unmatchedVoter = getNonexistentPlayer(game.players, play.votes?.map(vote => vote.source));
-    if (unmatchedVoter) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedVoter._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
-    }
+    if (unmatchedVoter) {}
     const unmatchedVoteTarget = getNonexistentPlayer(game.players, play.votes?.map(vote => vote.target));
     if (unmatchedVoteTarget) {
killedBy: Game History Record Service checkGameHistoryRecordToInsertPlayData should throw resource not found error when a vote source is not in the game [#2].
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"a0429a6edbcd893acdfcb8bc\" not found : Game Play - Player in `votes.source` is not in the game players"

Received function did not throw

[Timeout] BlockStatement
providers/services/game-history/game-history-record.service.ts:39:30
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedVoter._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
     }
     const unmatchedVoteTarget = getNonexistentPlayer(game.players, play.votes?.map(vote => vote.target));
-    if (unmatchedVoteTarget) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedVoteTarget._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
-    }
+    if (unmatchedVoteTarget) {}
     if (play.chosenCard && !getAdditionalCardWithId(game.additionalCards, play.chosenCard._id)) {
       throw new ResourceNotFoundError(API_RESOURCES.GAME_ADDITIONAL_CARDS, play.chosenCard._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_CHOSEN_CARD);

[Killed] BlockStatement
providers/services/game-history/game-history-record.service.ts:42:97
     if (unmatchedVoteTarget) {
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedVoteTarget._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
     }
-    if (play.chosenCard && !getAdditionalCardWithId(game.additionalCards, play.chosenCard._id)) {
-      throw new ResourceNotFoundError(API_RESOURCES.GAME_ADDITIONAL_CARDS, play.chosenCard._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_CHOSEN_CARD);
-    }
+    if (play.chosenCard && !getAdditionalCardWithId(game.additionalCards, play.chosenCard._id)) {}
   }
 
killedBy: Game History Record Service checkGameHistoryRecordToInsertPlayData should throw resource not found error when chosen card is not in the game [#4].
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Additional card with id \"3adc3f86dee63edc5c0efb12\" not found : Game Play - Chosen card is not in the game additional cards"

Received function did not throw

[Timeout] BlockStatement
providers/services/game-history/game-history-record.service.ts:47:120
     }
   }
 
-  public async checkGameHistoryRecordToInsertData(gameHistoryRecordToInsert: GameHistoryRecordToInsert): Promise<void> {
-    const { gameId, play, revealedPlayers, deadPlayers } = gameHistoryRecordToInsert;
-    const game = await this.gameRepository.findOne({ _id: gameId });
-    if (game === null) {
-      throw new ResourceNotFoundError(API_RESOURCES.GAMES, gameId.toString(), RESOURCE_NOT_FOUND_REASONS.UNKNOWN_GAME_PLAY_GAME_ID);
-    }
-    const unmatchedRevealedPlayer = getNonexistentPlayer(game.players, revealedPlayers);
-    if (unmatchedRevealedPlayer) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedRevealedPlayer._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_REVEALED_PLAYER);
-    }
-    const unmatchedDeadPlayer = getNonexistentPlayer(game.players, deadPlayers);
-    if (unmatchedDeadPlayer) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedDeadPlayer._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_DEAD_PLAYER);
-    }
-    this.checkGameHistoryRecordToInsertPlayData(play, game);
-  }
+  public async checkGameHistoryRecordToInsertData(gameHistoryRecordToInsert: GameHistoryRecordToInsert): Promise<void> {}
 
   public async createGameHistoryRecord(gameHistoryRecordToInsert: GameHistoryRecordToInsert): Promise<GameHistoryRecord> {

[Killed] BlockStatement
providers/services/game-history/game-history-record.service.ts:54:34
       throw new ResourceNotFoundError(API_RESOURCES.GAMES, gameId.toString(), RESOURCE_NOT_FOUND_REASONS.UNKNOWN_GAME_PLAY_GAME_ID);
     }
     const unmatchedRevealedPlayer = getNonexistentPlayer(game.players, revealedPlayers);
-    if (unmatchedRevealedPlayer) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedRevealedPlayer._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_REVEALED_PLAYER);
-    }
+    if (unmatchedRevealedPlayer) {}
     const unmatchedDeadPlayer = getNonexistentPlayer(game.players, deadPlayers);
     if (unmatchedDeadPlayer) {
killedBy: Game History Record Service checkGameHistoryRecordToInsertData should throw resource not found error when a revealed player is not in the game [#1].
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
providers/services/game-history/game-history-record.service.ts:58:30
       throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedRevealedPlayer._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_REVEALED_PLAYER);
     }
     const unmatchedDeadPlayer = getNonexistentPlayer(game.players, deadPlayers);
-    if (unmatchedDeadPlayer) {
-      throw new ResourceNotFoundError(API_RESOURCES.PLAYERS, unmatchedDeadPlayer._id.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_DEAD_PLAYER);
-    }
+    if (unmatchedDeadPlayer) {}
     this.checkGameHistoryRecordToInsertPlayData(play, game);
   }
killedBy: Game History Record Service checkGameHistoryRecordToInsertData should throw resource not found error when a dead player is not in the game [#2].
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
