[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:19:59
 export class GamePlaysManagerService {
   public isSheriffElectionTime(sheriffGameOptions: SheriffGameOptions, currentTurn: number, currentPhase: GAME_PHASES): boolean {
     const { electedAt, isEnabled } = sheriffGameOptions;
-    return isEnabled && electedAt.turn === currentTurn && electedAt.phase === currentPhase;
+    return isEnabled && electedAt.turn === currentTurn && electedAt.phase !== currentPhase;
   }
 
killedBy: Game Plays Manager Service isSheriffElectionTime should return false when it's not the right phase.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
providers/services/game-play/game-plays-manager.service.ts:19:12
 export class GamePlaysManagerService {
   public isSheriffElectionTime(sheriffGameOptions: SheriffGameOptions, currentTurn: number, currentPhase: GAME_PHASES): boolean {
     const { electedAt, isEnabled } = sheriffGameOptions;
-    return isEnabled && electedAt.turn === currentTurn && electedAt.phase === currentPhase;
+    return isEnabled && electedAt.turn === currentTurn || electedAt.phase === currentPhase;
   }
 
killedBy: Game Plays Manager Service isSheriffElectionTime should return false when sheriff is not enabled even if it's the time.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:45:14
       [PLAYER_GROUPS.CHARMED]: this.isPiedPiperPlayableForNight,
     };
     if (specificGroupMethods[source] !== undefined) {
-      return specificGroupMethods[source]?.(game) === true;
+      return specificGroupMethods[source]?.(game) !== true;
     } else if (game instanceof CreateGameDto) {
       return true;
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 8

@@ -178,27 +178,31 @@
      Object {
        "action": "elect-sheriff",

[Timeout] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:55:41
 
   public isWhiteWerewolfPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.whiteWerewolf;
-    const shouldWhiteWerewolfBeCalled = wakingUpInterval > 0;
+    const shouldWhiteWerewolfBeCalled = wakingUpInterval <= 0;
     if (game instanceof CreateGameDto) {
       return shouldWhiteWerewolfBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:78:12
     }
     const { isPowerlessIfWerewolfDies } = game.options.roles.bigBadWolf;
     const bigBadWolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.BIG_BAD_WOLF);
-    return !!bigBadWolfPlayer && isPlayerAliveAndPowerful(bigBadWolfPlayer) && (!isPowerlessIfWerewolfDies || areAllWerewolvesAlive(game.players));
+    return true;
   }
 
killedBy: Game Plays Manager Service isBigBadWolfPlayableForNight should return false when big bad wolf is not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
providers/services/game-play/game-plays-manager.service.ts:78:12
     }
     const { isPowerlessIfWerewolfDies } = game.options.roles.bigBadWolf;
     const bigBadWolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.BIG_BAD_WOLF);
-    return !!bigBadWolfPlayer && isPlayerAliveAndPowerful(bigBadWolfPlayer) && (!isPowerlessIfWerewolfDies || areAllWerewolvesAlive(game.players));
+    return !!bigBadWolfPlayer && isPlayerAliveAndPowerful(bigBadWolfPlayer) || !isPowerlessIfWerewolfDies || areAllWerewolvesAlive(game.players);
   }
 
killedBy: Game Plays Manager Service isBigBadWolfPlayableForNight should return false when big bad wolf is not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:83:41
 
   public areThreeBrothersPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.threeBrothers;
-    const shouldThreeBrothersBeCalled = wakingUpInterval > 0;
+    const shouldThreeBrothersBeCalled = true;
     if (game instanceof CreateGameDto) {
       return shouldThreeBrothersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.THREE_BROTHERS);
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when three brothers are in the game dto but options specify that they are never called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:85:14
     const { wakingUpInterval } = game.options.roles.threeBrothers;
     const shouldThreeBrothersBeCalled = wakingUpInterval > 0;
     if (game instanceof CreateGameDto) {
-      return shouldThreeBrothersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.THREE_BROTHERS);
+      return true;
     }
     const threeBrothersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.THREE_BROTHERS);
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when three brothers are not in the game dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:89:12
     }
     const threeBrothersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.THREE_BROTHERS);
     const minimumBrotherCountToCall = 2;
-    return shouldThreeBrothersBeCalled && threeBrothersPlayers.filter(brother => brother.isAlive).length >= minimumBrotherCountToCall;
+    return false;
   }
 
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return true when three brothers are alive.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
providers/services/game-play/game-plays-manager.service.ts:89:12
     }
     const threeBrothersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.THREE_BROTHERS);
     const minimumBrotherCountToCall = 2;
-    return shouldThreeBrothersBeCalled && threeBrothersPlayers.filter(brother => brother.isAlive).length >= minimumBrotherCountToCall;
+    return shouldThreeBrothersBeCalled || threeBrothersPlayers.filter(brother => brother.isAlive).length >= minimumBrotherCountToCall;
   }
 
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when three brothers are not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:94:38
 
   public areTwoSistersPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.twoSisters;
-    const shouldTwoSistersBeCalled = wakingUpInterval > 0;
+    const shouldTwoSistersBeCalled = wakingUpInterval >= 0;
     if (game instanceof CreateGameDto) {
       return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return false when two sisters are in the game dto but options specify that they are never called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
providers/services/game-play/game-plays-manager.service.ts:99:12
       return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
     }
     const twoSistersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.TWO_SISTERS);
-    return shouldTwoSistersBeCalled && twoSistersPlayers.length > 0 && twoSistersPlayers.every(sister => sister.isAlive);
+    return shouldTwoSistersBeCalled || twoSistersPlayers.length > 0 && twoSistersPlayers.every(sister => sister.isAlive);
   }
 
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return false when two sisters are not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
providers/services/game-play/game-plays-manager.service.ts:114:52
       [ROLE_NAMES.PIED_PIPER]: this.isPiedPiperPlayableForNight,
       [ROLE_NAMES.WHITE_WEREWOLF]: this.isWhiteWerewolfPlayableForNight,
     };
-    if (specificRoleMethods[source] !== undefined) {
-      return specificRoleMethods[source]?.(game) === true;
-    }
+    if (specificRoleMethods[source] !== undefined) {}
     return player instanceof CreateGamePlayerDto || isPlayerAliveAndPowerful(player);
   }
killedBy: Game Plays Manager Service isRolePlayableForNight should call two sisters method when role is two sisters.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:115:54
       [ROLE_NAMES.WHITE_WEREWOLF]: this.isWhiteWerewolfPlayableForNight,
     };
     if (specificRoleMethods[source] !== undefined) {
-      return specificRoleMethods[source]?.(game) === true;
+      return specificRoleMethods[source]?.(game) === false;
     }
     return player instanceof CreateGamePlayerDto || isPlayerAliveAndPowerful(player);
killedBy: Game Plays Manager Service isRolePlayableForNight should call pied piper method when role is pied piper.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:115:14
       [ROLE_NAMES.WHITE_WEREWOLF]: this.isWhiteWerewolfPlayableForNight,
     };
     if (specificRoleMethods[source] !== undefined) {
-      return specificRoleMethods[source]?.(game) === true;
+      return false;
     }
     return player instanceof CreateGamePlayerDto || isPlayerAliveAndPowerful(player);
killedBy: Game Plays Manager Service isRolePlayableForNight should call two sisters method when role is two sisters.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:130:26
   }
 
   public getUpcomingNightPlays(game: CreateGameDto | Game): GamePlay[] {
-    const isFirstNight = game.turn === 1;
+    const isFirstNight = false;
     const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== true);
     const isSheriffElectionTime = this.isSheriffElectionTime(game.options.roles.sheriff, game.turn, game.phase);
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -178,20 +178,12 @@
      Object {
        "action": "elect-sheriff",

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:131:67
 
   public getUpcomingNightPlays(game: CreateGameDto | Game): GamePlay[] {
     const isFirstNight = game.turn === 1;
-    const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== true);
+    const eligibleNightPlays = gamePlaysNightOrder.filter(play => false);
     const isSheriffElectionTime = this.isSheriffElectionTime(game.options.roles.sheriff, game.turn, game.phase);
     const upcomingNightPlays: GamePlay[] = isSheriffElectionTime ? [sheriffElectionPlay] : [];
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the first night with official rules and some roles [#0].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

  Array [
    Object {
      "action": "elect-sheriff",

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:131:109
 
   public getUpcomingNightPlays(game: CreateGameDto | Game): GamePlay[] {
     const isFirstNight = game.turn === 1;
-    const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== true);
+    const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== false);
     const isSheriffElectionTime = this.isSheriffElectionTime(game.options.roles.sheriff, game.turn, game.phase);
     const upcomingNightPlays: GamePlay[] = isSheriffElectionTime ? [sheriffElectionPlay] : [];
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the second night with official rules and some roles [#2].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

  Array [
    Object {
+     "action": "charm",

[Killed] ArrayDeclaration
providers/services/game-play/game-plays-manager.service.ts:136:60
     const upcomingNightPlays: GamePlay[] = isSheriffElectionTime ? [sheriffElectionPlay] : [];
     return eligibleNightPlays.reduce((acc: GamePlay[], gamePlay) => {
       const { source, action } = gamePlay;
-      return this.isSourcePlayableForNight(game, source) ? [...acc, { source, action }] : acc;
+      return this.isSourcePlayableForNight(game, source) ? [] : acc;
     }, upcomingNightPlays);
   }
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the first night with official rules and some roles [#0].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Array [
-   Object {
-     "action": "elect-sheriff",
