[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:22:135
 export class GamePlaysValidatorService {
   public constructor(private readonly gameHistoryRecordService: GameHistoryRecordService) {}
 
-  public validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
-    const { chosenCard } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!chosenCard) {
-      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
-      }
-      return;
-    }
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_CARD);
-    }
-  }
+  public validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {}
 
   public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should throw error when chosen card is not defined but expected.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `chosenCard` is required on this current game's state"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:25:22
   public validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
     const { chosenCard } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!chosenCard) {
-      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
-      }
-      return;
-    }
+    if (!chosenCard) {}
     if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_CARD);
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:26:69
     const { chosenCard } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     if (!chosenCard) {
-      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
-      }
+      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {}
       return;
     }

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:31:67
       }
       return;
     }
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_CARD);
-    }
+    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should throw error when chosen card is defined but not expected.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `chosenCard` can't be set on this current game's state"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:36:109
     }
   }
 
-  public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankLifePotionTargets.length > 1) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
-    }
-    if (drankLifePotionTargets.length && (!doesPlayerHaveAttribute(drankLifePotionTargets[0].player, PLAYER_ATTRIBUTE_NAMES.EATEN) || !drankLifePotionTargets[0].player.isAlive)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_LIFE_POTION_TARGET);
-    }
-  }
+  public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {}
 
   public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when there are too much targets for life potion.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : There are too much targets which drank life potion (`targets.drankPotion`)"

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:37:9
   }
 
   public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankLifePotionTargets.length > 1) {
+    if (drankLifePotionTargets.length <= 1) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
     }
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when there are too much targets for life potion.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : There are too much targets which drank life potion (`targets.drankPotion`)"
Received message:   "Bad game play payload : Life potion can't be applied to this target (`targets.drankPotion`)"

      118 |         } else {
      119 |           stryCov_9fa48("763");
    > 120 |           throw new BadGamePlayPaylo

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:40:135
     if (drankLifePotionTargets.length > 1) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
     }
-    if (drankLifePotionTargets.length && (!doesPlayerHaveAttribute(drankLifePotionTargets[0].player, PLAYER_ATTRIBUTE_NAMES.EATEN) || !drankLifePotionTargets[0].player.isAlive)) {
+    if (drankLifePotionTargets.length && (!doesPlayerHaveAttribute(drankLifePotionTargets[0].player, PLAYER_ATTRIBUTE_NAMES.EATEN) || drankLifePotionTargets[0].player.isAlive)) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_LIFE_POTION_TARGET);
     }
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when life potion target is not alive.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Life potion can't be applied to this target (`targets.drankPotion`)"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:45:111
     }
   }
 
-  public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankDeathPotionTargets.length > 1) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
-    }
-    if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_DEATH_POTION_TARGET);
-    }
-  }
+  public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {}
 
   public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
killedBy: Game Plays Validator Service validateDrankDeathPotionTargets should throw error when there are too much targets for death potion.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : There are too much targets which drank death potion (`targets.drankPotion`)"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:46:45
   }
 
   public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankDeathPotionTargets.length > 1) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
-    }
+    if (drankDeathPotionTargets.length > 1) {}
     if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_DEATH_POTION_TARGET);
killedBy: Game Plays Validator Service validateDrankDeathPotionTargets should throw error when there are too much targets for death potion.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : There are too much targets which drank death potion (`targets.drankPotion`)"
Received message:   "Bad game play payload : Death potion can't be applied to this target (`targets.drankPotion`)"

      141 |         } else {
      142 |           stryCov_9fa48("774");
    > 143 |           throw new BadGamePlayPay

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:49:87
     if (drankDeathPotionTargets.length > 1) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
     }
-    if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_DEATH_POTION_TARGET);
-    }
+    if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {}
   }
 

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:54:173
     }
   }
 
-  public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
-    const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
-    const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
-    const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
-    const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
-    if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
-        hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_DRANK_POTION_TARGET);
-    }
-    this.validateDrankLifePotionTargets(drankLifePotionTargets);
-    this.validateDrankDeathPotionTargets(drankDeathPotionTargets);
-  }
+  public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when expected action is not USE_POTIONS but targets drank potions.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `targets.drankPotion` can't be set on this current game's state"

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:58:117
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
-    const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
+    const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion !== WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with life potion but already used it alone before.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `targets.drankPotion` can't be set on this current game's state"
Received message:   "Bad game play payload : Life potion can't be applied to this target (`targets.drankPotion`)"

      118 |         } else {
      119 |           stryCov_9fa48("763");
    > 120 |           throw new BadGamePlayPayloadError(BAD

[Killed] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:60:71
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
-    const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
+    const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.every(({
+  drankPotion
+}) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
     if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with death potion but already used it wit life potion before.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `targets.drankPotion` can't be set on this current game's state"

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:62:70
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
-    if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
+    if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource === ROLE_NAMES.WITCH) && drankPotionTargets.length ||
         hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_DRANK_POTION_TARGET);
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when expected source is not WITCH but targets drank potions.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `targets.drankPotion` can't be set on this current game's state"
Received message:   "Bad game play payload : Life potion can't be applied to this target (`targets.drankPotion`)"

      118 |         } else {
      119 |           stryCov_9fa48("763");
    > 120 |           throw new BadGamePlayPayloadError(BAD

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:70:176
     this.validateDrankDeathPotionTargets(drankDeathPotionTargets);
   }
 
-  public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
-    const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
-    const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
-    if (infectedTargets.length) {
-      if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
-      }
-      this.validateGamePlayTargetsBoundaries(infectedTargets, { min: 1, max: 1 });
-    }
-  }
+  public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {

[Timeout] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:74:43
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
-    const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
+    const hasVileFatherOfWolvesInfected = gameHistoryRecords.every(record => record.play.targets?.some(({
+  isInfected
+}) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:76:33
     const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
     const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
-    if (infectedTargets.length) {
-      if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
-      }
-      this.validateGamePlayTargetsBoundaries(infectedTargets, { min: 1, max: 1 });
-    }
+    if (infectedTargets.length) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when expected action is not EAT and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `targets.isInfected` can't be set on this current game's state"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:78:95
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {
       if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
-      }
+        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {}
       this.validateGamePlayTargetsBoundaries(infectedTargets, { min: 1, max: 1 });
     }
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when expected action is not EAT and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `targets.isInfected` can't be set on this current game's state"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:85:137
     }
   }
 
-  public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
-    }
-    if (upcomingGamePlaySource === ROLE_NAMES.BIG_BAD_WOLF &&
-      (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer) || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
-    }
-    const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF && (!targetedPlayer.isAlive || !isPlayerOnWerewolvesSide(targetedPlayer) ||
-      whiteWerewolfPlayer?._id === targetedPlayer._id)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WHITE_WEREWOLF_TARGET);
-    }
-  }
+  public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WEREWOLVES and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Werewolves can't eat this target"

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:88:9
   public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT) {
+    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.EAT) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should do nothing when game play action is not EAT.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:93:92
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
+    if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || isPlayerOnVillagersSide(targetedPlayer))) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WEREWOLVES and targeted player is from werewolves side.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Werewolves can't eat this target"

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:96:9
     if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
-    if (upcomingGamePlaySource === ROLE_NAMES.BIG_BAD_WOLF &&
+    if (upcomingGamePlaySource !== ROLE_NAMES.BIG_BAD_WOLF &&
       (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer) || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is BIG_BAD_WOLF and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Big bad wolf can't eat this target"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:107:133
     }
   }
 
-  public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SHOOT || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_HUNTER_TARGET);
-    }
-  }
+  public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Hunter can't shoot this target"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:110:9
   public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SHOOT || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
+    if (true) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Hunter can't shoot this target"

Received function did not throw
