[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:110:9
   public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SHOOT || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
+    if (false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should do nothing when game play action is not SHOOT.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:115:9
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive) {
+    if (false) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_HUNTER_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Hunter can't shoot this target"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:120:136
     }
   }
 
-  public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.BAN_VOTING || upcomingGamePlaySource !== ROLE_NAMES.SCAPEGOAT) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: game.players.length });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SCAPEGOAT_TARGETS);
-    }
-  }
+  public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : At least one of the scapegoat targets can't be banned from voting"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:123:9
   public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.BAN_VOTING || upcomingGamePlaySource !== ROLE_NAMES.SCAPEGOAT) {
+    if (true) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : At least one of the scapegoat targets can't be banned from voting"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:127:9
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: game.players.length });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
+    if (true) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SCAPEGOAT_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should do nothing when all scapegoat's targets are valid.
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Bad game play payload : At least one of the scapegoat targets can't be banned from voting"

      338 |         } else {
      339 |           stryCov_9fa48("929");
    > 340 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SCAPEGOAT_TARGETS);

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:127:84
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: game.players.length });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SCAPEGOAT_TARGETS);
-    }
+    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : At least one of the scapegoat targets can't be banned from voting"

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:132:132
     }
   }
 
-  public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.CUPID || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 2, max: 2 });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_CUPID_TARGETS);
-    }
-  }
+  public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:139:9
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 2, max: 2 });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
+    if (false) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_CUPID_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayCupidTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : At least one of the cupid targets can't be charmed"

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:144:130
     }
   }
 
-  public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.FOX || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SNIFF) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_FOX_TARGET);
-    }
-  }
+  public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:157:131
     }
   }
 
-  public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.SEER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.LOOK) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const seerPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.SEER);
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === seerPlayer?._id) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SEER_TARGET);
-    }
-  }
+  public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:160:55
   public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.SEER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.LOOK) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.SEER || upcomingGamePlayAction === GAME_PLAY_ACTIONS.LOOK) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlaySeerTargets should do nothing when game play action is not LOOK.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:171:132
     }
   }
 
-  public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.RAVEN || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.MARK) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_RAVEN_TARGET);
-    }
-  }
+  public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Raven can't mark this target"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:174:56
   public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.RAVEN || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.MARK) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.RAVEN || false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should do nothing when game play action is not MARK.
statusReason: Error: Bad game play payload : Raven can't mark this target

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:178:111
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_RAVEN_TARGET);
-    }
+    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Raven can't mark this target"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:178:9
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {
+    if (true) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_RAVEN_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should do nothing when there are no targets.
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Bad game play payload : Raven can't mark this target"

      461 |         } else {
      462 |           stryCov_9fa48("992");
    > 463 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_RAVEN_TARGET);

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:183:136
     }
   }
 
-  public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.WILD_CHILD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_MODEL) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const wildChildPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WILD_CHILD);
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === wildChildPlayer?._id) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WILD_CHILD_TARGET);
-    }
-  }
+  public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayWildChildTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Wild child can't choose this target as a model"

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:197:136
     }
   }
 
-  public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.PIED_PIPER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
-      return;
-    }
-    const { charmedPeopleCountPerNight } = game.options.roles.piedPiper;
-    const leftToCharmByPiedPiperPlayers = getLeftToCharmByPiedPiperPlayers(game.players);
-    const leftToCharmByPiedPiperPlayersCount = leftToCharmByPiedPiperPlayers.length;
-    const countToCharm = Math.min(charmedPeopleCountPerNight, leftToCharmByPiedPiperPlayersCount);
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: countToCharm, max: countToCharm });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !leftToCharmByPiedPiperPlayers.find(({ _id }) => player._id === _id))) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_PIED_PIPER_TARGETS);
-    }
-  }
+  public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {

[Killed] ArrowFunction
providers/services/game-play/game-plays-validator.service.ts:208:102
     const leftToCharmByPiedPiperPlayersCount = leftToCharmByPiedPiperPlayers.length;
     const countToCharm = Math.min(charmedPeopleCountPerNight, leftToCharmByPiedPiperPlayersCount);
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: countToCharm, max: countToCharm });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !leftToCharmByPiedPiperPlayers.find(({ _id }) => player._id === _id))) {
+    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !leftToCharmByPiedPiperPlayers.find(() => undefined))) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_PIED_PIPER_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayPiedPiperTargets should do nothing when pied piper targets are valid and limited to game options.
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Bad game play payload : At least one of the pied piper targets can't be charmed"

      537 |         } else {
      538 |           stryCov_9fa48("1030");
    > 539 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_PIED_PIPER_TARGETS);

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:213:173
     }
   }
 
-  public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.GUARD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.PROTECT) {
-      return;
-    }
-    const { canProtectTwice } = game.options.roles.guard;
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const lastGuardHistoryRecord = getLastGamePlayFromHistory(gameHistoryRecords, ROLE_NAMES.GUARD, GAME_PLAY_ACTIONS.PROTECT);
-    const lastProtectedPlayer = lastGuardHistoryRecord?.play.targets?.[0].player;
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id === targetedPlayer._id) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_GUARD_TARGET);
-    }
-  }
+  public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:224:56
     const lastGuardHistoryRecord = getLastGamePlayFromHistory(gameHistoryRecords, ROLE_NAMES.GUARD, GAME_PLAY_ACTIONS.PROTECT);
     const lastProtectedPlayer = lastGuardHistoryRecord?.play.targets?.[0].player;
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id === targetedPlayer._id) {
+    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id !== targetedPlayer._id) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_GUARD_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayGuardTargets should throw error when targeted player is the same as previous guard play and game option doesn't allow this.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Guard can't protect this target"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:224:36
     const lastGuardHistoryRecord = getLastGamePlayFromHistory(gameHistoryRecords, ROLE_NAMES.GUARD, GAME_PLAY_ACTIONS.PROTECT);
     const lastProtectedPlayer = lastGuardHistoryRecord?.play.targets?.[0].player;
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id === targetedPlayer._id) {
+    if (!targetedPlayer.isAlive || false) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_GUARD_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayGuardTargets should throw error when targeted player is the same as previous guard play and game option doesn't allow this.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Guard can't protect this target"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:229:175
     }
   }
 
-  public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
-      ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    const lastTieInVotesHistoryRecord = getLastGamePlayTieInVotesFromHistory(gameHistoryRecords);
-    const lastTieInVotesTargets = lastTieInVotesHistoryRecord?.play.targets ?? [];
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
-    }
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES && !lastTieInVotesTargets.find(({ player }) => player._id === targetedPlayer._id)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_SETTLE_VOTES_TARGET);
-    }
-  }
+  public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should throw error when targeted player is dead and upcoming action is DELEGATE.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Sheriff can't delegate his role to this target"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:232:9
   public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
+    if (false || !upcomingGamePlayAction ||
       ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
       return;
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when game play source is not SHERIFF.
statusReason: Error: Bad game play payload : Sheriff can't break the tie in votes with this target

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:240:9
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
     const lastTieInVotesHistoryRecord = getLastGamePlayTieInVotesFromHistory(gameHistoryRecords);
     const lastTieInVotesTargets = lastTieInVotesHistoryRecord?.play.targets ?? [];
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
+    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should throw error when targeted player is dead and upcoming action is DELEGATE.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : Sheriff can't delegate his role to this target"

Received function did not throw

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:243:9
     if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
     }
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES && !lastTieInVotesTargets.find(({ player }) => player._id === targetedPlayer._id)) {
+    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES || !lastTieInVotesTargets.find(({
+  player
+}) => player._id === targetedPlayer._id)) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_SETTLE_VOTES_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when targeted player for sheriff delegation is valid.
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Bad game play payload : Sheriff can't break the tie in votes with this target"

      618 |         } else {
      619 |           stryCov_9fa48("1087");
    > 620 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_SETTLE_VOTES_TARGET);

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:248:173
     }
   }
 
-  public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {
-    if (makeGamePlayTargetsWithRelationsDto.length < lengthBoundaries.min) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_LESS_TARGETS);
-    }
-    if (makeGamePlayTargetsWithRelationsDto.length > lengthBoundaries.max) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_TARGETS);
-    }
-  }
+  public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {}
 
   public validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
killedBy: Game Plays Validator Service validateGamePlayTargetsBoundaries should throw error when min boundary is not respected.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : There are too less targets for this current game's state"

Received function did not throw
