[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:277:11
     makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[] | undefined,
     game: Game,
     gameHistoryRecords: GameHistoryRecord[],
-  ): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction) {
-      return;
-    }
-    if (makeGamePlayTargetsWithRelationsDto === undefined || !makeGamePlayTargetsWithRelationsDto.length) {
-      if (requiredTargetsActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_TARGETS);
-      }
-      return;
-    }
-    if (![...requiredTargetsActions, ...optionalTargetsActions].includes(upcomingGamePlayAction)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_TARGETS);
-    }
-    this.validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
-  }
+  ): void {}
 
   public validateGamePlayVotesWithRelationsDtoData(makeGamePlayVotesWithRelationsDto: MakeGamePlayVoteWithRelationsDto[] | undefined, game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayTargetsWithRelationsDtoData should throw error when there is no targets but they are required.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `targets` is required on this current game's state"

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:283:68
       return;
     }
     if (makeGamePlayTargetsWithRelationsDto === undefined || !makeGamePlayTargetsWithRelationsDto.length) {
-      if (requiredTargetsActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_TARGETS);
-      }
+      if (requiredTargetsActions.includes(upcomingGamePlayAction)) {}
       return;
     }

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:294:153
     this.validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
   }
 
-  public validateGamePlayVotesWithRelationsDtoData(makeGamePlayVotesWithRelationsDto: MakeGamePlayVoteWithRelationsDto[] | undefined, game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction) {
-      return;
-    }
-    if (makeGamePlayVotesWithRelationsDto === undefined || !makeGamePlayVotesWithRelationsDto.length) {
-      if (requiredVotesActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_VOTES);
-      }
-      return;
-    }
-    if (!requiredVotesActions.includes(upcomingGamePlayAction)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_VOTES);
-    }
-    if (makeGamePlayVotesWithRelationsDto.some(({ source, target }) => source._id === target._id)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.SAME_SOURCE_AND_TARGET_VOTE);
-    }
-  }
+  public validateGamePlayVotesWithRelationsDtoData(makeGamePlayVotesWithRelationsDto: MakeGamePlayVoteWithRelationsDto[] | undefined, game: Game): void {}
 
   public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:300:66
       return;
     }
     if (makeGamePlayVotesWithRelationsDto === undefined || !makeGamePlayVotesWithRelationsDto.length) {
-      if (requiredVotesActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_VOTES);
-      }
+      if (requiredVotesActions.includes(upcomingGamePlayAction)) {}
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there is no votes but they are required.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `votes` is required on this current game's state"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:305:65
       }
       return;
     }
-    if (!requiredVotesActions.includes(upcomingGamePlayAction)) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_VOTES);
-    }
+    if (!requiredVotesActions.includes(upcomingGamePlayAction)) {}
     if (makeGamePlayVotesWithRelationsDto.some(({ source, target }) => source._id === target._id)) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.SAME_SOURCE_AND_TARGET_VOTE);
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there are votes but they are expected.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `votes` can't be set on this current game's state"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:313:135
     }
   }
 
-  public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
-    const { chosenSide } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (chosenSide && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_SIDE);
-    }
-    if (!chosenSide && upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_SIDE);
-    }
-  }
+  public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {}
 
   public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenSideData should throw error when chosenSide is not defined and game play action is CHOOSE_SIDE.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `chosenSide` is required on this current game's state"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:316:9
   public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
     const { chosenSide } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (chosenSide && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
+    if (true) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_SIDE);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenSideData should throw error when chosenSide is not defined and game play action is CHOOSE_SIDE.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `chosenSide` is required on this current game's state"
Received message:   "Bad game play payload : `chosenSide` can't be set on this current game's state"

      778 |         } else {
      779 |           stryCov_9fa48("1153");
    > 780 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REA

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:324:178
     }
   }
 
-  public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const { doesJudgeRequestAnotherVote } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction || doesJudgeRequestAnotherVote === undefined) {
-      return;
-    }
-    const { voteRequestsCount } = game.options.roles.stutteringJudge;
-    const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
-    const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
-    if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
-        !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
-        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
-    }
-  }
+  public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but upcoming action is not vote.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `doesJudgeRequestAnotherVote` can't be set on this current game's state"

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:333:9
     const { voteRequestsCount } = game.options.roles.stutteringJudge;
     const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
-    if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
-        !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
-        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
+    if (true) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should do nothing when judge request another vote and he can.
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Bad game play payload : `doesJudgeRequestAnotherVote` can't be set on this current game's state"

      818 |         } else {
      819 |           stryCov_9fa48("1184");
    > 820 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:333:9
     const { voteRequestsCount } = game.options.roles.stutteringJudge;
     const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
-    if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
+    if (stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
         !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
         gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should do nothing when judge request another vote and he can.
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Bad game play payload : `doesJudgeRequestAnotherVote` can't be set on this current game's state"

      818 |         } else {
      819 |           stryCov_9fa48("1184");
    > 820 |           throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:335:69
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
     if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
         !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
-        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
-    }
+        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but upcoming action is not vote.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Bad game play payload : `doesJudgeRequestAnotherVote` can't be set on this current game's state"

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:340:140
     }
   }
 
-  public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {
-    const { votes, targets } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlay = getUpcomingGamePlay(game.upcomingPlays);
-    if (!upcomingGamePlay) {
-      throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.NO_UPCOMING_GAME_PLAY);
-    }
-    const gameHistoryRecords = await this.gameHistoryRecordService.getGameHistoryRecordsByGameId(game._id);
-    this.validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto, game, gameHistoryRecords);
-    this.validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto, game);
-    this.validateGamePlayVotesWithRelationsDtoData(votes, game);
-    this.validateGamePlayTargetsWithRelationsDtoData(targets, game, gameHistoryRecords);
-    this.validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto, game);
-  }
+  public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {}
 }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoData should throw error when there is no upcoming game play action.
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:343:9
   public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {
     const { votes, targets } = makeGamePlayWithRelationsDto;
     const upcomingGamePlay = getUpcomingGamePlay(game.upcomingPlays);
-    if (!upcomingGamePlay) {
+    if (upcomingGamePlay) {
       throw new BadGamePlayPayloadError(BAD_GAME_PLAY_PAYLOAD_REASONS.NO_UPCOMING_GAME_PLAY);
     }
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400
