[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:16:30
   public getRandomRolesForSide(availableRoles: Role[], rolesToPickCount: number, side: ROLE_SIDES): Role[] {
     const randomRoles: Role[] = [];
     const availableSidedRoles = getRolesWithSide(availableRoles, side);
-    const defaultSidedRole = side === ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
+    const defaultSidedRole = false ? defaultVillagerRole : defaultWerewolfRole;
     let randomRolesToPickCount = 1;
     for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get only villagers when side is villagers and no roles are available.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
game/providers/services/game-random-composition.service.ts:18:21
     const availableSidedRoles = getRolesWithSide(availableRoles, side);
     const defaultSidedRole = side === ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
     let randomRolesToPickCount = 1;
-    for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
+    for (let i = 0; i >= rolesToPickCount; i += randomRolesToPickCount) {
       const leftRolesToPickCount = rolesToPickCount - i;
       const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get only werewolves when side is werewolves and no roles are available.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 0
Received array:  []

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:20:66
     let randomRolesToPickCount = 1;
     for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
       const leftRolesToPickCount = rolesToPickCount - i;
-      const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
+      const leftRolesToPick = availableSidedRoles.filter(role => false);
       const randomRole = sample(leftRolesToPick);
       if (randomRole === undefined) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get seer, witch, pied piper, and all others are villagers when side is villagers and only seer an
statusReason: Error: expect(received).toIncludeAllMembers(expected)

Expected list to have all of the following members:
Received:

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:57:14
       }
       const isRolePermitted = !excludedRoles.includes(role.name);
       const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
-      return isRolePermitted && isRoleMinInGameRespected;
+      return true;
     });
   }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should not include some roles when there are excluded.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
