[Killed] EqualityOperator
game/providers/services/game.service.ts:50:16
     const game = await this.gameRepository.findOne({ _id: gameId });
     if (game === null) {
       throw new ResourceNotFoundError(API_RESOURCES.GAMES, gameId.toString());
-    } else if (game.status !== GAME_STATUSES.PLAYING) {
+    } else if (game.status === GAME_STATUSES.PLAYING) {
       throw new BadResourceMutationError(API_RESOURCES.GAMES, game._id.toString(), BAD_RESOURCE_MUTATION_REASONS.GAME_NOT_PLAYING);
     }
killedBy: Game Controller DELETE /game/:id should get a bad request error when game doesn't have playing status.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
game/providers/services/game.service.ts:50:55
     const game = await this.gameRepository.findOne({ _id: gameId });
     if (game === null) {
       throw new ResourceNotFoundError(API_RESOURCES.GAMES, gameId.toString());
-    } else if (game.status !== GAME_STATUSES.PLAYING) {
-      throw new BadResourceMutationError(API_RESOURCES.GAMES, game._id.toString(), BAD_RESOURCE_MUTATION_REASONS.GAME_NOT_PLAYING);
-    }
+    } else if (game.status !== GAME_STATUSES.PLAYING) {}
     return game;
   }
killedBy: Game Controller DELETE /game/:id should get a bad request error when game doesn't have playing status.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200
