[Killed] MethodExpression
modules/role/helpers/role.helper.ts:5:10
 import type { Role } from "../types/role.type";
 
 function getRolesWithSide(roles: Role[], side: ROLE_SIDES): Role[] {
-  return roles.filter(role => role.side === side);
+  return roles;
 }
 
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getGameRandomComposition should return random composition when called [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
