[Killed] BlockStatement
shared/error/helpers/error.helper.ts:7:45
 import { ResourceNotFoundError } from "../types/resource-not-found-error.type";
 
 function getControllerRouteError(err: unknown): unknown {
-  if (err instanceof ResourceNotFoundError) {
-    return new NotFoundException(err.message);
-  } else if (err instanceof BadResourceMutationError || err instanceof BadGamePlayPayloadError) {
+  if (err instanceof ResourceNotFoundError) {} else if (err instanceof BadResourceMutationError || err instanceof BadGamePlayPayloadError) {
     return new BadRequestException(err.message);
   }
killedBy: Game Controller GET /game/:id should get a not found error when id doesn't exist in base.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] LogicalOperator
shared/error/helpers/error.helper.ts:9:14
 function getControllerRouteError(err: unknown): unknown {
   if (err instanceof ResourceNotFoundError) {
     return new NotFoundException(err.message);
-  } else if (err instanceof BadResourceMutationError || err instanceof BadGamePlayPayloadError) {
+  } else if (err instanceof BadResourceMutationError && err instanceof BadGamePlayPayloadError) {
     return new BadRequestException(err.message);
   }
killedBy: Game Controller DELETE /game/:id should get a bad request error when game doesn't have playing status.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
shared/error/helpers/error.helper.ts:9:97
 function getControllerRouteError(err: unknown): unknown {
   if (err instanceof ResourceNotFoundError) {
     return new NotFoundException(err.message);
-  } else if (err instanceof BadResourceMutationError || err instanceof BadGamePlayPayloadError) {
-    return new BadRequestException(err.message);
-  }
+  } else if (err instanceof BadResourceMutationError || err instanceof BadGamePlayPayloadError) {}
   return err;
 }
killedBy: Game Controller DELETE /game/:id should get a bad request error when game doesn't have playing status.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500
