[Killed] ConditionalExpression
shared/error/types/bad-resource-mutation-error.type.ts:10:9
   public constructor(resource: API_RESOURCES, id: string, reason?: BAD_RESOURCE_MUTATION_REASONS) {
     const resourceSingularForm = getResourceSingularForm(resource);
     let message = `Bad mutation for ${upperFirst(resourceSingularForm)} with id "${id}"`;
-    if (reason) {
+    if (true) {
       message += ` : ${reason}`;
     }
killedBy: Error Helper getControllerRouteError should return a BadRequestException when error is BadResourceMutationError without a reason.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bad mutation for Game with id \"123\""
Received: "Bad mutation for Game with id \"123\" : undefined"

[Killed] BlockStatement
shared/error/types/bad-resource-mutation-error.type.ts:10:17
   public constructor(resource: API_RESOURCES, id: string, reason?: BAD_RESOURCE_MUTATION_REASONS) {
     const resourceSingularForm = getResourceSingularForm(resource);
     let message = `Bad mutation for ${upperFirst(resourceSingularForm)} with id "${id}"`;
-    if (reason) {
-      message += ` : ${reason}`;
-    }
+    if (reason) {}
     super(message);
   }
killedBy: Game Controller DELETE /game/:id should get a bad request error when game doesn't have playing status.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bad mutation for Game with id \"5bedb44a49457baf091da34e\" : Game doesn't have status with value \"playing\""
Received: "Bad mutation for Game with id \"5bedb44a49457baf091da34e\""

[Killed] StringLiteral
shared/error/types/bad-resource-mutation-error.type.ts:11:18
     const resourceSingularForm = getResourceSingularForm(resource);
     let message = `Bad mutation for ${upperFirst(resourceSingularForm)} with id "${id}"`;
     if (reason) {
-      message += ` : ${reason}`;
+      message += ``;
     }
     super(message);
killedBy: Game Service getGameAndCheckPlayingStatus should throw an error when game doesn't have playing status.
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Bad mutation for Game with id \"16400743fba2d8540be385ed\" : Game doesn't have status with value \"playing\""
Received message:   "Bad mutation for Game with id \"16400743fba2d8540be385ed\""

      123 |         } else {
      124 |           stryCov_9fa48("1279");
    > 125 |           throw new BadResourceMutationError(API_R
