[Killed] ConditionalExpression
shared/error/types/resource-not-found-error.type.ts:10:9
   public constructor(resource: API_RESOURCES, id: string, reason?: RESOURCE_NOT_FOUND_REASONS) {
     const resourceSingularForm = getResourceSingularForm(resource);
     let message = `${upperFirst(resourceSingularForm)} with id "${id}" not found`;
-    if (reason) {
+    if (true) {
       message += ` : ${reason}`;
     }
killedBy: Game Controller GET /game/:id should get a not found error when id doesn't exist in base.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Game with id \"eacee86ce1701ced31b0bf9a\" not found"
Received: "Game with id \"eacee86ce1701ced31b0bf9a\" not found : undefined"

[Killed] ConditionalExpression
shared/error/types/resource-not-found-error.type.ts:10:9
   public constructor(resource: API_RESOURCES, id: string, reason?: RESOURCE_NOT_FOUND_REASONS) {
     const resourceSingularForm = getResourceSingularForm(resource);
     let message = `${upperFirst(resourceSingularForm)} with id "${id}" not found`;
-    if (reason) {
+    if (false) {
       message += ` : ${reason}`;
     }
killedBy: Game Play Helper getVotesWithRelationsFromMakeGamePlayDto should throw error when votes contains one unknown source.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Player with id \"875aead935fbfcfd19c1cad9\" not found : Game Play - Player in `votes.source` is not in the game players"
Received message:   "Player with id \"875aead935fbfcfd19c1cad9\" not found"

      83 |           } else {
      84 |             stryCov_9fa48("337");
    > 85 |             throw new ResourceNotFoundError(API_RESO
