[Killed] StringLiteral
config/database/helpers/database.helper.ts:12:10
   const username = configService.getOrThrow<string>("DATABASE_USERNAME");
   const password = configService.getOrThrow<string>("DATABASE_PASSWORD");
   return {
-    uri: `mongodb://${host}:${port}`,
+    uri: ``,
     dbName: databaseName,
     authSource: "admin",
killedBy: Database Helper mongooseModuleFactory should return connection string when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
    "dbName": "test",
    "pass": "password",

[Killed] StringLiteral
config/database/helpers/database.helper.ts:14:17
   return {
     uri: `mongodb://${host}:${port}`,
     dbName: databaseName,
-    authSource: "admin",
+    authSource: "",
     user: username,
     pass: encodeURIComponent(password),
killedBy: Database Helper mongooseModuleFactory should return connection string when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "authSource": "admin",
