[Killed] BlockStatement
config/env/helpers/env.helper.ts:8:26
 function validate(config: Record<string, unknown>): EnvironmentVariables {
   const validatedConfig = plainToInstance(EnvironmentVariables, config, { enableImplicitConversion: true });
   const errors = validateSync(validatedConfig);
-  if (errors.length > 0) {
-    throw new Error(errors.toString());
-  }
+  if (errors.length > 0) {}
   return validatedConfig;
 }
killedBy: Config Env Helper validate should throw error when env variables is not valid.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "An instance of EnvironmentVariables has failed the validation"

Received function did not throw

[Killed] ConditionalExpression
config/env/helpers/env.helper.ts:8:7
 function validate(config: Record<string, unknown>): EnvironmentVariables {
   const validatedConfig = plainToInstance(EnvironmentVariables, config, { enableImplicitConversion: true });
   const errors = validateSync(validatedConfig);
-  if (errors.length > 0) {
+  if (false) {
     throw new Error(errors.toString());
   }
killedBy: Config Env Helper validate should throw error when env variables is not valid.
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "An instance of EnvironmentVariables has failed the validation"

Received function did not throw

[Killed] LogicalOperator
config/env/helpers/env.helper.ts:16:21
 
 function getEnvPath(): string {
   const basePath = "env/.env.";
-  const envSuffix = process.env.NODE_ENV ?? "development";
+  const envSuffix = process.env.NODE_ENV && "development";
   return `${basePath}${envSuffix}`;
 }
killedBy: Config Env Helper getEnvPath should return default development env path when NODE_ENV is undefined.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "env/.env.development"
Received: "env/.env.undefined"

[Killed] StringLiteral
config/env/helpers/env.helper.ts:16:45
 
 function getEnvPath(): string {
   const basePath = "env/.env.";
-  const envSuffix = process.env.NODE_ENV ?? "development";
+  const envSuffix = process.env.NODE_ENV ?? "";
   return `${basePath}${envSuffix}`;
 }
killedBy: Config Env Helper getEnvPath should return default development env path when NODE_ENV is undefined.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "env/.env.development"
Received: "env/.env."

[Killed] StringLiteral
config/env/helpers/env.helper.ts:22:20
 
 function getEnvPaths(): string[] {
   const envPath = getEnvPath();
-  return [envPath, `${envPath}.local`];
+  return [envPath, ``];
 }
 
killedBy: Config Env Helper getEnvPaths should return default and local test env paths when function is called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "env/.env.test",
-   "env/.env.test.local",
