[Killed] BooleanLiteral
dto/base/decorators/composition-has-villager.decorator.ts:10:53
 import { ROLE_SIDES } from "../../../../role/enums/role.enum";
 
 function doesCompositionHaveAtLeastOneVillager(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(player => isObject(player) || !has(player, ["role", "name"]))) {
     return false;
   }
killedBy: Composition Has Villager Decorator doesCompositionHaveAtLeastOneVillager should return true when there is at least one villager in composition.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
dto/base/decorators/composition-has-villager.decorator.ts:10:53
 import { ROLE_SIDES } from "../../../../role/enums/role.enum";
 
 function doesCompositionHaveAtLeastOneVillager(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(player => false)) {
     return false;
   }
killedBy: Composition Has Villager Decorator doesCompositionHaveAtLeastOneVillager should return false when one of the players is not an object.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
dto/base/decorators/composition-has-villager.decorator.ts:11:12
 
 function doesCompositionHaveAtLeastOneVillager(value?: unknown): boolean {
   if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
-    return false;
+    return true;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
killedBy: Composition Has Villager Decorator doesCompositionHaveAtLeastOneVillager should return false when players are undefined.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
dto/base/decorators/composition-has-villager.decorator.ts:14:46
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.VILLAGERS);
+  const werewolfRoles = roles.filter(role => false);
   return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] MethodExpression
dto/base/decorators/composition-has-villager.decorator.ts:14:25
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.VILLAGERS);
+  const werewolfRoles = roles;
   return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
killedBy: Composition Has Villager Decorator doesCompositionHaveAtLeastOneVillager should return false when composition is full of werewolves.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
dto/base/decorators/composition-has-villager.decorator.ts:15:10
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.VILLAGERS);
-  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
+  return players.every(({
+  role
+}) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
 
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] EqualityOperator
dto/base/decorators/composition-has-villager.decorator.ts:15:72
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.VILLAGERS);
-  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
+  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name !== werewolfRole.name));
 }
 
killedBy: Composition Has Villager Decorator doesCompositionHaveAtLeastOneVillager should return false when composition is full of werewolves.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
