[Killed] ConditionalExpression
dto/base/decorators/composition-has-werewolf.decorator.ts:10:7
 import { ROLE_SIDES } from "../../../../role/enums/role.enum";
 
 function doesCompositionHaveAtLeastOneWerewolf(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (false) {
     return false;
   }
killedBy: Game Controller POST /games should not allow game creation when no players are provided [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ArrowFunction
dto/base/decorators/composition-has-werewolf.decorator.ts:10:43
 import { ROLE_SIDES } from "../../../../role/enums/role.enum";
 
 function doesCompositionHaveAtLeastOneWerewolf(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(() => undefined)) {
     return false;
   }
killedBy: Composition Has Werewolf Decorator doesCompositionHaveAtLeastOneWerewolf should return false when one of the players is not an object.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
dto/base/decorators/composition-has-werewolf.decorator.ts:14:46
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.WEREWOLVES);
+  const werewolfRoles = roles.filter(role => true);
   return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
killedBy: Game Controller POST /games should not allow game creation when there is no werewolf in game's composition [#9].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
dto/base/decorators/composition-has-werewolf.decorator.ts:14:46
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.WEREWOLVES);
+  const werewolfRoles = roles.filter(role => false);
   return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] MethodExpression
dto/base/decorators/composition-has-werewolf.decorator.ts:15:10
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.WEREWOLVES);
-  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
+  return players.every(({
+  role
+}) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
 }
 
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] EqualityOperator
dto/base/decorators/composition-has-werewolf.decorator.ts:15:72
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   const werewolfRoles = roles.filter(role => role.side === ROLE_SIDES.WEREWOLVES);
-  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name === werewolfRole.name));
+  return players.some(({ role }) => werewolfRoles.find(werewolfRole => role.name !== werewolfRole.name));
 }
 
killedBy: Game Controller POST /games should not allow game creation when there is no werewolf in game's composition [#9].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] StringLiteral
dto/base/decorators/composition-has-werewolf.decorator.ts:19:10
 }
 
 function getCompositionHasWerewolfDefaultMessage(): string {
-  return "one of the players.role must have at least one role from `werewolves` side";
+  return "";
 }
 
killedBy: Game Controller POST /games should not allow game creation when there is no werewolf in game's composition [#9].
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: "one of the players.role must have at least one role from `werewolves` side"
Received array: [""]
