[Killed] ArrowFunction
dto/base/decorators/composition-positions-consistency.decorator.ts:6:43
 import isObject from "isobject";
 
 function doesCompositionHaveConsistentPositions(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player))) {
+  if (!Array.isArray(value) || value.some(() => undefined)) {
     return false;
   }
killedBy: Composition Positions Consistency Decorator doesCompositionHaveConsistentPositions should return false when one of the players is not an object.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
dto/base/decorators/composition-positions-consistency.decorator.ts:6:73
 import isObject from "isobject";
 
 function doesCompositionHaveConsistentPositions(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player))) {
-    return false;
-  }
+  if (!Array.isArray(value) || value.some(player => !isObject(player))) {}
   const players = value as { position?: number }[];
   const uniquePositions = players.reduce<number[]>((acc, { position }) => {
killedBy: Game Controller POST /games should not allow game creation when no players are provided [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BooleanLiteral
dto/base/decorators/composition-positions-consistency.decorator.ts:7:12
 
 function doesCompositionHaveConsistentPositions(value?: unknown): boolean {
   if (!Array.isArray(value) || value.some(player => !isObject(player))) {
-    return false;
+    return true;
   }
   const players = value as { position?: number }[];
killedBy: Composition Positions Consistency Decorator doesCompositionHaveConsistentPositions should return false when players are undefined.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
dto/base/decorators/composition-positions-consistency.decorator.ts:11:62
   }
   const players = value as { position?: number }[];
   const uniquePositions = players.reduce<number[]>((acc, { position }) => {
-    if (position !== undefined && !acc.includes(position) && position < players.length) {
+    if (position !== undefined && !acc.includes(position) && true) {
       acc.push(position);
     }
killedBy: Game Controller POST /games should not allow game creation when one of the player position is not consistent faced to others [#11].
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: "players.position must be all set or all undefined. Please check that every player has unique position, from 0 to players.length - 1"
Received array: ["one of the players.role must have at least one role from `werewolves` side"]

[Killed] BooleanLiteral
dto/base/decorators/composition-positions-consistency.decorator.ts:11:35
   }
   const players = value as { position?: number }[];
   const uniquePositions = players.reduce<number[]>((acc, { position }) => {
-    if (position !== undefined && !acc.includes(position) && position < players.length) {
+    if (position !== undefined && acc.includes(position) && position < players.length) {
       acc.push(position);
     }
killedBy: Game Controller POST /games should not allow game creation when one of the player position is not consistent faced to others [#11].
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: "players.position must be all set or all undefined. Please check that every player has unique position, from 0 to players.length - 1"
Received array: ["one of the players.role must have at least one role from `werewolves` side"]

[Killed] EqualityOperator
dto/base/decorators/composition-positions-consistency.decorator.ts:16:42
     }
     return acc;
   }, []);
-  return uniquePositions.length === 0 || uniquePositions.length === players.length;
+  return uniquePositions.length === 0 || uniquePositions.length !== players.length;
 }
 
killedBy: Game Controller POST /games should not allow game creation when one of the player position is not consistent faced to others [#11].
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: "players.position must be all set or all undefined. Please check that every player has unique position, from 0 to players.length - 1"
Received array: ["one of the players.role must have at least one role from `werewolves` side"]

[Killed] ConditionalExpression
dto/base/decorators/composition-positions-consistency.decorator.ts:16:10
     }
     return acc;
   }, []);
-  return uniquePositions.length === 0 || uniquePositions.length === players.length;
+  return false || uniquePositions.length === players.length;
 }
 
killedBy: Composition Positions Consistency Decorator doesCompositionHaveConsistentPositions should return true when there is no position set in composition.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
