[Killed] BooleanLiteral
dto/base/decorators/composition-roles-max-in-game.decorator.ts:9:53
 import type { ROLE_NAMES } from "../../../../role/enums/role.enum";
 
 function areCompositionRolesMaxInGameRespected(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(player => isObject(player) || !has(player, ["role", "name"]))) {
     return false;
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
dto/base/decorators/composition-roles-max-in-game.decorator.ts:9:74
 import type { ROLE_NAMES } from "../../../../role/enums/role.enum";
 
 function areCompositionRolesMaxInGameRespected(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(player => !isObject(player) || has(player, ["role", "name"]))) {
     return false;
   }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getGameRandomComposition should return random composition when called [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
dto/base/decorators/composition-roles-max-in-game.decorator.ts:13:10
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  return roles.every(role => {
-    const roleCount = players.filter(player => player.role.name === role.name).length;
-    return roleCount <= role.maxInGame;
-  });
+  return roles.some(role => {
+  const roleCount = players.filter(player => player.role.name === role.name).length;
+  return roleCount <= role.maxInGame;
+});
 }
 
killedBy: Composition Roles Max In Game Decorator areCompositionRolesMaxInGameRespected should return false when there is 2 players with the same role but max in game is 1.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] BlockStatement
dto/base/decorators/composition-roles-max-in-game.decorator.ts:13:30
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  return roles.every(role => {
-    const roleCount = players.filter(player => player.role.name === role.name).length;
-    return roleCount <= role.maxInGame;
-  });
+  return roles.every(role => {});
 }
 

[Killed] MethodExpression
dto/base/decorators/composition-roles-max-in-game.decorator.ts:14:23
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles.every(role => {
-    const roleCount = players.filter(player => player.role.name === role.name).length;
+    const roleCount = players.length;
     return roleCount <= role.maxInGame;
   });
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ArrowFunction
dto/base/decorators/composition-roles-max-in-game.decorator.ts:14:38
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles.every(role => {
-    const roleCount = players.filter(player => player.role.name === role.name).length;
+    const roleCount = players.filter(() => undefined).length;
     return roleCount <= role.maxInGame;
   });
killedBy: Game Controller POST /games should not allow game creation when there is two witches in the same game [#7].
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: "players.role can't exceed role maximum occurrences in game. Please check `maxInGame` property of roles"
Received array: ["one of the players.role must have at least one role from `werewolves` side"]

[Killed] EqualityOperator
dto/base/decorators/composition-roles-max-in-game.decorator.ts:15:12
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles.every(role => {
     const roleCount = players.filter(player => player.role.name === role.name).length;
-    return roleCount <= role.maxInGame;
+    return roleCount < role.maxInGame;
   });
 }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] EqualityOperator
dto/base/decorators/composition-roles-max-in-game.decorator.ts:15:12
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles.every(role => {
     const roleCount = players.filter(player => player.role.name === role.name).length;
-    return roleCount <= role.maxInGame;
+    return roleCount > role.maxInGame;
   });
 }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] StringLiteral
dto/base/decorators/composition-roles-max-in-game.decorator.ts:20:10
 }
 
 function getCompositionRolesMaxInGameDefaultMessage(): string {
-  return "players.role can't exceed role maximum occurrences in game. Please check `maxInGame` property of roles";
+  return "";
 }
 
killedBy: Game Controller POST /games should not allow game creation when there is two witches in the same game [#7].
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: "players.role can't exceed role maximum occurrences in game. Please check `maxInGame` property of roles"
Received array: ["one of the players.role must have at least one role from `werewolves` side", ""]
