[Killed] LogicalOperator
dto/base/decorators/composition-roles-min-in-game.decorator.ts:10:53
 import type { Role } from "../../../../role/types/role.type";
 
 function areCompositionRolesMinInGameRespected(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(player => !isObject(player) && !has(player, ["role", "name"]))) {
     return false;
   }
killedBy: Composition Roles Min In Game Decorator areCompositionRolesMinInGameRespected should return false when one of the players doesn't have the good structure.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
dto/base/decorators/composition-roles-min-in-game.decorator.ts:10:53
 import type { Role } from "../../../../role/types/role.type";
 
 function areCompositionRolesMinInGameRespected(value?: unknown): boolean {
-  if (!Array.isArray(value) || value.some(player => !isObject(player) || !has(player, ["role", "name"]))) {
+  if (!Array.isArray(value) || value.some(player => isObject(player) || !has(player, ["role", "name"]))) {
     return false;
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] MethodExpression
dto/base/decorators/composition-roles-min-in-game.decorator.ts:14:10
     return false;
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
-  return roles
-    .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
-    .every(role => {
-      const roleCount = players.filter(player => player.role.name === role.name).length;
-      return roleCount === 0 || roleCount >= role.minInGame;
-    });
+  return roles.filter((role): role is Role & {
+  minInGame: number;
+} => role.minInGame !== undefined).some(role => {
+  const roleCount = players.filter(player => player.role.name === role.name).length;
+  return roleCount === 0 || roleCount >= role.minInGame;
+});
 }
 
killedBy: Game Controller POST /games should not allow game creation when there is only one brother in the same game [#6].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] EqualityOperator
dto/base/decorators/composition-roles-min-in-game.decorator.ts:15:61
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles
-    .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
+    .filter((role): role is Role & { minInGame: number } => role.minInGame === undefined)
     .every(role => {
       const roleCount = players.filter(player => player.role.name === role.name).length;
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Timeout] ConditionalExpression
dto/base/decorators/composition-roles-min-in-game.decorator.ts:15:61
   }
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles
-    .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
+    .filter((role): role is Role & { minInGame: number } => true)
     .every(role => {
       const roleCount = players.filter(player => player.role.name === role.name).length;

[Killed] BlockStatement
dto/base/decorators/composition-roles-min-in-game.decorator.ts:16:20
   const players = value as { role: { name: ROLE_NAMES } }[];
   return roles
     .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
-    .every(role => {
-      const roleCount = players.filter(player => player.role.name === role.name).length;
-      return roleCount === 0 || roleCount >= role.minInGame;
-    });
+    .every(role => {});
 }
 
killedBy: Composition Roles Min In Game Decorator areCompositionRolesMinInGameRespected should return true when players are empty.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
dto/base/decorators/composition-roles-min-in-game.decorator.ts:17:50
   return roles
     .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
     .every(role => {
-      const roleCount = players.filter(player => player.role.name === role.name).length;
+      const roleCount = players.filter(player => false).length;
       return roleCount === 0 || roleCount >= role.minInGame;
     });
killedBy: Composition Roles Min In Game Decorator areCompositionRolesMinInGameRespected should return false when there is only 1 player with a role which min in game is 2.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
dto/base/decorators/composition-roles-min-in-game.decorator.ts:17:40
   return roles
     .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
     .every(role => {
-      const roleCount = players.filter(player => player.role.name === role.name).length;
+      const roleCount = players.filter(() => undefined).length;
       return roleCount === 0 || roleCount >= role.minInGame;
     });
killedBy: Game Controller POST /games should not allow game creation when there is only one brother in the same game [#6].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
dto/base/decorators/composition-roles-min-in-game.decorator.ts:18:14
     .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
     .every(role => {
       const roleCount = players.filter(player => player.role.name === role.name).length;
-      return roleCount === 0 || roleCount >= role.minInGame;
+      return true;
     });
 }
killedBy: Game Controller POST /games should not allow game creation when there is only one brother in the same game [#6].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] EqualityOperator
dto/base/decorators/composition-roles-min-in-game.decorator.ts:18:33
     .filter((role): role is Role & { minInGame: number } => role.minInGame !== undefined)
     .every(role => {
       const roleCount = players.filter(player => player.role.name === role.name).length;
-      return roleCount === 0 || roleCount >= role.minInGame;
+      return roleCount === 0 || roleCount > role.minInGame;
     });
 }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getGameRandomComposition should return random composition when called [#1].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
