[Killed] BooleanLiteral
dto/base/decorators/composition-unique-names.decorator.ts:7:27
 import { has } from "lodash";
 
 function getPlayerName(value?: unknown): unknown {
-  if (!isObject(value) || !has(value, "name")) {
+  if (!isObject(value) || has(value, "name")) {
     return value;
   }
killedBy: Composition Unique Names Decorator getPlayerName should return same value when value doesn't have name field.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"toto": "tata"}
Received: undefined

[Killed] BlockStatement
dto/base/decorators/composition-unique-names.decorator.ts:7:48
 import { has } from "lodash";
 
 function getPlayerName(value?: unknown): unknown {
-  if (!isObject(value) || !has(value, "name")) {
-    return value;
-  }
+  if (!isObject(value) || !has(value, "name")) {}
   return (value as { name: unknown }).name;
 }
killedBy: Composition Unique Names Decorator getPlayerName should return same value when value is null.
statusReason: TypeError: Cannot read properties of null (reading 'name')
