[Killed] BooleanLiteral
base/game-player/transformers/player-role.transformer.ts:7:7
 import { ROLE_NAMES } from "../../../../../role/enums/role.enum";
 
 function playerRoleTransformer(params: TransformFnParams): unknown {
-  if (!has(params.value as object, "name")) {
+  if (has((params.value as object), "name")) {
     return params.value;
   }
killedBy: Game Controller GET /games/random-composition should get random composition when called.
statusReason: Error: expect(received).toSatisfyAll(expected)

Expected array to satisfy predicate for all values:
  [Function anonymous]
Received:

[Timeout] ConditionalExpression
base/game-player/transformers/player-role.transformer.ts:7:7
 import { ROLE_NAMES } from "../../../../../role/enums/role.enum";
 
 function playerRoleTransformer(params: TransformFnParams): unknown {
-  if (!has(params.value as object, "name")) {
+  if (false) {
     return params.value;
   }

[Timeout] ArrowFunction
base/game-player/transformers/player-role.transformer.ts:16:27
     original: ROLE_NAMES;
     isRevealed: boolean;
   };
-  const role = roles.find(({ name }) => name === value.name);
+  const role = roles.find(() => undefined);
   if (role === undefined) {
     return value;

[Timeout] ConditionalExpression
base/game-player/transformers/player-role.transformer.ts:16:41
     original: ROLE_NAMES;
     isRevealed: boolean;
   };
-  const role = roles.find(({ name }) => name === value.name);
+  const role = roles.find(({ name }) => false);
   if (role === undefined) {
     return value;

[Timeout] EqualityOperator
base/game-player/transformers/player-role.transformer.ts:22:22
   }
   value.current = role.name;
   value.original = role.name;
-  value.isRevealed = role.name === ROLE_NAMES.VILLAGER_VILLAGER;
+  value.isRevealed = role.name !== ROLE_NAMES.VILLAGER_VILLAGER;
   return value;
 }

[Timeout] ConditionalExpression
base/game-player/transformers/player-role.transformer.ts:22:22
   }
   value.current = role.name;
   value.original = role.name;
-  value.isRevealed = role.name === ROLE_NAMES.VILLAGER_VILLAGER;
+  value.isRevealed = false;
   return value;
 }
