[Killed] LogicalOperator
base/game-player/transformers/player-side.transformer.ts:8:7
 import type { ROLE_SIDES, ROLE_NAMES } from "../../../../../role/enums/role.enum";
 
 function playerSideTransformer(params: TransformFnParams): unknown {
-  if (!isObject(params.value) || !isObject(params.obj) || !has(params.obj as object, ["role", "name"])) {
+  if ((!isObject(params.value) || !isObject(params.obj)) && !has((params.obj as object), ["role", "name"])) {
     return params.value;
   }
killedBy: Player Side Transformer playerSideTransformer should return null when value is null.
statusReason: TypeError: Cannot set properties of null (setting 'current')

[Timeout] BooleanLiteral
base/game-player/transformers/player-side.transformer.ts:8:34
 import type { ROLE_SIDES, ROLE_NAMES } from "../../../../../role/enums/role.enum";
 
 function playerSideTransformer(params: TransformFnParams): unknown {
-  if (!isObject(params.value) || !isObject(params.obj) || !has(params.obj as object, ["role", "name"])) {
+  if (!isObject(params.value) || isObject(params.obj) || !has(params.obj as object, ["role", "name"])) {
     return params.value;
   }

[Killed] EqualityOperator
base/game-player/transformers/player-side.transformer.ts:16:41
     current: ROLE_SIDES;
     original: ROLE_SIDES;
   };
-  const role = roles.find(({ name }) => name === obj.role.name);
+  const role = roles.find(({ name }) => name !== obj.role.name);
   if (role === undefined) {
     return value;
killedBy: Player Side Transformer playerSideTransformer should return same value when role is unknown.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 4

- Object {}
+ Object {
+   "current": "werewolves",

[Timeout] ConditionalExpression
base/game-player/transformers/player-side.transformer.ts:16:41
     current: ROLE_SIDES;
     original: ROLE_SIDES;
   };
-  const role = roles.find(({ name }) => name === obj.role.name);
+  const role = roles.find(({ name }) => false);
   if (role === undefined) {
     return value;
