[Killed] BooleanLiteral
dto/base/transformers/game-players-position.transformer.ts:5:7
 import { has } from "lodash";
 
 function gamePlayersPositionTransformer(params: TransformFnParams): unknown {
-  if (!Array.isArray(params.value)) {
+  if (Array.isArray(params.value)) {
     return params.value;
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
dto/base/transformers/game-players-position.transformer.ts:5:7
 import { has } from "lodash";
 
 function gamePlayersPositionTransformer(params: TransformFnParams): unknown {
-  if (!Array.isArray(params.value)) {
+  if (false) {
     return params.value;
   }
killedBy: Game Players Position Transformer gamePlayersPositionTransformer should return same value when value is not an array.
statusReason: TypeError: Cannot read properties of null (reading 'some')

[Killed] ConditionalExpression
dto/base/transformers/game-players-position.transformer.ts:9:28
     return params.value;
   }
   const value = params.value as unknown[];
-  if (value.some(player => typeof player !== "object" ||
-    has(player, "position") && (player as { position: number | undefined }).position !== undefined)) {
+  if (value.some(player => true)) {
     return value;
   }
killedBy: Game Players Position Transformer gamePlayersPositionTransformer should return players with sequential position when no positions are set.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
dto/base/transformers/game-players-position.transformer.ts:9:7
     return params.value;
   }
   const value = params.value as unknown[];
-  if (value.some(player => typeof player !== "object" ||
-    has(player, "position") && (player as { position: number | undefined }).position !== undefined)) {
+  if (true) {
     return value;
   }
killedBy: Game Players Position Transformer gamePlayersPositionTransformer should return players with sequential position when no positions are set.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
dto/base/transformers/game-players-position.transformer.ts:10:32
   }
   const value = params.value as unknown[];
   if (value.some(player => typeof player !== "object" ||
-    has(player, "position") && (player as { position: number | undefined }).position !== undefined)) {
+    has(player, "position") && true)) {
     return value;
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] LogicalOperator
dto/base/transformers/game-players-position.transformer.ts:10:5
   }
   const value = params.value as unknown[];
   if (value.some(player => typeof player !== "object" ||
-    has(player, "position") && (player as { position: number | undefined }).position !== undefined)) {
+    has(player, "position") || (player as {
+  position: number | undefined;
+}).position !== undefined)) {
     return value;
   }
killedBy: Game Players Position Transformer gamePlayersPositionTransformer should return players with sequential position when no positions are set.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
dto/base/transformers/game-players-position.transformer.ts:14:42
     return value;
   }
   const players = value as { position: number | undefined }[];
-  for (let i = 0; i < value.length; i++) {
-    players[i].position = i;
-  }
+  for (let i = 0; i < value.length; i++) {}
   return value;
 }
killedBy: Game Players Position Transformer gamePlayersPositionTransformer should return players with sequential position when no positions are set.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
dto/base/transformers/game-players-position.transformer.ts:14:19
     return value;
   }
   const players = value as { position: number | undefined }[];
-  for (let i = 0; i < value.length; i++) {
+  for (let i = 0; i >= value.length; i++) {
     players[i].position = i;
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500
