[Killed] ConditionalExpression
game/helpers/game-history-record/game-history-record.helper.ts:8:52
 import type { GameSource } from "../../types/game.type";
 
 function getLastGamePlayFromHistory(gameHistoryRecords: GameHistoryRecord[], source: GameSource, action: GAME_PLAY_ACTIONS): GameHistoryRecord | undefined {
-  return gameHistoryRecords.findLast(({ play }) => play.action === action && play.source.name === source);
+  return gameHistoryRecords.findLast(({ play }) => false);
 }
 
killedBy: Game History Record Helper getLastGamePlayFromHistory should return second item when found among history.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
game/helpers/game-history-record/game-history-record.helper.ts:8:78
 import type { GameSource } from "../../types/game.type";
 
 function getLastGamePlayFromHistory(gameHistoryRecords: GameHistoryRecord[], source: GameSource, action: GAME_PLAY_ACTIONS): GameHistoryRecord | undefined {
-  return gameHistoryRecords.findLast(({ play }) => play.action === action && play.source.name === source);
+  return gameHistoryRecords.findLast(({ play }) => play.action === action && true);
 }
 
killedBy: Game History Record Helper getLastGamePlayFromHistory should return undefined when the duo action / source is not found among history.
statusReason: Error: expect(received).toBeUndefined()

[Killed] EqualityOperator
game/helpers/game-history-record/game-history-record.helper.ts:12:52
 }
 
 function getLastGamePlayTieInVotesFromHistory(gameHistoryRecords: GameHistoryRecord[]): GameHistoryRecord | undefined {
-  return gameHistoryRecords.findLast(({ play }) => play.action === GAME_PLAY_ACTIONS.VOTE && play.votingResult === GAME_HISTORY_RECORD_VOTING_RESULTS.TIE);
+  return gameHistoryRecords.findLast(({ play }) => play.action !== GAME_PLAY_ACTIONS.VOTE && play.votingResult === GAME_HISTORY_RECORD_VOTING_RESULTS.TIE);
 }
 
killedBy: Game History Record Helper getLastGamePlayTieInVotesFromHistory should return undefined when tie in votes is not found.
statusReason: Error: expect(received).toBeUndefined()

[Killed] ConditionalExpression
game/helpers/game-history-record/game-history-record.helper.ts:12:52
 }
 
 function getLastGamePlayTieInVotesFromHistory(gameHistoryRecords: GameHistoryRecord[]): GameHistoryRecord | undefined {
-  return gameHistoryRecords.findLast(({ play }) => play.action === GAME_PLAY_ACTIONS.VOTE && play.votingResult === GAME_HISTORY_RECORD_VOTING_RESULTS.TIE);
+  return gameHistoryRecords.findLast(({ play }) => true);
 }
 
killedBy: Game History Record Helper getLastGamePlayTieInVotesFromHistory should return undefined when tie in votes is not found.
statusReason: Error: expect(received).toBeUndefined()
