[Killed] BlockStatement
modules/game/helpers/game-play.helper.ts:21:31
   return makeGamePlayDto.votes.reduce<MakeGamePlayVoteWithRelationsDto[]>((acc, vote) => {
     const source = getPlayerWithId(game.players, vote.sourceId);
     const target = getPlayerWithId(game.players, vote.targetId);
-    if (source === undefined) {
-      throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.sourceId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
-    }
+    if (source === undefined) {}
     if (target === undefined) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.targetId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
killedBy: Game Play Helper getVotesWithRelationsFromMakeGamePlayDto should throw error when votes contains one unknown source.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ResourceNotFoundException

Received function did not throw

[Killed] EqualityOperator
modules/game/helpers/game-play.helper.ts:21:9
   return makeGamePlayDto.votes.reduce<MakeGamePlayVoteWithRelationsDto[]>((acc, vote) => {
     const source = getPlayerWithId(game.players, vote.sourceId);
     const target = getPlayerWithId(game.players, vote.targetId);
-    if (source === undefined) {
+    if (source !== undefined) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.sourceId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
     }
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
modules/game/helpers/game-play.helper.ts:24:9
     if (source === undefined) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.sourceId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
     }
-    if (target === undefined) {
+    if (true) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.targetId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
     }
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] EqualityOperator
modules/game/helpers/game-play.helper.ts:24:9
     if (source === undefined) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.sourceId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_SOURCE);
     }
-    if (target === undefined) {
+    if (target !== undefined) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.targetId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
     }
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
modules/game/helpers/game-play.helper.ts:27:97
     if (target === undefined) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, vote.targetId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_VOTE_TARGET);
     }
-    const plainToInstanceOptions = { ...plainToInstanceDefaultOptions, excludeExtraneousValues: true };
+    const plainToInstanceOptions = { ...plainToInstanceDefaultOptions, excludeExtraneousValues: false };
     const voteWithRelations = plainToInstance(MakeGamePlayVoteWithRelationsDto, { ...vote, source, target }, plainToInstanceOptions);
     return [...acc, voteWithRelations];
killedBy: Game Play Helper getVotesWithRelationsFromMakeGamePlayDto should fill votes with game players when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -15,10 +15,11 @@
        "side": PlayerSide {
          "current": "villagers",

[Killed] ConditionalExpression
modules/game/helpers/game-play.helper.ts:39:9
   }
   return makeGamePlayDto.targets.reduce<MakeGamePlayTargetWithRelationsDto[]>((acc, target) => {
     const player = getPlayerWithId(game.players, target.playerId);
-    if (player === undefined) {
+    if (true) {
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, target.playerId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
     }
killedBy: Game Controller POST /game/:id/play should not allow game play when payload is not valid.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] BlockStatement
modules/game/helpers/game-play.helper.ts:39:31
   }
   return makeGamePlayDto.targets.reduce<MakeGamePlayTargetWithRelationsDto[]>((acc, target) => {
     const player = getPlayerWithId(game.players, target.playerId);
-    if (player === undefined) {
-      throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, target.playerId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
-    }
+    if (player === undefined) {}
     const plainToInstanceOptions = { ...plainToInstanceDefaultOptions, excludeExtraneousValues: true };
     const targetWithRelations = plainToInstance(MakeGamePlayTargetWithRelationsDto, { ...target, player }, plainToInstanceOptions);
killedBy: Game Play Helper getTargetsWithRelationsFromMakeGamePlayDto should throw error when targets contains one unknown player.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ResourceNotFoundException

Received function did not throw

[Timeout] ObjectLiteral
modules/game/helpers/game-play.helper.ts:43:85
       throw new ResourceNotFoundException(API_RESOURCES.PLAYERS, target.playerId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_PLAYER_TARGET);
     }
     const plainToInstanceOptions = { ...plainToInstanceDefaultOptions, excludeExtraneousValues: true };
-    const targetWithRelations = plainToInstance(MakeGamePlayTargetWithRelationsDto, { ...target, player }, plainToInstanceOptions);
+    const targetWithRelations = plainToInstance(MakeGamePlayTargetWithRelationsDto, {}, plainToInstanceOptions);
     return [...acc, targetWithRelations];
   }, []);

[Killed] BlockStatement
modules/game/helpers/game-play.helper.ts:53:33
     return;
   }
   const chosenCard = getAdditionalCardWithId(game.additionalCards, makeGamePlayDto.chosenCardId);
-  if (chosenCard === undefined) {
-    throw new ResourceNotFoundException(API_RESOURCES.GAME_ADDITIONAL_CARDS, makeGamePlayDto.chosenCardId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_CHOSEN_CARD);
-  }
+  if (chosenCard === undefined) {}
   return chosenCard;
 }
killedBy: Game Play Helper getChosenCardFromMakeGamePlayDto should throw error when chosen card is unknown from game cards.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ResourceNotFoundException

Received function did not throw

[Killed] ConditionalExpression
modules/game/helpers/game-play.helper.ts:53:7
     return;
   }
   const chosenCard = getAdditionalCardWithId(game.additionalCards, makeGamePlayDto.chosenCardId);
-  if (chosenCard === undefined) {
+  if (true) {
     throw new ResourceNotFoundException(API_RESOURCES.GAME_ADDITIONAL_CARDS, makeGamePlayDto.chosenCardId.toString(), RESOURCE_NOT_FOUND_REASONS.UNMATCHED_GAME_PLAY_CHOSEN_CARD);
   }
killedBy: Game Play Helper getChosenCardFromMakeGamePlayDto should return chosen card when called.
statusReason: Error: thrown: ResourceNotFoundException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] BooleanLiteral
modules/game/helpers/game-play.helper.ts:68:67
     chosenCard,
     targets,
     votes,
-  }, { ...plainToInstanceDefaultOptions, excludeExtraneousValues: true });
+  }, { ...plainToInstanceDefaultOptions, excludeExtraneousValues: false });
 }
 
killedBy: Game Play Helper createMakeGamePlayDtoWithRelations should return same dto with relations when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -3,10 +3,11 @@
      "_id": "bc4c9c43eafd06715a9037eb",
      "isUsed": true,

[Killed] ObjectLiteral
modules/game/helpers/game-play.helper.ts:68:6
     chosenCard,
     targets,
     votes,
-  }, { ...plainToInstanceDefaultOptions, excludeExtraneousValues: true });
+  }, {});
 }
 
killedBy: Game Play Helper createMakeGamePlayDtoWithRelations should return same dto with relations when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -3,14 +3,16 @@
      "_id": "086da8a48b785e7cdcccb3ae",
      "isUsed": false,
