[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:15:84
 
 function doWerewolvesWin(players: Player[]): boolean {
   const werewolvesSidedPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.WEREWOLVES);
-  return werewolvesSidedPlayers.length > 0 && !players.some(({ side, isAlive }) => side.current === ROLE_SIDES.VILLAGERS && isAlive);
+  return werewolvesSidedPlayers.length > 0 && !players.some(({ side, isAlive }) => true);
 }
 
killedBy: Game Victory Helper doWerewolvesWin should return true when all villagers are dead.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:15:84
 
 function doWerewolvesWin(players: Player[]): boolean {
   const werewolvesSidedPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.WEREWOLVES);
-  return werewolvesSidedPlayers.length > 0 && !players.some(({ side, isAlive }) => side.current === ROLE_SIDES.VILLAGERS && isAlive);
+  return werewolvesSidedPlayers.length > 0 && !players.some(({ side, isAlive }) => true && isAlive);
 }
 
killedBy: Game Service makeGamePlay should set game as over when the game is done.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"_id": "ea2de76ced9aa2a6aa13da48"},
- Object {
-   "status": "over",

[Killed] LogicalOperator
game/helpers/game-victory/game-victory.helper.ts:20:83
 
 function doVillagersWin(players: Player[]): boolean {
   const villagersSidedPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
-  return villagersSidedPlayers.length > 0 && !players.some(({ side, isAlive }) => side.current === ROLE_SIDES.WEREWOLVES && isAlive);
+  return villagersSidedPlayers.length > 0 && !players.some(({ side, isAlive }) => side.current === ROLE_SIDES.WEREWOLVES || isAlive);
 }
 
killedBy: Game Victory Helper doVillagersWin should return true when all werewolves are dead.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:20:10
 
 function doVillagersWin(players: Player[]): boolean {
   const villagersSidedPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
-  return villagersSidedPlayers.length > 0 && !players.some(({ side, isAlive }) => side.current === ROLE_SIDES.WEREWOLVES && isAlive);
+  return true;
 }
 
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
game/helpers/game-victory/game-victory.helper.ts:25:55
 
 function doLoversWin(players: Player[]): boolean {
   const lovers = getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-  return lovers.length > 0 && players.every(player => {
-    const isPlayerInLove = doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-    return isPlayerInLove && player.isAlive || !isPlayerInLove && !player.isAlive;
-  });
+  return lovers.length > 0 && players.every(player => {});
 }
 
killedBy: Game Victory Helper doLoversWin should return true when lovers are the last survivors.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:25:10
 
 function doLoversWin(players: Player[]): boolean {
   const lovers = getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-  return lovers.length > 0 && players.every(player => {
-    const isPlayerInLove = doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-    return isPlayerInLove && player.isAlive || !isPlayerInLove && !player.isAlive;
-  });
+  return true;
 }
 
killedBy: Game Victory Helper doLoversWin should return false when no players are provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
game/helpers/game-victory/game-victory.helper.ts:27:12
   const lovers = getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   return lovers.length > 0 && players.every(player => {
     const isPlayerInLove = doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-    return isPlayerInLove && player.isAlive || !isPlayerInLove && !player.isAlive;
+    return isPlayerInLove && player.isAlive && !isPlayerInLove && !player.isAlive;
   });
 }
killedBy: Game Victory Helper doLoversWin should return true when lovers are the last survivors.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
game/helpers/game-victory/game-victory.helper.ts:27:67
   const lovers = getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   return lovers.length > 0 && players.every(player => {
     const isPlayerInLove = doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-    return isPlayerInLove && player.isAlive || !isPlayerInLove && !player.isAlive;
+    return isPlayerInLove && player.isAlive || !isPlayerInLove && player.isAlive;
   });
 }
killedBy: Game Victory Helper doLoversWin should return true when lovers are the last survivors.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
game/helpers/game-victory/game-victory.helper.ts:33:11
 
 function doesWhiteWerewolfWin(players: Player[]): boolean {
   const whiteWerewolfPlayer = getPlayerWithCurrentRole(players, ROLE_NAMES.WHITE_WEREWOLF);
-  return !!whiteWerewolfPlayer && players.every(({ role, isAlive }) =>
+  return !whiteWerewolfPlayer && players.every(({ role, isAlive }) =>
     role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || role.current !== ROLE_NAMES.WHITE_WEREWOLF && !isAlive);
 }
killedBy: Game Victory Helper doesWhiteWerewolfWin should return false when no players are provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:33:10
 
 function doesWhiteWerewolfWin(players: Player[]): boolean {
   const whiteWerewolfPlayer = getPlayerWithCurrentRole(players, ROLE_NAMES.WHITE_WEREWOLF);
-  return !!whiteWerewolfPlayer && players.every(({ role, isAlive }) =>
-    role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || role.current !== ROLE_NAMES.WHITE_WEREWOLF && !isAlive);
+  return true;
 }
 
killedBy: Game Victory Helper doesWhiteWerewolfWin should return false when no players are provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:34:62
 function doesWhiteWerewolfWin(players: Player[]): boolean {
   const whiteWerewolfPlayer = getPlayerWithCurrentRole(players, ROLE_NAMES.WHITE_WEREWOLF);
   return !!whiteWerewolfPlayer && players.every(({ role, isAlive }) =>
-    role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || role.current !== ROLE_NAMES.WHITE_WEREWOLF && !isAlive);
+    role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || false);
 }
 
killedBy: Game Victory Helper doesWhiteWerewolfWin should return true when all players are dead except white werewolf.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
game/helpers/game-victory/game-victory.helper.ts:34:108
 function doesWhiteWerewolfWin(players: Player[]): boolean {
   const whiteWerewolfPlayer = getPlayerWithCurrentRole(players, ROLE_NAMES.WHITE_WEREWOLF);
   return !!whiteWerewolfPlayer && players.every(({ role, isAlive }) =>
-    role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || role.current !== ROLE_NAMES.WHITE_WEREWOLF && !isAlive);
+    role.current === ROLE_NAMES.WHITE_WEREWOLF && isAlive || role.current !== ROLE_NAMES.WHITE_WEREWOLF && isAlive);
 }
 
killedBy: Game Victory Helper doesWhiteWerewolfWin should return true when all players are dead except white werewolf.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:41:10
   const { isPowerlessIfInfected } = game.options.roles.piedPiper;
   const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
   const leftToCharmPlayers = getLeftToCharmByPiedPiperPlayers(game.players);
-  return !!piedPiperPlayer && isPlayerAliveAndPowerful(piedPiperPlayer) && !leftToCharmPlayers.length &&
-    (!isPowerlessIfInfected || piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
+  return true;
 }
 
killedBy: Game Victory Helper doesPiedPiperWin should return false when no players are provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:41:10
   const { isPowerlessIfInfected } = game.options.roles.piedPiper;
   const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
   const leftToCharmPlayers = getLeftToCharmByPiedPiperPlayers(game.players);
-  return !!piedPiperPlayer && isPlayerAliveAndPowerful(piedPiperPlayer) && !leftToCharmPlayers.length &&
-    (!isPowerlessIfInfected || piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
+  return false;
 }
 
killedBy: Game Victory Helper doesPiedPiperWin should return true when all are charmed but pied piper is not powerless because infected.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
game/helpers/game-victory/game-victory.helper.ts:42:6
   const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
   const leftToCharmPlayers = getLeftToCharmByPiedPiperPlayers(game.players);
   return !!piedPiperPlayer && isPlayerAliveAndPowerful(piedPiperPlayer) && !leftToCharmPlayers.length &&
-    (!isPowerlessIfInfected || piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
+    (!isPowerlessIfInfected && piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
 }
 
killedBy: Game Victory Helper doesPiedPiperWin should return true when all are charmed but pied piper is not powerless because infected.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
game/helpers/game-victory/game-victory.helper.ts:42:32
   const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
   const leftToCharmPlayers = getLeftToCharmByPiedPiperPlayers(game.players);
   return !!piedPiperPlayer && isPlayerAliveAndPowerful(piedPiperPlayer) && !leftToCharmPlayers.length &&
-    (!isPowerlessIfInfected || piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
+    (!isPowerlessIfInfected || piedPiperPlayer.side.current !== ROLE_SIDES.VILLAGERS);
 }
 
killedBy: Game Victory Helper doesPiedPiperWin should return false when all are charmed but pied piper is powerless because infected.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
game/helpers/game-victory/game-victory.helper.ts:47:127
 
 function doesAngelWin(game: Game): boolean {
   const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
-  if (!angelPlayer?.death || angelPlayer.isAlive || doesPlayerHaveAttribute(angelPlayer, PLAYER_ATTRIBUTE_NAMES.POWERLESS) || game.turn > 1) {
+  if (!angelPlayer?.death || angelPlayer.isAlive || doesPlayerHaveAttribute(angelPlayer, PLAYER_ATTRIBUTE_NAMES.POWERLESS) || game.turn >= 1) {
     return false;
   }
killedBy: Game Victory Helper doesAngelWin should return true when angel is dead from eaten cause.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
game/helpers/game-victory/game-victory.helper.ts:47:127
 
 function doesAngelWin(game: Game): boolean {
   const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
-  if (!angelPlayer?.death || angelPlayer.isAlive || doesPlayerHaveAttribute(angelPlayer, PLAYER_ATTRIBUTE_NAMES.POWERLESS) || game.turn > 1) {
+  if (!angelPlayer?.death || angelPlayer.isAlive || doesPlayerHaveAttribute(angelPlayer, PLAYER_ATTRIBUTE_NAMES.POWERLESS) || game.turn <= 1) {
     return false;
   }
killedBy: Game Victory Helper doesAngelWin should return false when it's not first turn of the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
game/helpers/game-victory/game-victory.helper.ts:48:12
 function doesAngelWin(game: Game): boolean {
   const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
   if (!angelPlayer?.death || angelPlayer.isAlive || doesPlayerHaveAttribute(angelPlayer, PLAYER_ATTRIBUTE_NAMES.POWERLESS) || game.turn > 1) {
-    return false;
+    return true;
   }
   return [PLAYER_DEATH_CAUSES.VOTE, PLAYER_DEATH_CAUSES.EATEN].includes(angelPlayer.death.cause);
killedBy: Game Victory Helper doesAngelWin should return false when no players provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
game/helpers/game-victory/game-victory.helper.ts:55:82
 
 function isGameOver(game: Game): boolean {
   const { players, upcomingPlays } = game;
-  const isShootPlayActionIncoming = !!upcomingPlays.find(({ action, source }) => action === GAME_PLAY_ACTIONS.SHOOT && source === ROLE_NAMES.HUNTER);
+  const isShootPlayActionIncoming = !!upcomingPlays.find(({ action, source }) => action !== GAME_PLAY_ACTIONS.SHOOT && source === ROLE_NAMES.HUNTER);
   return !isShootPlayActionIncoming && (areAllPlayersDead(players) || doWerewolvesWin(players) || doVillagersWin(players) ||
   doLoversWin(players) || doesWhiteWerewolfWin(players) || doesPiedPiperWin(game) || doesAngelWin(game));
killedBy: Game Victory Helper isGameOver should return false when there is a incoming shoot by hunter play.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:55:82
 
 function isGameOver(game: Game): boolean {
   const { players, upcomingPlays } = game;
-  const isShootPlayActionIncoming = !!upcomingPlays.find(({ action, source }) => action === GAME_PLAY_ACTIONS.SHOOT && source === ROLE_NAMES.HUNTER);
+  const isShootPlayActionIncoming = !!upcomingPlays.find(({ action, source }) => true);
   return !isShootPlayActionIncoming && (areAllPlayersDead(players) || doWerewolvesWin(players) || doVillagersWin(players) ||
   doLoversWin(players) || doesWhiteWerewolfWin(players) || doesPiedPiperWin(game) || doesAngelWin(game));
killedBy: Game Victory Helper isGameOver should return true when all players are dead.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:56:41
 function isGameOver(game: Game): boolean {
   const { players, upcomingPlays } = game;
   const isShootPlayActionIncoming = !!upcomingPlays.find(({ action, source }) => action === GAME_PLAY_ACTIONS.SHOOT && source === ROLE_NAMES.HUNTER);
-  return !isShootPlayActionIncoming && (areAllPlayersDead(players) || doWerewolvesWin(players) || doVillagersWin(players) ||
-  doLoversWin(players) || doesWhiteWerewolfWin(players) || doesPiedPiperWin(game) || doesAngelWin(game));
+  return !isShootPlayActionIncoming && (true);
 }
 
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -137,11 +137,11 @@
          "current": "werewolves",
          "original": "werewolves",

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:56:10
 function isGameOver(game: Game): boolean {
   const { players, upcomingPlays } = game;
   const isShootPlayActionIncoming = !!upcomingPlays.find(({ action, source }) => action === GAME_PLAY_ACTIONS.SHOOT && source === ROLE_NAMES.HUNTER);
-  return !isShootPlayActionIncoming && (areAllPlayersDead(players) || doWerewolvesWin(players) || doVillagersWin(players) ||
-  doLoversWin(players) || doesWhiteWerewolfWin(players) || doesPiedPiperWin(game) || doesAngelWin(game));
+  return false;
 }
 
killedBy: Game Victory Helper isGameOver should return true when all players are dead.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:61:7
 }
 
 function generateGameVictoryData(game: Game): GameVictory | undefined {
-  if (areAllPlayersDead(game.players)) {
+  if (false) {
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.NONE }, plainToInstanceDefaultOptions);
   }
killedBy: Game Victory Helper generateGameVictoryData should return no winners when all players are dead.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  2
+ Received  + 20

  GameVictory {
-   "type": "none",
-   "winners": undefined,

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:61:7
 }
 
 function generateGameVictoryData(game: Game): GameVictory | undefined {
-  if (areAllPlayersDead(game.players)) {
+  if (true) {
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.NONE }, plainToInstanceDefaultOptions);
   }
killedBy: Game Victory Helper generateGameVictoryData should return angel victory when angel wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 23
+ Received  +  2

  GameVictory {
-   "type": "angel",
-   "winners": Array [

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:64:7
   if (areAllPlayersDead(game.players)) {
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.NONE }, plainToInstanceDefaultOptions);
   }
-  if (doesAngelWin(game)) {
+  if (true) {
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.ANGEL, winners: [angelPlayer] }, plainToInstanceDefaultOptions);
killedBy: Game Victory Helper generateGameVictoryData should return lovers victory when lovers win.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 49
+ Received  +  2

  GameVictory {
-   "type": "lovers",
+   "type": "angel",

[Killed] BlockStatement
game/helpers/game-victory/game-victory.helper.ts:64:27
   if (areAllPlayersDead(game.players)) {
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.NONE }, plainToInstanceDefaultOptions);
   }
-  if (doesAngelWin(game)) {
-    const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.ANGEL, winners: [angelPlayer] }, plainToInstanceDefaultOptions);
-  }
+  if (doesAngelWin(game)) {}
   if (doLoversWin(game.players)) {
     const inLovePlayers = getPlayersWithAttribute(game.players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
killedBy: Game Victory Helper generateGameVictoryData should return angel victory when angel wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Received: undefined

[Killed] ObjectLiteral
game/helpers/game-victory/game-victory.helper.ts:66:41
   }
   if (doesAngelWin(game)) {
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.ANGEL, winners: [angelPlayer] }, plainToInstanceDefaultOptions);
+    return plainToInstance(GameVictory, {}, plainToInstanceDefaultOptions);
   }
   if (doLoversWin(game.players)) {
killedBy: Game Victory Helper generateGameVictoryData should return angel victory when angel wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 23
+ Received  +  2

  GameVictory {
-   "type": "angel",
-   "winners": Array [

[Timeout] ArrayDeclaration
game/helpers/game-victory/game-victory.helper.ts:66:84
   }
   if (doesAngelWin(game)) {
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.ANGEL, winners: [angelPlayer] }, plainToInstanceDefaultOptions);
+    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.ANGEL, winners: [] }, plainToInstanceDefaultOptions);
   }
   if (doLoversWin(game.players)) {

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:68:7
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.ANGEL, winners: [angelPlayer] }, plainToInstanceDefaultOptions);
   }
-  if (doLoversWin(game.players)) {
+  if (true) {
     const inLovePlayers = getPlayersWithAttribute(game.players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.LOVERS, winners: inLovePlayers }, plainToInstanceDefaultOptions);
killedBy: Game Victory Helper generateGameVictoryData should return pied piper victory when pied piper wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 20
+ Received  +  2

  GameVictory {
-   "type": "pied-piper",
-   "winners": Array [

[Killed] BlockStatement
game/helpers/game-victory/game-victory.helper.ts:68:34
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.ANGEL, winners: [angelPlayer] }, plainToInstanceDefaultOptions);
   }
-  if (doLoversWin(game.players)) {
-    const inLovePlayers = getPlayersWithAttribute(game.players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.LOVERS, winners: inLovePlayers }, plainToInstanceDefaultOptions);
-  }
+  if (doLoversWin(game.players)) {}
   if (doesPiedPiperWin(game)) {
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
killedBy: Game Victory Helper generateGameVictoryData should return lovers victory when lovers win.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  GameVictory {
-   "type": "lovers",

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:72:7
     const inLovePlayers = getPlayersWithAttribute(game.players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.LOVERS, winners: inLovePlayers }, plainToInstanceDefaultOptions);
   }
-  if (doesPiedPiperWin(game)) {
+  if (false) {
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.PIED_PIPER, winners: [piedPiperPlayer] }, plainToInstanceDefaultOptions);
killedBy: Game Victory Helper generateGameVictoryData should return pied piper victory when pied piper wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
game/helpers/game-victory/game-victory.helper.ts:72:31
     const inLovePlayers = getPlayersWithAttribute(game.players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.LOVERS, winners: inLovePlayers }, plainToInstanceDefaultOptions);
   }
-  if (doesPiedPiperWin(game)) {
-    const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.PIED_PIPER, winners: [piedPiperPlayer] }, plainToInstanceDefaultOptions);
-  }
+  if (doesPiedPiperWin(game)) {}
   if (doesWhiteWerewolfWin(game.players)) {
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
killedBy: Game Victory Helper generateGameVictoryData should return pied piper victory when pied piper wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Received: undefined

[Timeout] ObjectLiteral
game/helpers/game-victory/game-victory.helper.ts:74:41
   }
   if (doesPiedPiperWin(game)) {
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.PIED_PIPER, winners: [piedPiperPlayer] }, plainToInstanceDefaultOptions);
+    return plainToInstance(GameVictory, {}, plainToInstanceDefaultOptions);
   }
   if (doesWhiteWerewolfWin(game.players)) {

[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:76:7
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.PIED_PIPER, winners: [piedPiperPlayer] }, plainToInstanceDefaultOptions);
   }
-  if (doesWhiteWerewolfWin(game.players)) {
+  if (false) {
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WHITE_WEREWOLF, winners: [whiteWerewolfPlayer] }, plainToInstanceDefaultOptions);
killedBy: Game Victory Helper generateGameVictoryData should return white werewolf victory when white werewolf wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 18

@@ -1,8 +1,25 @@
  GameVictory {
-   "type": "white-werewolf",

[Killed] BlockStatement
game/helpers/game-victory/game-victory.helper.ts:76:43
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.PIED_PIPER, winners: [piedPiperPlayer] }, plainToInstanceDefaultOptions);
   }
-  if (doesWhiteWerewolfWin(game.players)) {
-    const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WHITE_WEREWOLF, winners: [whiteWerewolfPlayer] }, plainToInstanceDefaultOptions);
-  }
+  if (doesWhiteWerewolfWin(game.players)) {}
   if (doWerewolvesWin(game.players)) {
     const werewolvesSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.WEREWOLVES);
killedBy: Game Victory Helper generateGameVictoryData should return white werewolf victory when white werewolf wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  1
+ Received  + 18

@@ -1,8 +1,25 @@
  GameVictory {
-   "type": "white-werewolf",

[Killed] ObjectLiteral
game/helpers/game-victory/game-victory.helper.ts:78:41
   }
   if (doesWhiteWerewolfWin(game.players)) {
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WHITE_WEREWOLF, winners: [whiteWerewolfPlayer] }, plainToInstanceDefaultOptions);
+    return plainToInstance(GameVictory, {}, plainToInstanceDefaultOptions);
   }
   if (doWerewolvesWin(game.players)) {
killedBy: Game Victory Helper generateGameVictoryData should return white werewolf victory when white werewolf wins.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 20
+ Received  +  2

  GameVictory {
-   "type": "white-werewolf",
-   "winners": Array [

[Killed] BlockStatement
game/helpers/game-victory/game-victory.helper.ts:80:38
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WHITE_WEREWOLF, winners: [whiteWerewolfPlayer] }, plainToInstanceDefaultOptions);
   }
-  if (doWerewolvesWin(game.players)) {
-    const werewolvesSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.WEREWOLVES);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WEREWOLVES, winners: werewolvesSidePlayers }, plainToInstanceDefaultOptions);
-  }
+  if (doWerewolvesWin(game.players)) {}
   if (doVillagersWin(game.players)) {
     const villagersSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.VILLAGERS);
killedBy: Game Victory Helper generateGameVictoryData should return werewolves victory when werewolves win.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Received: undefined

[Timeout] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:80:7
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WHITE_WEREWOLF, winners: [whiteWerewolfPlayer] }, plainToInstanceDefaultOptions);
   }
-  if (doWerewolvesWin(game.players)) {
+  if (false) {
     const werewolvesSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.WEREWOLVES);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WEREWOLVES, winners: werewolvesSidePlayers }, plainToInstanceDefaultOptions);
