[Killed] ConditionalExpression
game/helpers/game-victory/game-victory.helper.ts:84:7
     const werewolvesSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.WEREWOLVES);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WEREWOLVES, winners: werewolvesSidePlayers }, plainToInstanceDefaultOptions);
   }
-  if (doVillagersWin(game.players)) {
+  if (true) {
     const villagersSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.VILLAGERS);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.VILLAGERS, winners: villagersSidePlayers }, plainToInstanceDefaultOptions);
killedBy: Game Victory Helper generateGameVictoryData should return undefined when no victory can't be generated.
statusReason: Error: expect(received).toBeUndefined()

[Killed] BlockStatement
game/helpers/game-victory/game-victory.helper.ts:84:37
     const werewolvesSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.WEREWOLVES);
     return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.WEREWOLVES, winners: werewolvesSidePlayers }, plainToInstanceDefaultOptions);
   }
-  if (doVillagersWin(game.players)) {
-    const villagersSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.VILLAGERS);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.VILLAGERS, winners: villagersSidePlayers }, plainToInstanceDefaultOptions);
-  }
+  if (doVillagersWin(game.players)) {}
 }
 
killedBy: Game Victory Helper generateGameVictoryData should return villagers victory when villagers win.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Received: undefined

[Timeout] ObjectLiteral
game/helpers/game-victory/game-victory.helper.ts:86:41
   }
   if (doVillagersWin(game.players)) {
     const villagersSidePlayers = getPlayersWithCurrentSide(game.players, ROLE_SIDES.VILLAGERS);
-    return plainToInstance(GameVictory, { type: GAME_VICTORY_TYPES.VILLAGERS, winners: villagersSidePlayers }, plainToInstanceDefaultOptions);
+    return plainToInstance(GameVictory, {}, plainToInstanceDefaultOptions);
   }
 }
