[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:18:33
 import { doesPlayerHaveAttribute } from "./player/player.helper";
 
 function getPlayerDtoWithRole(players: CreateGamePlayerDto[], role: ROLE_NAMES): CreateGamePlayerDto | undefined {
-  return players.find(player => player.role.name === role);
+  return players.find(player => player.role.name !== role);
 }
 
killedBy: Game Plays Manager Service areLoversPlayableForNight should return false when there is no cupid in the game dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] ArrowFunction
modules/game/helpers/game.helper.ts:18:23
 import { doesPlayerHaveAttribute } from "./player/player.helper";
 
 function getPlayerDtoWithRole(players: CreateGamePlayerDto[], role: ROLE_NAMES): CreateGamePlayerDto | undefined {
-  return players.find(player => player.role.name === role);
+  return players.find(() => undefined);
 }
 

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:22:33
 }
 
 function getPlayerWithCurrentRole(players: Player[], role: ROLE_NAMES): Player | undefined {
-  return players.find(player => player.role.current === role);
+  return players.find(player => false);
 }
 
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should do nothing when infected target data is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ArrowFunction
modules/game/helpers/game.helper.ts:22:23
 }
 
 function getPlayerWithCurrentRole(players: Player[], role: ROLE_NAMES): Player | undefined {
-  return players.find(player => player.role.current === role);
+  return players.find(() => undefined);
 }
 
killedBy: Game Victory Helper doesWhiteWerewolfWin should return true when all players are dead except white werewolf.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:26:35
 }
 
 function getPlayersWithCurrentRole(players: Player[], role: ROLE_NAMES): Player[] {
-  return players.filter(player => player.role.current === role);
+  return players.filter(player => player.role.current !== role);
 }
 
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when three brothers are not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
modules/game/helpers/game.helper.ts:26:25
 }
 
 function getPlayersWithCurrentRole(players: Player[], role: ROLE_NAMES): Player[] {
-  return players.filter(player => player.role.current === role);
+  return players.filter(() => undefined);
 }
 
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return true when three brothers are alive.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
modules/game/helpers/game.helper.ts:30:10
 }
 
 function getPlayersWithCurrentSide(players: Player[], side: ROLE_SIDES): Player[] {
-  return players.filter(player => player.side.current === side);
+  return players;
 }
 
killedBy: Game Plays Manager Service isGroupPlayableForNight should return false when group is werewolves and all are powerless.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
modules/game/helpers/game.helper.ts:30:25
 }
 
 function getPlayersWithCurrentSide(players: Player[], side: ROLE_SIDES): Player[] {
-  return players.filter(player => player.side.current === side);
+  return players.filter(() => undefined);
 }
 
killedBy: Game Helper getPlayersWithCurrentSide should return werewolves when they have this side.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 70
+ Received  +  1

- Array [
-   Player {
-     "_id": "cac1bba1e29ad0d52bcaffb9",

[Killed] ArrowFunction
modules/game/helpers/game.helper.ts:34:23
 }
 
 function getPlayerWithId(players: Player[], id: Types.ObjectId): Player | undefined {
-  return players.find(({ _id }) => _id.toString() === id.toString());
+  return players.find(() => undefined);
 }
 
killedBy: Game Controller POST /game/:id/play should not allow game play when payload is not valid.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:34:36
 }
 
 function getPlayerWithId(players: Player[], id: Types.ObjectId): Player | undefined {
-  return players.find(({ _id }) => _id.toString() === id.toString());
+  return players.find(({ _id }) => _id.toString() !== id.toString());
 }
 
killedBy: Game Helper getPlayerWithId should get player with specific id when called with this id.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -1,16 +1,16 @@
  Player {
-   "_id": "bb921d48ad0929d62a195e99",

[Killed] ArrowFunction
modules/game/helpers/game.helper.ts:38:22
 }
 
 function getAdditionalCardWithId(cards: GameAdditionalCard[] | undefined, id: Types.ObjectId): GameAdditionalCard | undefined {
-  return cards?.find(({ _id }) => _id.toString() === id.toString());
+  return cards?.find(() => undefined);
 }
 
killedBy: Game Helper getAdditionalCardWithId should get card with specific id when called with this id.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"_id": "d15acef658fdd89523fee51a", "isUsed": true, "recipient": "thief", "roleName": "thief"}
Received: undefined

[Timeout] ConditionalExpression
modules/game/helpers/game.helper.ts:38:35
 }
 
 function getAdditionalCardWithId(cards: GameAdditionalCard[] | undefined, id: Types.ObjectId): GameAdditionalCard | undefined {
-  return cards?.find(({ _id }) => _id.toString() === id.toString());
+  return cards?.find(({ _id }) => false);
 }
 

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:43:10
 
 function areAllWerewolvesAlive(players: Player[]): boolean {
   const werewolfPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.WEREWOLVES);
-  return werewolfPlayers.length > 0 && werewolfPlayers.every(werewolf => werewolf.isAlive);
+  return false;
 }
 
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the first night with official rules and all roles who act during the night [#1].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 0

@@ -78,15 +78,10 @@
      "action": "eat",
      "cause": undefined,

[Killed] LogicalOperator
modules/game/helpers/game.helper.ts:43:10
 
 function areAllWerewolvesAlive(players: Player[]): boolean {
   const werewolfPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.WEREWOLVES);
-  return werewolfPlayers.length > 0 && werewolfPlayers.every(werewolf => werewolf.isAlive);
+  return werewolfPlayers.length > 0 || werewolfPlayers.every(werewolf => werewolf.isAlive);
 }
 
killedBy: Game Helper areAllWerewolvesAlive should return false when empty array is provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:48:10
 
 function areAllVillagersAlive(players: Player[]): boolean {
   const villagerPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
-  return villagerPlayers.length > 0 && villagerPlayers.every(villager => villager.isAlive);
+  return true;
 }
 
killedBy: Game Helper areAllVillagersAlive should return false when empty array is provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
modules/game/helpers/game.helper.ts:48:10
 
 function areAllVillagersAlive(players: Player[]): boolean {
   const villagerPlayers = getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
-  return villagerPlayers.length > 0 && villagerPlayers.every(villager => villager.isAlive);
+  return villagerPlayers.length > 0 || villagerPlayers.every(villager => villager.isAlive);
 }
 
killedBy: Game Helper areAllVillagersAlive should return false when empty array is provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:52:10
 }
 
 function areAllPlayersDead(players: Player[]): boolean {
-  return players.length > 0 && players.every(({ isAlive }) => !isAlive);
+  return true && players.every(({ isAlive }) => !isAlive);
 }
 
killedBy: Game Helper areAllPlayersDead should return false when empty array is provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:52:10
 }
 
 function areAllPlayersDead(players: Player[]): boolean {
-  return players.length > 0 && players.every(({ isAlive }) => !isAlive);
+  return players.length >= 0 && players.every(({ isAlive }) => !isAlive);
 }
 
killedBy: Game Helper areAllPlayersDead should return false when empty array is provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
modules/game/helpers/game.helper.ts:56:10
 }
 
 function getPlayersWithAttribute(players: Player[], attribute: PLAYER_ATTRIBUTE_NAMES): Player[] {
-  return players.filter(player => doesPlayerHaveAttribute(player, attribute));
+  return players;
 }
 
killedBy: Game Victory Helper generateGameVictoryData should return lovers victory when lovers win.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  0
+ Received  + 34

@@ -1,9 +1,43 @@
  GameVictory {
    "type": "lovers",

[Killed] ArrowFunction
modules/game/helpers/game.helper.ts:56:25
 }
 
 function getPlayersWithAttribute(players: Player[], attribute: PLAYER_ATTRIBUTE_NAMES): Player[] {
-  return players.filter(player => doesPlayerHaveAttribute(player, attribute));
+  return players.filter(() => undefined);
 }
 
killedBy: Game Victory Helper doLoversWin should return true when lovers are the last survivors.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] ArrowFunction
modules/game/helpers/game.helper.ts:60:25
 }
 
 function getAlivePlayers(players: Player[]): Player[] {
-  return players.filter(player => player.isAlive);
+  return players.filter(() => undefined);
 }
 

[Timeout] MethodExpression
modules/game/helpers/game.helper.ts:60:10
 }
 
 function getAlivePlayers(players: Player[]): Player[] {
-  return players.filter(player => player.isAlive);
+  return players;
 }
 

[Killed] BooleanLiteral
modules/game/helpers/game.helper.ts:64:53
 }
 
 function getLeftToCharmByPiedPiperPlayers(players: Player[]): Player[] {
-  return players.filter(player => player.isAlive && !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.CHARMED) && player.role.current !== ROLE_NAMES.PIED_PIPER);
+  return players.filter(player => player.isAlive && doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.CHARMED) && player.role.current !== ROLE_NAMES.PIED_PIPER);
 }
 
killedBy: Game Helper getLeftToCharmByPiedPiperPlayers should get left to charm by pied piper players when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 20
+ Received  + 10

@@ -1,30 +1,20 @@
  Array [
    Player {

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:64:35
 }
 
 function getLeftToCharmByPiedPiperPlayers(players: Player[]): Player[] {
-  return players.filter(player => player.isAlive && !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.CHARMED) && player.role.current !== ROLE_NAMES.PIED_PIPER);
+  return players.filter(player => true && player.role.current !== ROLE_NAMES.PIED_PIPER);
 }
 
killedBy: Game Helper getLeftToCharmByPiedPiperPlayers should get left to charm by pied piper players when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  0
+ Received  + 48

@@ -1,13 +1,61 @@
  Array [
    Player {

[Timeout] BlockStatement
modules/game/helpers/game.helper.ts:68:36
 }
 
 function getGroupOfPlayers(players: Player[], group: PLAYER_GROUPS): Player[] {
-  if (group === PLAYER_GROUPS.ALL) {
-    return players;
-  } else if (group === PLAYER_GROUPS.LOVERS) {
+  if (group === PLAYER_GROUPS.ALL) {} else if (group === PLAYER_GROUPS.LOVERS) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   } else if (group === PLAYER_GROUPS.CHARMED) {

[Timeout] ConditionalExpression
modules/game/helpers/game.helper.ts:68:7
 }
 
 function getGroupOfPlayers(players: Player[], group: PLAYER_GROUPS): Player[] {
-  if (group === PLAYER_GROUPS.ALL) {
+  if (false) {
     return players;
   } else if (group === PLAYER_GROUPS.LOVERS) {

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:70:14
 function getGroupOfPlayers(players: Player[], group: PLAYER_GROUPS): Player[] {
   if (group === PLAYER_GROUPS.ALL) {
     return players;
-  } else if (group === PLAYER_GROUPS.LOVERS) {
+  } else if (false) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   } else if (group === PLAYER_GROUPS.CHARMED) {
killedBy: Game Helper getGroupOfPlayers should return players in love when group is lovers.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  9
+ Received  + 26

@@ -1,28 +1,45 @@
  Array [
    Player {

[Timeout] ConditionalExpression
modules/game/helpers/game.helper.ts:70:14
 function getGroupOfPlayers(players: Player[], group: PLAYER_GROUPS): Player[] {
   if (group === PLAYER_GROUPS.ALL) {
     return players;
-  } else if (group === PLAYER_GROUPS.LOVERS) {
+  } else if (true) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   } else if (group === PLAYER_GROUPS.CHARMED) {

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:72:14
     return players;
   } else if (group === PLAYER_GROUPS.LOVERS) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-  } else if (group === PLAYER_GROUPS.CHARMED) {
+  } else if (false) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.CHARMED);
   } else if (group === PLAYER_GROUPS.VILLAGERS) {
killedBy: Game Helper getGroupOfPlayers should return charmed players when group is charmed.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  + 31

@@ -1,48 +1,65 @@
  Array [
    Player {

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:72:14
     return players;
   } else if (group === PLAYER_GROUPS.LOVERS) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
-  } else if (group === PLAYER_GROUPS.CHARMED) {
+  } else if (true) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.CHARMED);
   } else if (group === PLAYER_GROUPS.VILLAGERS) {
killedBy: Game Helper getGroupOfPlayers should return villagers when group is villagers.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 33
+ Received  +  9

@@ -22,53 +22,29 @@
        "current": "villagers",
        "original": "villagers",

[Killed] ConditionalExpression
modules/game/helpers/game.helper.ts:74:14
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   } else if (group === PLAYER_GROUPS.CHARMED) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.CHARMED);
-  } else if (group === PLAYER_GROUPS.VILLAGERS) {
+  } else if (true) {
     return getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
   }
killedBy: Game Helper getGroupOfPlayers should return werewolves when group is werewolves.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 26
+ Received  + 33

  Array [
    Player {
-     "_id": "f0a4fc18a3de4be8efaf7d5d",

[Killed] EqualityOperator
modules/game/helpers/game.helper.ts:74:14
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.IN_LOVE);
   } else if (group === PLAYER_GROUPS.CHARMED) {
     return getPlayersWithAttribute(players, PLAYER_ATTRIBUTE_NAMES.CHARMED);
-  } else if (group === PLAYER_GROUPS.VILLAGERS) {
+  } else if (group !== PLAYER_GROUPS.VILLAGERS) {
     return getPlayersWithCurrentSide(players, ROLE_SIDES.VILLAGERS);
   }
killedBy: Game Helper getGroupOfPlayers should return villagers when group is villagers.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 33
+ Received  + 26

  Array [
    Player {
-     "_id": "ab8ad98c0b6ac1edf1dc1d09",

[Timeout] ArrowFunction
modules/game/helpers/game.helper.ts:89:29
 }
 
 function getNonexistentPlayerId(players: Player[], candidateIds?: Types.ObjectId[]): Types.ObjectId | undefined {
-  return candidateIds?.find(candidateId => !getPlayerWithId(players, candidateId));
+  return candidateIds?.find(() => undefined);
 }
 

[Timeout] BooleanLiteral
modules/game/helpers/game.helper.ts:89:44
 }
 
 function getNonexistentPlayerId(players: Player[], candidateIds?: Types.ObjectId[]): Types.ObjectId | undefined {
-  return candidateIds?.find(candidateId => !getPlayerWithId(players, candidateId));
+  return candidateIds?.find(candidateId => getPlayerWithId(players, candidateId));
 }
 

[Timeout] BooleanLiteral
modules/game/helpers/game.helper.ts:93:52
 }
 
 function getNonexistentPlayer(players: Player[], candidatePlayers?: Player[]): Player | undefined {
-  return candidatePlayers?.find(candidatePlayer => !getPlayerWithId(players, candidatePlayer._id));
+  return candidatePlayers?.find(candidatePlayer => getPlayerWithId(players, candidatePlayer._id));
 }
 

[Timeout] ArrowFunction
modules/game/helpers/game.helper.ts:93:33
 }
 
 function getNonexistentPlayer(players: Player[], candidatePlayers?: Player[]): Player | undefined {
-  return candidatePlayers?.find(candidatePlayer => !getPlayerWithId(players, candidatePlayer._id));
+  return candidatePlayers?.find(() => undefined);
 }
 
