[Killed] EqualityOperator
game/helpers/player/player.helper.ts:6:10
 import type { Player } from "../../schemas/player/player.schema";
 
 function doesPlayerHaveAttribute({ attributes }: Player, attributeName: PLAYER_ATTRIBUTE_NAMES): boolean {
-  return attributes.findIndex(({ name }) => name === attributeName) !== -1;
+  return attributes.findIndex(({
+  name
+}) => name === attributeName) === -1;
 }
 
killedBy: Player Helper doesPlayerHaveAttribute should return false when player doesn't have any attributes.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:6:10
 import type { Player } from "../../schemas/player/player.schema";
 
 function doesPlayerHaveAttribute({ attributes }: Player, attributeName: PLAYER_ATTRIBUTE_NAMES): boolean {
-  return attributes.findIndex(({ name }) => name === attributeName) !== -1;
+  return true;
 }
 
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when life potion target is not eaten by werewolves.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:10:10
 }
 
 function canPiedPiperCharm(piedPiperPlayer: Player, isPowerlessIfInfected: boolean): boolean {
-  return isPlayerAliveAndPowerful(piedPiperPlayer) && (!isPowerlessIfInfected || piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
+  return false;
 }
 
killedBy: Player Helper canPiedPiperCharm should return true when pied piper is infected but original rule is not respected.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:10:10
 }
 
 function canPiedPiperCharm(piedPiperPlayer: Player, isPowerlessIfInfected: boolean): boolean {
-  return isPlayerAliveAndPowerful(piedPiperPlayer) && (!isPowerlessIfInfected || piedPiperPlayer.side.current === ROLE_SIDES.VILLAGERS);
+  return true;
 }
 
killedBy: Player Helper canPiedPiperCharm should return false when pied piper is powerless.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:14:10
 }
 
 function isPlayerAliveAndPowerful(player: Player): boolean {
-  return player.isAlive && !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.POWERLESS);
+  return true;
 }
 
killedBy: Player Helper canPiedPiperCharm should return false when pied piper is powerless.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
game/helpers/player/player.helper.ts:14:10
 }
 
 function isPlayerAliveAndPowerful(player: Player): boolean {
-  return player.isAlive && !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.POWERLESS);
+  return player.isAlive || !doesPlayerHaveAttribute(player, PLAYER_ATTRIBUTE_NAMES.POWERLESS);
 }
 
killedBy: Player Helper canPiedPiperCharm should return false when pied piper is powerless.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
game/helpers/player/player.helper.ts:18:10
 }
 
 function isPlayerOnWerewolvesSide(player: Player): boolean {
-  return player.side.current === ROLE_SIDES.WEREWOLVES;
+  return player.side.current !== ROLE_SIDES.WEREWOLVES;
 }
 
killedBy: Player Helper isPlayerOnWerewolvesSide should return false when player is on villagers side.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:18:10
 }
 
 function isPlayerOnWerewolvesSide(player: Player): boolean {
-  return player.side.current === ROLE_SIDES.WEREWOLVES;
+  return false;
 }
 
killedBy: Player Helper isPlayerOnWerewolvesSide should return true when player is on werewolves side.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
game/helpers/player/player.helper.ts:22:10
 }
 
 function isPlayerOnVillagersSide(player: Player): boolean {
-  return player.side.current === ROLE_SIDES.VILLAGERS;
+  return player.side.current !== ROLE_SIDES.VILLAGERS;
 }
 
killedBy: Player Helper isPlayerOnVillagersSide should return true when player is on villagers side.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/helpers/player/player.helper.ts:22:10
 }
 
 function isPlayerOnVillagersSide(player: Player): boolean {
-  return player.side.current === ROLE_SIDES.VILLAGERS;
+  return true;
 }
 
killedBy: Player Helper isPlayerOnVillagersSide should return false when player is on werewolves side.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
