[Killed] BooleanLiteral
game/providers/repositories/game.repository.ts:25:65
   }
 
   public async updateOne(filter: FilterQuery<GameDocument>, game: Partial<Game>, options: QueryOptions = {}): Promise<Game | null> {
-    return this.gameModel.findOneAndUpdate(filter, game, { new: true, ...options });
+    return this.gameModel.findOneAndUpdate(filter, game, { new: false, ...options });
   }
 }
killedBy: Game Controller DELETE /game/:id should update game status to canceled when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -72,11 +72,11 @@
        },
      },
