[NoCoverage] ConditionalExpression
providers/services/game-play/game-plays-maker.service.ts:13:34
   public werewolvesEat(game: Game, makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, gameHistoryRecords: GameHistoryRecord[]): Partial<Game> | undefined {
     const { targets } = makeGamePlayWithRelationsDto;
     const gameDataToUpdate: Partial<Game> = {};
-    if (targets === undefined || targets.length !== 1) {
+    if (targets === undefined || false) {
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.WEREWOLVES_EAT, UNEXPECTED_EXCEPTION_REASONS.TOO_LESS_TARGETED_PLAYERS);
     }

[NoCoverage] EqualityOperator
providers/services/game-play/game-plays-maker.service.ts:13:34
   public werewolvesEat(game: Game, makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, gameHistoryRecords: GameHistoryRecord[]): Partial<Game> | undefined {
     const { targets } = makeGamePlayWithRelationsDto;
     const gameDataToUpdate: Partial<Game> = {};
-    if (targets === undefined || targets.length !== 1) {
+    if (targets === undefined || targets.length === 1) {
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.WEREWOLVES_EAT, UNEXPECTED_EXCEPTION_REASONS.TOO_LESS_TARGETED_PLAYERS);
     }

[NoCoverage] EqualityOperator
providers/services/game-play/game-plays-maker.service.ts:17:9
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.WEREWOLVES_EAT, UNEXPECTED_EXCEPTION_REASONS.TOO_LESS_TARGETED_PLAYERS);
     }
     const { player: targetedPlayer, isInfected: isTargetInfected } = targets[0];
-    if (isTargetInfected === true) {
+    if (isTargetInfected !== true) {
     }
     return gameDataToUpdate;

[NoCoverage] ConditionalExpression
providers/services/game-play/game-plays-maker.service.ts:17:9
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.WEREWOLVES_EAT, UNEXPECTED_EXCEPTION_REASONS.TOO_LESS_TARGETED_PLAYERS);
     }
     const { player: targetedPlayer, isInfected: isTargetInfected } = targets[0];
-    if (isTargetInfected === true) {
+    if (false) {
     }
     return gameDataToUpdate;
