[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:20:59
 export class GamePlaysManagerService {
   public isSheriffElectionTime(sheriffGameOptions: SheriffGameOptions, currentTurn: number, currentPhase: GAME_PHASES): boolean {
     const { electedAt, isEnabled } = sheriffGameOptions;
-    return isEnabled && electedAt.turn === currentTurn && electedAt.phase === currentPhase;
+    return isEnabled && electedAt.turn === currentTurn && true;
   }
 
killedBy: Game Plays Manager Service isSheriffElectionTime should return false when it's not the right phase.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
providers/services/game-play/game-plays-manager.service.ts:20:12
 export class GamePlaysManagerService {
   public isSheriffElectionTime(sheriffGameOptions: SheriffGameOptions, currentTurn: number, currentPhase: GAME_PHASES): boolean {
     const { electedAt, isEnabled } = sheriffGameOptions;
-    return isEnabled && electedAt.turn === currentTurn && electedAt.phase === currentPhase;
+    return isEnabled || electedAt.turn === currentTurn && electedAt.phase === currentPhase;
   }
 
killedBy: Game Plays Manager Service isSheriffElectionTime should return false when sheriff is not enabled even if it's the time.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:25:15
 
   public areLoversPlayableForNight(game: CreateGameDto | Game): boolean {
     if (game instanceof CreateGameDto) {
-      return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.CUPID);
+      return !getPlayerDtoWithRole(game.players, ROLE_NAMES.CUPID);
     }
     const cupidPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.CUPID);
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

@@ -186,14 +186,10 @@
      Object {
        "action": "look",

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:28:12
       return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.CUPID);
     }
     const cupidPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.CUPID);
-    return !!cupidPlayer && isPlayerAliveAndPowerful(cupidPlayer);
+    return true;
   }
 
killedBy: Game Plays Manager Service areLoversPlayableForNight should return false when there is no cupid in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:28:12
       return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.CUPID);
     }
     const cupidPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.CUPID);
-    return !!cupidPlayer && isPlayerAliveAndPowerful(cupidPlayer);
+    return false;
   }
 

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:33:14
 
   public areAllPlayableForNight(game: CreateGameDto | Game): boolean {
     if (game instanceof CreateGameDto) {
-      return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.ANGEL);
+      return !getPlayerDtoWithRole(game.players, ROLE_NAMES.ANGEL);
     }
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -178,10 +178,14 @@
      Object {
        "action": "elect-sheriff",

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:36:12
       return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.ANGEL);
     }
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
-    return !!angelPlayer && isPlayerAliveAndPowerful(angelPlayer);
+    return false;
   }
 
killedBy: Game Plays Manager Service areAllPlayableForNight should return true when there is angel in the game alive and powerful.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:36:12
       return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.ANGEL);
     }
     const angelPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.ANGEL);
-    return !!angelPlayer && isPlayerAliveAndPowerful(angelPlayer);
+    return true;
   }
 
killedBy: Game Plays Manager Service areAllPlayableForNight should return false when there is no angel in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
providers/services/game-play/game-plays-manager.service.ts:40:107
   }
 
   public isGroupPlayableForNight(game: CreateGameDto | Game, source: PLAYER_GROUPS): boolean {
-    const specificGroupMethods: Partial<Record<PLAYER_GROUPS, (game: CreateGameDto | Game) => boolean>> = {
-      [PLAYER_GROUPS.ALL]: this.areAllPlayableForNight,
-      [PLAYER_GROUPS.LOVERS]: this.areLoversPlayableForNight,
-      [PLAYER_GROUPS.CHARMED]: this.isPiedPiperPlayableForNight,
-    };
+    const specificGroupMethods: Partial<Record<PLAYER_GROUPS, (game: CreateGameDto | Game) => boolean>> = {};
     if (specificGroupMethods[source] !== undefined) {
       return specificGroupMethods[source]?.(game) === true;
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

@@ -178,10 +178,14 @@
      Object {
        "action": "elect-sheriff",

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:45:9
       [PLAYER_GROUPS.LOVERS]: this.areLoversPlayableForNight,
       [PLAYER_GROUPS.CHARMED]: this.isPiedPiperPlayableForNight,
     };
-    if (specificGroupMethods[source] !== undefined) {
+    if (specificGroupMethods[source] === undefined) {
       return specificGroupMethods[source]?.(game) === true;
     } else if (game instanceof CreateGameDto) {
killedBy: Game Plays Manager Service isGroupPlayableForNight should call all playable method when group is all.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:45:9
       [PLAYER_GROUPS.LOVERS]: this.areLoversPlayableForNight,
       [PLAYER_GROUPS.CHARMED]: this.isPiedPiperPlayableForNight,
     };
-    if (specificGroupMethods[source] !== undefined) {
+    if (false) {
       return specificGroupMethods[source]?.(game) === true;
     } else if (game instanceof CreateGameDto) {
killedBy: Game Plays Manager Service isGroupPlayableForNight should call all playable method when group is all.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:46:14
       [PLAYER_GROUPS.CHARMED]: this.isPiedPiperPlayableForNight,
     };
     if (specificGroupMethods[source] !== undefined) {
-      return specificGroupMethods[source]?.(game) === true;
+      return true;
     } else if (game instanceof CreateGameDto) {
       return true;
killedBy: Game Plays Manager Service isGroupPlayableForNight should call all playable method when group is all.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:46:55
       [PLAYER_GROUPS.CHARMED]: this.isPiedPiperPlayableForNight,
     };
     if (specificGroupMethods[source] !== undefined) {
-      return specificGroupMethods[source]?.(game) === true;
+      return specificGroupMethods[source]?.(game) === false;
     } else if (game instanceof CreateGameDto) {
       return true;
killedBy: Game Plays Manager Service isGroupPlayableForNight should call all playable method when group is all.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:48:14
     if (specificGroupMethods[source] !== undefined) {
       return specificGroupMethods[source]?.(game) === true;
     } else if (game instanceof CreateGameDto) {
-      return true;
+      return false;
     }
     const players = getGroupOfPlayers(game.players, source);

[Killed] ArrowFunction
providers/services/game-play/game-plays-manager.service.ts:51:25
       return true;
     }
     const players = getGroupOfPlayers(game.players, source);
-    return players.some(player => isPlayerAliveAndPowerful(player));
+    return players.some(() => undefined);
   }
 
killedBy: Game Plays Manager Service isGroupPlayableForNight should return true when group is werewolves and at least one is alive.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
providers/services/game-play/game-plays-manager.service.ts:51:12
       return true;
     }
     const players = getGroupOfPlayers(game.players, source);
-    return players.some(player => isPlayerAliveAndPowerful(player));
+    return players.every(player => isPlayerAliveAndPowerful(player));
   }
 
killedBy: Game Plays Manager Service isGroupPlayableForNight should return true when group is werewolves and at least one is alive.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:56:41
 
   public isWhiteWerewolfPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.whiteWerewolf;
-    const shouldWhiteWerewolfBeCalled = wakingUpInterval > 0;
+    const shouldWhiteWerewolfBeCalled = true;
     if (game instanceof CreateGameDto) {
       return shouldWhiteWerewolfBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
killedBy: Game Plays Manager Service isWhiteWerewolfPlayableForNight should return false when white werewolf is in the game dto but options specify that he's never called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:56:41
 
   public isWhiteWerewolfPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.whiteWerewolf;
-    const shouldWhiteWerewolfBeCalled = wakingUpInterval > 0;
+    const shouldWhiteWerewolfBeCalled = false;
     if (game instanceof CreateGameDto) {
       return shouldWhiteWerewolfBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
killedBy: Game Plays Manager Service isWhiteWerewolfPlayableForNight should return true when white werewolf is in the game dto and options specify that he's called every other night.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:58:14
     const { wakingUpInterval } = game.options.roles.whiteWerewolf;
     const shouldWhiteWerewolfBeCalled = wakingUpInterval > 0;
     if (game instanceof CreateGameDto) {
-      return shouldWhiteWerewolfBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
+      return true;
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
killedBy: Game Plays Manager Service isWhiteWerewolfPlayableForNight should return false when white werewolf is not in the game dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:58:45
     const { wakingUpInterval } = game.options.roles.whiteWerewolf;
     const shouldWhiteWerewolfBeCalled = wakingUpInterval > 0;
     if (game instanceof CreateGameDto) {
-      return shouldWhiteWerewolfBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
+      return shouldWhiteWerewolfBeCalled && !getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
killedBy: Game Plays Manager Service isWhiteWerewolfPlayableForNight should return false when white werewolf is not in the game dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:61:12
       return shouldWhiteWerewolfBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    return shouldWhiteWerewolfBeCalled && !!whiteWerewolfPlayer && isPlayerAliveAndPowerful(whiteWerewolfPlayer);
+    return true;
   }
 
killedBy: Game Plays Manager Service isWhiteWerewolfPlayableForNight should return false when white werewolf is not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:61:12
       return shouldWhiteWerewolfBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    return shouldWhiteWerewolfBeCalled && !!whiteWerewolfPlayer && isPlayerAliveAndPowerful(whiteWerewolfPlayer);
+    return false;
   }
 
killedBy: Game Plays Manager Service isWhiteWerewolfPlayableForNight should return true when white werewolf is in the game, alive and powerful.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:66:14
 
   public isPiedPiperPlayableForNight(game: CreateGameDto | Game): boolean {
     if (game instanceof CreateGameDto) {
-      return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.PIED_PIPER);
+      return !getPlayerDtoWithRole(game.players, ROLE_NAMES.PIED_PIPER);
     }
     const { isPowerlessIfInfected } = game.options.roles.piedPiper;
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -197,8 +197,12 @@
      },
      Object {

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:70:12
     }
     const { isPowerlessIfInfected } = game.options.roles.piedPiper;
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
-    return !!piedPiperPlayer && canPiedPiperCharm(piedPiperPlayer, isPowerlessIfInfected);
+    return true;
   }
 
killedBy: Game Plays Manager Service isPiedPiperPlayableForNight should return false when pied piper is not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:70:12
     }
     const { isPowerlessIfInfected } = game.options.roles.piedPiper;
     const piedPiperPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.PIED_PIPER);
-    return !!piedPiperPlayer && canPiedPiperCharm(piedPiperPlayer, isPowerlessIfInfected);
+    return false;
   }
 

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:75:15
 
   public isBigBadWolfPlayableForNight(game: CreateGameDto | Game): boolean {
     if (game instanceof CreateGameDto) {
-      return !!getPlayerDtoWithRole(game.players, ROLE_NAMES.BIG_BAD_WOLF);
+      return !getPlayerDtoWithRole(game.players, ROLE_NAMES.BIG_BAD_WOLF);
     }
     const { isPowerlessIfWerewolfDies } = game.options.roles.bigBadWolf;
killedBy: Game Plays Manager Service isBigBadWolfPlayableForNight should return false when big bad wolf is not in the game dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:79:12
     }
     const { isPowerlessIfWerewolfDies } = game.options.roles.bigBadWolf;
     const bigBadWolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.BIG_BAD_WOLF);
-    return !!bigBadWolfPlayer && isPlayerAliveAndPowerful(bigBadWolfPlayer) && (!isPowerlessIfWerewolfDies || areAllWerewolvesAlive(game.players));
+    return true && (!isPowerlessIfWerewolfDies || areAllWerewolvesAlive(game.players));
   }
 
killedBy: Game Plays Manager Service isBigBadWolfPlayableForNight should return false when big bad wolf is not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:79:12
     }
     const { isPowerlessIfWerewolfDies } = game.options.roles.bigBadWolf;
     const bigBadWolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.BIG_BAD_WOLF);
-    return !!bigBadWolfPlayer && isPlayerAliveAndPowerful(bigBadWolfPlayer) && (!isPowerlessIfWerewolfDies || areAllWerewolvesAlive(game.players));
+    return false;
   }
 
killedBy: Game Plays Manager Service isBigBadWolfPlayableForNight should return true when big bad wolf is in the game, one werewolf is dead but classic rules are not followed.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:84:41
 
   public areThreeBrothersPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.threeBrothers;
-    const shouldThreeBrothersBeCalled = wakingUpInterval > 0;
+    const shouldThreeBrothersBeCalled = wakingUpInterval <= 0;
     if (game instanceof CreateGameDto) {
       return shouldThreeBrothersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.THREE_BROTHERS);
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when three brothers are in the game dto but options specify that they are never called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:84:41
 
   public areThreeBrothersPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.threeBrothers;
-    const shouldThreeBrothersBeCalled = wakingUpInterval > 0;
+    const shouldThreeBrothersBeCalled = wakingUpInterval >= 0;
     if (game instanceof CreateGameDto) {
       return shouldThreeBrothersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.THREE_BROTHERS);
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when three brothers are in the game dto but options specify that they are never called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:86:46
     const { wakingUpInterval } = game.options.roles.threeBrothers;
     const shouldThreeBrothersBeCalled = wakingUpInterval > 0;
     if (game instanceof CreateGameDto) {
-      return shouldThreeBrothersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.THREE_BROTHERS);
+      return shouldThreeBrothersBeCalled && !getPlayerDtoWithRole(game.players, ROLE_NAMES.THREE_BROTHERS);
     }
     const threeBrothersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.THREE_BROTHERS);
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when three brothers are not in the game dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:86:14
     const { wakingUpInterval } = game.options.roles.threeBrothers;
     const shouldThreeBrothersBeCalled = wakingUpInterval > 0;
     if (game instanceof CreateGameDto) {
-      return shouldThreeBrothersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.THREE_BROTHERS);
+      return false;
     }
     const threeBrothersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.THREE_BROTHERS);
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return true when three brother are in the game dto and options specify that they are called every other night.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
providers/services/game-play/game-plays-manager.service.ts:90:43
     }
     const threeBrothersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.THREE_BROTHERS);
     const minimumBrotherCountToCall = 2;
-    return shouldThreeBrothersBeCalled && threeBrothersPlayers.filter(brother => brother.isAlive).length >= minimumBrotherCountToCall;
+    return shouldThreeBrothersBeCalled && threeBrothersPlayers.length >= minimumBrotherCountToCall;
   }
 
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when one brothers is alive.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:90:43
     }
     const threeBrothersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.THREE_BROTHERS);
     const minimumBrotherCountToCall = 2;
-    return shouldThreeBrothersBeCalled && threeBrothersPlayers.filter(brother => brother.isAlive).length >= minimumBrotherCountToCall;
+    return shouldThreeBrothersBeCalled && true;
   }
 
killedBy: Game Plays Manager Service areThreeBrothersPlayableForNight should return false when one brothers is alive.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:95:38
 
   public areTwoSistersPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.twoSisters;
-    const shouldTwoSistersBeCalled = wakingUpInterval > 0;
+    const shouldTwoSistersBeCalled = true;
     if (game instanceof CreateGameDto) {
       return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return false when two sisters are in the game dto but options specify that they are never called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:95:38
 
   public areTwoSistersPlayableForNight(game: CreateGameDto | Game): boolean {
     const { wakingUpInterval } = game.options.roles.twoSisters;
-    const shouldTwoSistersBeCalled = wakingUpInterval > 0;
+    const shouldTwoSistersBeCalled = wakingUpInterval <= 0;
     if (game instanceof CreateGameDto) {
       return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return false when two sisters are in the game dto but options specify that they are never called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:97:43
     const { wakingUpInterval } = game.options.roles.twoSisters;
     const shouldTwoSistersBeCalled = wakingUpInterval > 0;
     if (game instanceof CreateGameDto) {
-      return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
+      return shouldTwoSistersBeCalled && !getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
     }
     const twoSistersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.TWO_SISTERS);
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return false when two sisters are not in the game dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:97:14
     const { wakingUpInterval } = game.options.roles.twoSisters;
     const shouldTwoSistersBeCalled = wakingUpInterval > 0;
     if (game instanceof CreateGameDto) {
-      return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
+      return false;
     }
     const twoSistersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.TWO_SISTERS);
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return true when two sisters are in the game dto and options specify that they are called every other night.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:100:40
       return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
     }
     const twoSistersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.TWO_SISTERS);
-    return shouldTwoSistersBeCalled && twoSistersPlayers.length > 0 && twoSistersPlayers.every(sister => sister.isAlive);
+    return shouldTwoSistersBeCalled && twoSistersPlayers.length <= 0 && twoSistersPlayers.every(sister => sister.isAlive);
   }
 
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return false when two sisters are not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:100:40
       return shouldTwoSistersBeCalled && !!getPlayerDtoWithRole(game.players, ROLE_NAMES.TWO_SISTERS);
     }
     const twoSistersPlayers = getPlayersWithCurrentRole(game.players, ROLE_NAMES.TWO_SISTERS);
-    return shouldTwoSistersBeCalled && twoSistersPlayers.length > 0 && twoSistersPlayers.every(sister => sister.isAlive);
+    return shouldTwoSistersBeCalled && true && twoSistersPlayers.every(sister => sister.isAlive);
   }
 
killedBy: Game Plays Manager Service areTwoSistersPlayableForNight should return false when two sisters are not in the game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
providers/services/game-play/game-plays-manager.service.ts:106:14
   public isRolePlayableForNight(game: CreateGameDto | Game, source: ROLE_NAMES): boolean {
     const player = game instanceof CreateGameDto ? getPlayerDtoWithRole(game.players, source) : getPlayerWithCurrentRole(game.players, source);
     if (!player) {
-      return false;
+      return true;
     }
     const specificRoleMethods: Partial<Record<ROLE_NAMES, (game: CreateGameDto | Game) => boolean>> = {
killedBy: Game Plays Manager Service isRolePlayableForNight should return false when player is not in game.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:115:9
       [ROLE_NAMES.PIED_PIPER]: this.isPiedPiperPlayableForNight,
       [ROLE_NAMES.WHITE_WEREWOLF]: this.isWhiteWerewolfPlayableForNight,
     };
-    if (specificRoleMethods[source] !== undefined) {
+    if (specificRoleMethods[source] === undefined) {
       return specificRoleMethods[source]?.(game) === true;
     }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -178,18 +178,10 @@
      Object {
        "action": "elect-sheriff",

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:115:9
       [ROLE_NAMES.PIED_PIPER]: this.isPiedPiperPlayableForNight,
       [ROLE_NAMES.WHITE_WEREWOLF]: this.isWhiteWerewolfPlayableForNight,
     };
-    if (specificRoleMethods[source] !== undefined) {
+    if (false) {
       return specificRoleMethods[source]?.(game) === true;
     }
killedBy: Game Plays Manager Service isRolePlayableForNight should call two sisters method when role is two sisters.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0
