[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:116:14
       [ROLE_NAMES.WHITE_WEREWOLF]: this.isWhiteWerewolfPlayableForNight,
     };
     if (specificRoleMethods[source] !== undefined) {
-      return specificRoleMethods[source]?.(game) === true;
+      return specificRoleMethods[source]?.(game) !== true;
     }
     return player instanceof CreateGamePlayerDto || isPlayerAliveAndPowerful(player);
killedBy: Game Plays Manager Service isRolePlayableForNight should call pied piper method when role is pied piper.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:116:14
       [ROLE_NAMES.WHITE_WEREWOLF]: this.isWhiteWerewolfPlayableForNight,
     };
     if (specificRoleMethods[source] !== undefined) {
-      return specificRoleMethods[source]?.(game) === true;
+      return true;
     }
     return player instanceof CreateGamePlayerDto || isPlayerAliveAndPowerful(player);
killedBy: Game Plays Manager Service isRolePlayableForNight should call two sisters method when role is two sisters.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:118:12
     if (specificRoleMethods[source] !== undefined) {
       return specificRoleMethods[source]?.(game) === true;
     }
-    return player instanceof CreateGamePlayerDto || isPlayerAliveAndPowerful(player);
+    return false;
   }
 
killedBy: Game Plays Manager Service isRolePlayableForNight should return true when player is dto.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:118:12
     if (specificRoleMethods[source] !== undefined) {
       return specificRoleMethods[source]?.(game) === true;
     }
-    return player instanceof CreateGamePlayerDto || isPlayerAliveAndPowerful(player);
+    return true;
   }
 
killedBy: Game Plays Manager Service isRolePlayableForNight should return false when player is dead.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
providers/services/game-play/game-plays-manager.service.ts:122:35
   }
 
   public isSourcePlayableForNight(game: CreateGameDto | Game, source: GameSource): boolean {
-    if (isGameSourceRole(source)) {
-      return this.isRolePlayableForNight(game, source);
-    } else if (isGameSourceGroup(source)) {
+    if (isGameSourceRole(source)) {} else if (isGameSourceGroup(source)) {
       return this.isGroupPlayableForNight(game, source);
     }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 12
+ Received  +  0

@@ -178,27 +178,15 @@
      Object {
        "action": "elect-sheriff",

[Killed] BlockStatement
providers/services/game-play/game-plays-manager.service.ts:124:43
   public isSourcePlayableForNight(game: CreateGameDto | Game, source: GameSource): boolean {
     if (isGameSourceRole(source)) {
       return this.isRolePlayableForNight(game, source);
-    } else if (isGameSourceGroup(source)) {
-      return this.isGroupPlayableForNight(game, source);
-    }
+    } else if (isGameSourceGroup(source)) {}
     return false;
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

@@ -186,18 +186,10 @@
      Object {
        "action": "look",

[Killed] EqualityOperator
providers/services/game-play/game-plays-manager.service.ts:131:26
   }
 
   public getUpcomingNightPlays(game: CreateGameDto | Game): GamePlay[] {
-    const isFirstNight = game.turn === 1;
+    const isFirstNight = game.turn !== 1;
     const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== true);
     const isSheriffElectionTime = this.isSheriffElectionTime(game.options.roles.sheriff, game.turn, game.phase);
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the first night with official rules and all roles who act during the night [#1].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 28
+ Received  +  0

@@ -2,52 +2,24 @@
    Object {
      "action": "elect-sheriff",

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:131:26
   }
 
   public getUpcomingNightPlays(game: CreateGameDto | Game): GamePlay[] {
-    const isFirstNight = game.turn === 1;
+    const isFirstNight = true;
     const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== true);
     const isSheriffElectionTime = this.isSheriffElectionTime(game.options.roles.sheriff, game.turn, game.phase);
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the second night with official rules and some roles [#2].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

  Array [
    Object {
+     "action": "charm",

[Killed] MethodExpression
providers/services/game-play/game-plays-manager.service.ts:132:32
 
   public getUpcomingNightPlays(game: CreateGameDto | Game): GamePlay[] {
     const isFirstNight = game.turn === 1;
-    const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== true);
+    const eligibleNightPlays = gamePlaysNightOrder;
     const isSheriffElectionTime = this.isSheriffElectionTime(game.options.roles.sheriff, game.turn, game.phase);
     const upcomingNightPlays: GamePlay[] = isSheriffElectionTime ? [sheriffElectionPlay] : [];
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the second night with official rules and some roles [#2].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

  Array [
    Object {
+     "action": "charm",

[Killed] ConditionalExpression
providers/services/game-play/game-plays-manager.service.ts:132:67
 
   public getUpcomingNightPlays(game: CreateGameDto | Game): GamePlay[] {
     const isFirstNight = game.turn === 1;
-    const eligibleNightPlays = gamePlaysNightOrder.filter(play => isFirstNight || play.isFirstNightOnly !== true);
+    const eligibleNightPlays = gamePlaysNightOrder.filter(play => true);
     const isSheriffElectionTime = this.isSheriffElectionTime(game.options.roles.sheriff, game.turn, game.phase);
     const upcomingNightPlays: GamePlay[] = isSheriffElectionTime ? [sheriffElectionPlay] : [];
killedBy: Game Plays Manager Service getUpcomingNightPlays should get upcoming night plays when it's the second night with official rules and some roles [#2].
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

  Array [
    Object {
+     "action": "charm",
