[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:22:135
 export class GamePlaysValidatorService {
   public constructor(private readonly gameHistoryRecordService: GameHistoryRecordService) {}
 
-  public validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
-    const { chosenCard } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!chosenCard) {
-      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
-      }
-      return;
-    }
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_CARD);
-    }
-  }
+  public validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {}
 
   public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should throw error when chosen card is not defined but expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:25:22
   public validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
     const { chosenCard } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!chosenCard) {
-      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
-      }
-      return;
-    }
+    if (!chosenCard) {}
     if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_CARD);
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should do nothing when there's no upcoming play.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:25:9
   public validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
     const { chosenCard } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!chosenCard) {
+    if (true) {
       if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should throw error when chosen card is defined but not expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:26:11
     const { chosenCard } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     if (!chosenCard) {
-      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
+      if (false) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
       }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should throw error when chosen card is not defined but expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:26:11
     const { chosenCard } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     if (!chosenCard) {
-      if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_CARD) {
+      if (true) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_CARD);
       }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should do nothing when there's no upcoming play.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:31:67
       }
       return;
     }
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_CARD);
-    }
+    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should throw error when chosen card is defined but not expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:31:9
       }
       return;
     }
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_CARD) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_CARD);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenCardData should throw error when chosen card is defined but not expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:36:109
     }
   }
 
-  public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankLifePotionTargets.length > 1) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
-    }
-    if (drankLifePotionTargets.length && (!doesPlayerHaveAttribute(drankLifePotionTargets[0].player, PLAYER_ATTRIBUTE_NAMES.EATEN) || !drankLifePotionTargets[0].player.isAlive)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_LIFE_POTION_TARGET);
-    }
-  }
+  public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {}
 
   public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when there are too much targets for life potion.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:37:9
   }
 
   public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankLifePotionTargets.length > 1) {
+    if (drankLifePotionTargets.length >= 1) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
     }
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when life potion target is not alive.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Life potion can't be applied to this target (`targets.drankPotion`)"
Received: "There are too much targets which drank life potion (`targets.drankPotion`)"

Number of calls: 1

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:37:9
   }
 
   public validateDrankLifePotionTargets(drankLifePotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankLifePotionTargets.length > 1) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
     }
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when there are too much targets for life potion.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "There are too much targets which drank life potion (`targets.drankPotion`)"
Received: "Life potion can't be applied to this target (`targets.drankPotion`)"

Number of calls: 1

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:40:9
     if (drankLifePotionTargets.length > 1) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
     }
-    if (drankLifePotionTargets.length && (!doesPlayerHaveAttribute(drankLifePotionTargets[0].player, PLAYER_ATTRIBUTE_NAMES.EATEN) || !drankLifePotionTargets[0].player.isAlive)) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_LIFE_POTION_TARGET);
     }
killedBy: Game Controller POST /game/:id/play should make a game play when called with targets.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:40:43
     if (drankLifePotionTargets.length > 1) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_LIFE_POTION_TARGETS);
     }
-    if (drankLifePotionTargets.length && (!doesPlayerHaveAttribute(drankLifePotionTargets[0].player, PLAYER_ATTRIBUTE_NAMES.EATEN) || !drankLifePotionTargets[0].player.isAlive)) {
+    if (drankLifePotionTargets.length && (!doesPlayerHaveAttribute(drankLifePotionTargets[0].player, PLAYER_ATTRIBUTE_NAMES.EATEN) && !drankLifePotionTargets[0].player.isAlive)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_LIFE_POTION_TARGET);
     }
killedBy: Game Plays Validator Service validateDrankLifePotionTargets should throw error when life potion target is not alive.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:45:111
     }
   }
 
-  public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankDeathPotionTargets.length > 1) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
-    }
-    if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_DEATH_POTION_TARGET);
-    }
-  }
+  public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {}
 
   public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
killedBy: Game Plays Validator Service validateDrankDeathPotionTargets should throw error when there are too much targets for death potion.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:46:45
   }
 
   public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankDeathPotionTargets.length > 1) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
-    }
+    if (drankDeathPotionTargets.length > 1) {}
     if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_DEATH_POTION_TARGET);
killedBy: Game Plays Validator Service validateDrankDeathPotionTargets should throw error when there are too much targets for death potion.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:46:9
   }
 
   public validateDrankDeathPotionTargets(drankDeathPotionTargets: MakeGamePlayTargetWithRelationsDto[]): void {
-    if (drankDeathPotionTargets.length > 1) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
     }
killedBy: Game Controller POST /game/:id/play should make a game play when called with targets.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:49:87
     if (drankDeathPotionTargets.length > 1) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
     }
-    if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_DEATH_POTION_TARGET);
-    }
+    if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {}
   }
 
killedBy: Game Plays Validator Service validateDrankDeathPotionTargets should throw error when death potion target is not alive.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:49:9
     if (drankDeathPotionTargets.length > 1) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_DRANK_DEATH_POTION_TARGETS);
     }
-    if (drankDeathPotionTargets.length && !drankDeathPotionTargets[0].player.isAlive) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_DEATH_POTION_TARGET);
     }
killedBy: Game Plays Validator Service validateDrankDeathPotionTargets should do nothing when there is no death potion target.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:54:173
     }
   }
 
-  public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
-    const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
-    const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
-    const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
-    const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
-    if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
-        hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_DRANK_POTION_TARGET);
-    }
-    this.validateDrankLifePotionTargets(drankLifePotionTargets);
-    this.validateDrankDeathPotionTargets(drankDeathPotionTargets);
-  }
+  public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when expected action is not USE_POTIONS but targets drank potions.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:57:96
   public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
+    const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => false);
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when expected action is not USE_POTIONS but targets drank potions.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:57:96
   public validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
+    const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => true);
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should do nothing when none drank potions and action is not USE_POTIONS.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:58:117
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
-    const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
+    const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => true));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should call potions validators with players when called for valid life potion data and some witch history.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ArrowFunction
providers/services/game-play/game-plays-validator.service.ts:58:60
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
-    const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
+    const hasWitchUsedLifePotion = gameHistoryRecords.some(() => undefined);
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with life potion but already used it with death potion before.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "`targets.drankPotion` can't be set on this current game's state"
Received: "Life potion can't be applied to this target (`targets.drankPotion`)"

Number of calls: 1

[Killed] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:59:36
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
-    const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
+    const drankLifePotionTargets = drankPotionTargets;
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should call potions validators with players when called without bad data and without witch history.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -17,6 +17,26 @@
          "current": "werewolves",
          "original": "villagers",

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:59:83
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
-    const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
+    const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => false);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with life potion but already used it with death potion before.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ArrowFunction
providers/services/game-play/game-plays-validator.service.ts:60:97
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
-    const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
+    const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(() => undefined));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
     if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with death potion but already used it wit life potion before.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:60:37
     const drankPotionTargets = makeGamePlayTargetsWithRelationsDto.filter(({ drankPotion }) => drankPotion !== undefined);
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
-    const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
+    const hasWitchUsedDeathPotion = gameHistoryRecords.every(record => record.play.targets?.some(({
+  drankPotion
+}) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
     if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with death potion but already used it wit life potion before.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "`targets.drankPotion` can't be set on this current game's state"
Received: "Death potion can't be applied to this target (`targets.drankPotion`)"

Number of calls: 1

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:61:84
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
-    const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
+    const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion !== WITCH_POTIONS.DEATH);
     if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
         hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with death potion but already used it wit life potion before.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw
