[Killed] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:61:37
     const hasWitchUsedLifePotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE));
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
-    const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
+    const drankDeathPotionTargets = drankPotionTargets;
     if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
         hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should call potions validators with players when called without bad data and without witch history.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,27 @@
  Array [
    MakeGamePlayTargetWithRelationsDto {

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:62:9
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
-    if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
-        hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_DRANK_POTION_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should do nothing when none drank potions and action is not USE_POTIONS.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:62:10
     const drankLifePotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.LIFE);
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
-    if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
+    if ((upcomingGamePlayAction === GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
         hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_DRANK_POTION_TARGET);
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when expected action is not USE_POTIONS but targets drank potions.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "`targets.drankPotion` can't be set on this current game's state"
Received: "Life potion can't be applied to this target (`targets.drankPotion`)"

Number of calls: 1

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:63:68
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
     if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
-        hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
+        hasWitchUsedLifePotion && drankLifePotionTargets.length || false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_DRANK_POTION_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should throw error when witch targeted someone with death potion but already used it wit life potion before.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "`targets.drankPotion` can't be set on this current game's state"
Received: "Death potion can't be applied to this target (`targets.drankPotion`)"

Number of calls: 1

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:63:9
     const hasWitchUsedDeathPotion = gameHistoryRecords.some(record => record.play.targets?.some(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH));
     const drankDeathPotionTargets = drankPotionTargets.filter(({ drankPotion }) => drankPotion === WITCH_POTIONS.DEATH);
     if ((upcomingGamePlayAction !== GAME_PLAY_ACTIONS.USE_POTIONS || upcomingGamePlaySource !== ROLE_NAMES.WITCH) && drankPotionTargets.length ||
-        hasWitchUsedLifePotion && drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
+        hasWitchUsedLifePotion || drankLifePotionTargets.length || hasWitchUsedDeathPotion && drankDeathPotionTargets.length) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_DRANK_POTION_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWitchTargets should call potions validators with players when called without bad data and without witch history.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:70:176
     this.validateDrankDeathPotionTargets(drankDeathPotionTargets);
   }
 
-  public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
-    const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
-    const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
-    if (infectedTargets.length) {
-      if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
-      }
-      this.validateGamePlayTargetsBoundaries(infectedTargets, { min: 1, max: 1 });
-    }
-  }
+  public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when expected action is not EAT and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:73:92
   public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
+    const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => false);
     const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when expected action is not EAT and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:73:92
   public validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
+    const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => true);
     const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
killedBy: Game Controller POST /game/:id/play should make a game play when called with targets.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:74:77
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
-    const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
+    const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.every(({
+  isInfected
+}) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when vile father of wolves has already infected and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ArrowFunction
providers/services/game-play/game-plays-validator.service.ts:74:103
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
-    const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
+    const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(() => undefined));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when vile father of wolves has already infected and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:76:9
     const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
     const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
-    if (infectedTargets.length) {
+    if (true) {
       if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
         !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should do nothing when there is no infected target.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:76:33
     const infectedTargets = makeGamePlayTargetsWithRelationsDto.filter(({ isInfected }) => isInfected === true);
     const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
-    if (infectedTargets.length) {
-      if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
-      }
-      this.validateGamePlayTargetsBoundaries(infectedTargets, { min: 1, max: 1 });
-    }
+    if (infectedTargets.length) {}
   }
 

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:77:11
     const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {
-      if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
+      if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT && upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
         !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when expected action is not EAT and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:77:11
     const hasVileFatherOfWolvesInfected = gameHistoryRecords.some(record => record.play.targets?.some(({ isInfected }) => isInfected));
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {
-      if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
+      if (true) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
       }
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should do nothing when infected target data is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:78:9
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {
       if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
+        isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
       }
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should do nothing when infected target data is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:78:95
     const vileFatherOfWolvesPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.VILE_FATHER_OF_WOLVES);
     if (infectedTargets.length) {
       if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT || upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES || !vileFatherOfWolvesPlayer ||
-        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_INFECTED_TARGET);
-      }
+        !isPlayerAliveAndPowerful(vileFatherOfWolvesPlayer) || hasVileFatherOfWolvesInfected) {}
       this.validateGamePlayTargetsBoundaries(infectedTargets, { min: 1, max: 1 });
     }
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should throw error when expected action is not EAT and some targets are infected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:85:137
     }
   }
 
-  public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
-    }
-    if (upcomingGamePlaySource === ROLE_NAMES.BIG_BAD_WOLF &&
-      (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer) || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
-    }
-    const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF && (!targetedPlayer.isAlive || !isPlayerOnWerewolvesSide(targetedPlayer) ||
-      whiteWerewolfPlayer?._id === targetedPlayer._id)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WHITE_WEREWOLF_TARGET);
-    }
-  }
+  public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WEREWOLVES and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:88:59
   public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT) {
-      return;
-    }
+    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT) {}
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should do nothing when game play action is not EAT.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:88:9
   public validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.EAT) {
+    if (true) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WEREWOLVES and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:93:9
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
+    if (upcomingGamePlaySource !== PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WEREWOLVES and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:93:9
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
+    if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES || !targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is BIG_BAD_WOLF and targeted player is dead.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Big bad wolf can't eat this target"
Received: "Werewolves can't eat this target"

Number of calls: 1

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:96:9
     if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
-    if (upcomingGamePlaySource === ROLE_NAMES.BIG_BAD_WOLF &&
-      (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer) || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WHITE_WEREWOLF and targeted player is dead.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "White werewolf can't eat this target"
Received: "Big bad wolf can't eat this target"

Number of calls: 1

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:96:9
     if (upcomingGamePlaySource === PLAYER_GROUPS.WEREWOLVES && (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
-    if (upcomingGamePlaySource === ROLE_NAMES.BIG_BAD_WOLF &&
+    if (true &&
       (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer) || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WHITE_WEREWOLF and targeted player is dead.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "White werewolf can't eat this target"
Received: "Big bad wolf can't eat this target"

Number of calls: 1

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:97:8
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
     if (upcomingGamePlaySource === ROLE_NAMES.BIG_BAD_WOLF &&
-      (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer) || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
+      (false || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is BIG_BAD_WOLF and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:97:8
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WEREWOLVES_TARGET);
     }
     if (upcomingGamePlaySource === ROLE_NAMES.BIG_BAD_WOLF &&
-      (!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer) || doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
+      ((!targetedPlayer.isAlive || !isPlayerOnVillagersSide(targetedPlayer)) && doesPlayerHaveAttribute(targetedPlayer, PLAYER_ATTRIBUTE_NAMES.EATEN))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is BIG_BAD_WOLF and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:101:9
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF && (!targetedPlayer.isAlive || !isPlayerOnWerewolvesSide(targetedPlayer) ||
-      whiteWerewolfPlayer?._id === targetedPlayer._id)) {
+    if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF || !targetedPlayer.isAlive || !isPlayerOnWerewolvesSide(targetedPlayer) || whiteWerewolfPlayer?._id === targetedPlayer._id) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WHITE_WEREWOLF_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should do nothing when white werewolf eaten target is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""
