[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:101:66
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_BIG_BAD_WOLF_TARGET);
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
-    if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF && (!targetedPlayer.isAlive || !isPlayerOnWerewolvesSide(targetedPlayer) ||
+    if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF && (!targetedPlayer.isAlive && !isPlayerOnWerewolvesSide(targetedPlayer) ||
       whiteWerewolfPlayer?._id === targetedPlayer._id)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WHITE_WEREWOLF_TARGET);
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WHITE_WEREWOLF and targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:102:7
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF && (!targetedPlayer.isAlive || !isPlayerOnWerewolvesSide(targetedPlayer) ||
-      whiteWerewolfPlayer?._id === targetedPlayer._id)) {
+      false)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WHITE_WEREWOLF_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWerewolvesTargets should throw error when source is WHITE_WEREWOLF and targeted player is white werewolf himself.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:102:7
     }
     const whiteWerewolfPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WHITE_WEREWOLF);
     if (upcomingGamePlaySource === ROLE_NAMES.WHITE_WEREWOLF && (!targetedPlayer.isAlive || !isPlayerOnWerewolvesSide(targetedPlayer) ||
-      whiteWerewolfPlayer?._id === targetedPlayer._id)) {
+      whiteWerewolfPlayer?._id !== targetedPlayer._id)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WHITE_WEREWOLF_TARGET);
     }

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:107:133
     }
   }
 
-  public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SHOOT || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_HUNTER_TARGET);
-    }
-  }
+  public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:110:9
   public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SHOOT || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
+    if (false || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should do nothing when game play action is not SHOOT.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:110:9
   public validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SHOOT || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
+    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SHOOT || upcomingGamePlaySource !== ROLE_NAMES.HUNTER) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should do nothing when game play action is not SHOOT.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:115:9
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_HUNTER_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should do nothing when targeted player for hunter is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:115:9
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive) {
+    if (targetedPlayer.isAlive) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_HUNTER_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayHunterTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:120:136
     }
   }
 
-  public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.BAN_VOTING || upcomingGamePlaySource !== ROLE_NAMES.SCAPEGOAT) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: game.players.length });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SCAPEGOAT_TARGETS);
-    }
-  }
+  public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:123:68
   public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.BAN_VOTING || upcomingGamePlaySource !== ROLE_NAMES.SCAPEGOAT) {
+    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.BAN_VOTING || false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should do nothing when game play source is not SCAPEGOAT.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:123:9
   public validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.BAN_VOTING || upcomingGamePlaySource !== ROLE_NAMES.SCAPEGOAT) {
+    if (upcomingGamePlayAction !== GAME_PLAY_ACTIONS.BAN_VOTING && upcomingGamePlaySource !== ROLE_NAMES.SCAPEGOAT) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should do nothing when game play action is not BAN_VOTING.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:127:9
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: game.players.length });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
+    if (makeGamePlayTargetsWithRelationsDto.every(({
+  player
+}) => !player.isAlive)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SCAPEGOAT_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:127:84
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: game.players.length });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SCAPEGOAT_TARGETS);
-    }
+    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayScapeGoatTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:132:132
     }
   }
 
-  public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.CUPID || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 2, max: 2 });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_CUPID_TARGETS);
-    }
-  }
+  public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayCupidTargets should throw error when one of the targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:135:9
   public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.CUPID || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.CUPID && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayCupidTargets should do nothing when game play action is not CHARM.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:135:9
   public validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.CUPID || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
+    if (upcomingGamePlaySource === ROLE_NAMES.CUPID || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayCupidTargets should do nothing when game play source is not CUPID.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:139:9
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 2, max: 2 });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_CUPID_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayCupidTargets should do nothing when all cupid's targets are valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Timeout] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:139:9
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 2, max: 2 });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !player.isAlive)) {
+    if (makeGamePlayTargetsWithRelationsDto.every(({
+  player
+}) => !player.isAlive)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_CUPID_TARGETS);
     }

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:144:130
     }
   }
 
-  public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.FOX || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SNIFF) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_FOX_TARGET);
-    }
-  }
+  public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:147:9
   public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.FOX || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SNIFF) {
+    if (upcomingGamePlaySource === ROLE_NAMES.FOX || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SNIFF) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayFoxTargets should do nothing when game play source is not FOX.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:147:54
   public validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.FOX || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.SNIFF) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.FOX || false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayFoxTargets should do nothing when game play action is not SNIFF.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:157:131
     }
   }
 
-  public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.SEER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.LOOK) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const seerPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.SEER);
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === seerPlayer?._id) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SEER_TARGET);
-    }
-  }
+  public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlaySeerTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:160:55
   public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.SEER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.LOOK) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.SEER || false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlaySeerTargets should do nothing when game play action is not LOOK.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:160:9
   public validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.SEER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.LOOK) {
+    if (false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlaySeerTargets should do nothing when game play action is not LOOK.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:166:36
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const seerPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.SEER);
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === seerPlayer?._id) {
+    if (!targetedPlayer.isAlive || false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SEER_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySeerTargets should throw error when targeted player is seer herself.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:166:9
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const seerPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.SEER);
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === seerPlayer?._id) {
+    if (!targetedPlayer.isAlive && targetedPlayer._id === seerPlayer?._id) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SEER_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySeerTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:171:132
     }
   }
 
-  public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.RAVEN || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.MARK) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_RAVEN_TARGET);
-    }
-  }
+  public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:174:9
   public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.RAVEN || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.MARK) {
+    if (upcomingGamePlaySource === ROLE_NAMES.RAVEN || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.MARK) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should do nothing when game play source is not RAVEN.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:174:9
   public validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.RAVEN || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.MARK) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.RAVEN && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.MARK) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should do nothing when game play action is not MARK.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:178:9
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_RAVEN_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayRavenTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:178:111
       return;
     }
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 0, max: 1 });
-    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_RAVEN_TARGET);
-    }
+    if (makeGamePlayTargetsWithRelationsDto.length && !makeGamePlayTargetsWithRelationsDto[0].player.isAlive) {}
   }
 
