[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:183:136
     }
   }
 
-  public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.WILD_CHILD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_MODEL) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const wildChildPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WILD_CHILD);
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === wildChildPlayer?._id) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WILD_CHILD_TARGET);
-    }
-  }
+  public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayWildChildTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:186:9
   public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.WILD_CHILD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_MODEL) {
+    if (true) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayWildChildTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:186:61
   public validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.WILD_CHILD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_MODEL) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.WILD_CHILD || false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayWildChildTargets should do nothing when game play action is not CHOOSE_MODEL.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:192:9
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const wildChildPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WILD_CHILD);
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === wildChildPlayer?._id) {
+    if (targetedPlayer.isAlive || targetedPlayer._id === wildChildPlayer?._id) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WILD_CHILD_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWildChildTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:192:36
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const wildChildPlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.WILD_CHILD);
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || targetedPlayer._id === wildChildPlayer?._id) {
+    if (!targetedPlayer.isAlive || targetedPlayer._id !== wildChildPlayer?._id) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_WILD_CHILD_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayWildChildTargets should throw error when targeted player is wild child himself.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:197:136
     }
   }
 
-  public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.PIED_PIPER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
-      return;
-    }
-    const { charmedPeopleCountPerNight } = game.options.roles.piedPiper;
-    const leftToCharmByPiedPiperPlayers = getLeftToCharmByPiedPiperPlayers(game.players);
-    const leftToCharmByPiedPiperPlayersCount = leftToCharmByPiedPiperPlayers.length;
-    const countToCharm = Math.min(charmedPeopleCountPerNight, leftToCharmByPiedPiperPlayersCount);
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: countToCharm, max: countToCharm });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !leftToCharmByPiedPiperPlayers.find(({ _id }) => player._id === _id))) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_PIED_PIPER_TARGETS);
-    }
-  }
+  public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {}
 
   public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:200:9
   public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.PIED_PIPER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
+    if (upcomingGamePlaySource === ROLE_NAMES.PIED_PIPER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayPiedPiperTargets should do nothing when game play source is not PIED_PIPER.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:200:113
   public validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.PIED_PIPER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {
-      return;
-    }
+    if (upcomingGamePlaySource !== ROLE_NAMES.PIED_PIPER || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHARM) {}
     const { charmedPeopleCountPerNight } = game.options.roles.piedPiper;
     const leftToCharmByPiedPiperPlayers = getLeftToCharmByPiedPiperPlayers(game.players);
killedBy: Game Controller POST /game/:id/play should make a game play when called with targets.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:208:9
     const leftToCharmByPiedPiperPlayersCount = leftToCharmByPiedPiperPlayers.length;
     const countToCharm = Math.min(charmedPeopleCountPerNight, leftToCharmByPiedPiperPlayersCount);
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: countToCharm, max: countToCharm });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !leftToCharmByPiedPiperPlayers.find(({ _id }) => player._id === _id))) {
+    if (makeGamePlayTargetsWithRelationsDto.every(({
+  player
+}) => !leftToCharmByPiedPiperPlayers.find(({
+  _id
+}) => player._id === _id))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_PIED_PIPER_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayPiedPiperTargets should throw error when one of the targeted player is not in the last to charm.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:208:115
     const leftToCharmByPiedPiperPlayersCount = leftToCharmByPiedPiperPlayers.length;
     const countToCharm = Math.min(charmedPeopleCountPerNight, leftToCharmByPiedPiperPlayersCount);
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: countToCharm, max: countToCharm });
-    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !leftToCharmByPiedPiperPlayers.find(({ _id }) => player._id === _id))) {
+    if (makeGamePlayTargetsWithRelationsDto.some(({ player }) => !leftToCharmByPiedPiperPlayers.find(({ _id }) => true))) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_PIED_PIPER_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayPiedPiperTargets should throw error when one of the targeted player is not in the last to charm.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:213:173
     }
   }
 
-  public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.GUARD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.PROTECT) {
-      return;
-    }
-    const { canProtectTwice } = game.options.roles.guard;
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const lastGuardHistoryRecord = getLastGamePlayFromHistory(gameHistoryRecords, ROLE_NAMES.GUARD, GAME_PLAY_ACTIONS.PROTECT);
-    const lastProtectedPlayer = lastGuardHistoryRecord?.play.targets?.[0].player;
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id === targetedPlayer._id) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_GUARD_TARGET);
-    }
-  }
+  public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:216:56
   public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.GUARD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.PROTECT) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.GUARD || upcomingGamePlayAction === GAME_PLAY_ACTIONS.PROTECT) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayGuardTargets should do nothing when game play action is not PROTECT.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:216:9
   public validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== ROLE_NAMES.GUARD || upcomingGamePlayAction !== GAME_PLAY_ACTIONS.PROTECT) {
+    if (upcomingGamePlaySource !== ROLE_NAMES.GUARD && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.PROTECT) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayGuardTargets should do nothing when game play action is not PROTECT.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] LogicalOperator
providers/services/game-play/game-plays-validator.service.ts:224:36
     const lastGuardHistoryRecord = getLastGamePlayFromHistory(gameHistoryRecords, ROLE_NAMES.GUARD, GAME_PLAY_ACTIONS.PROTECT);
     const lastProtectedPlayer = lastGuardHistoryRecord?.play.targets?.[0].player;
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id === targetedPlayer._id) {
+    if (!targetedPlayer.isAlive || !canProtectTwice || lastProtectedPlayer?._id === targetedPlayer._id) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_GUARD_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlayGuardTargets should do nothing when targeted player is the same as previous guard play and game option allow this.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:224:105
     const lastGuardHistoryRecord = getLastGamePlayFromHistory(gameHistoryRecords, ROLE_NAMES.GUARD, GAME_PLAY_ACTIONS.PROTECT);
     const lastProtectedPlayer = lastGuardHistoryRecord?.play.targets?.[0].player;
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id === targetedPlayer._id) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_GUARD_TARGET);
-    }
+    if (!targetedPlayer.isAlive || !canProtectTwice && lastProtectedPlayer?._id === targetedPlayer._id) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayGuardTargets should throw error when targeted player is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:229:175
     }
   }
 
-  public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
-      ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
-      return;
-    }
-    this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
-    const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
-    const lastTieInVotesHistoryRecord = getLastGamePlayTieInVotesFromHistory(gameHistoryRecords);
-    const lastTieInVotesTargets = lastTieInVotesHistoryRecord?.play.targets ?? [];
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
-    }
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES && !lastTieInVotesTargets.find(({ player }) => player._id === targetedPlayer._id)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_SETTLE_VOTES_TARGET);
-    }
-  }
+  public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should throw error when targeted player is dead and upcoming action is DELEGATE.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:232:9
   public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
+    if (upcomingGamePlaySource === PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
       ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
       return;
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when game play source is not SHERIFF.
statusReason: Error: thrown: BadGamePlayPayloadException {
  "getResponse": [Function getResponse],
  "getStatus": [Function getStatus],
  "initCause": [Function initCause],
  "initMessage": [Function initMessage],
  "initName": [Function initName],
  "toString": [Function toString],
}

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:232:9
   public validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (upcomingGamePlaySource !== PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
-      ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
+    if (false) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when there is no upcoming gameplay.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:233:103
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     if (upcomingGamePlaySource !== PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
-      ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
-      return;
-    }
+      ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {}
     this.validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto, { min: 1, max: 1 });
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when there is no upcoming gameplay.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:233:7
     const upcomingGamePlaySource = getUpcomingGamePlaySource(game.upcomingPlays);
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
     if (upcomingGamePlaySource !== PLAYER_ATTRIBUTE_NAMES.SHERIFF || !upcomingGamePlayAction ||
-      ![GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
+      [GAME_PLAY_ACTIONS.DELEGATE, GAME_PLAY_ACTIONS.SETTLE_VOTES].includes(upcomingGamePlayAction)) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when game play action is not DELEGATE nor SETTLE_VOTES.
statusReason: Error: expect(received).not.toHaveBeenCalledOnce(expected)

Expected mock function to have been called any amount of times but one, but it was called exactly once.

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:240:9
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
     const lastTieInVotesHistoryRecord = getLastGamePlayTieInVotesFromHistory(gameHistoryRecords);
     const lastTieInVotesTargets = lastTieInVotesHistoryRecord?.play.targets ?? [];
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when targeted player for sheriff delegation is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:240:9
     const targetedPlayer = makeGamePlayTargetsWithRelationsDto[0].player;
     const lastTieInVotesHistoryRecord = getLastGamePlayTieInVotesFromHistory(gameHistoryRecords);
     const lastTieInVotesTargets = lastTieInVotesHistoryRecord?.play.targets ?? [];
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
+    if (true && !targetedPlayer.isAlive) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should throw error when targeted player is not in last tie in votes and upcoming action is SETTLE_VOTES.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Sheriff can't break the tie in votes with this target"
Received: "Sheriff can't delegate his role to this target"

Number of calls: 1

[Killed] ArrowFunction
providers/services/game-play/game-plays-validator.service.ts:243:98
     if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
     }
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES && !lastTieInVotesTargets.find(({ player }) => player._id === targetedPlayer._id)) {
+    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES && !lastTieInVotesTargets.find(() => undefined)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_SETTLE_VOTES_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when targeted player for sheriff settling votes is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:243:114
     if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.DELEGATE && !targetedPlayer.isAlive) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_DELEGATE_TARGET);
     }
-    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES && !lastTieInVotesTargets.find(({ player }) => player._id === targetedPlayer._id)) {
+    if (upcomingGamePlayAction === GAME_PLAY_ACTIONS.SETTLE_VOTES && !lastTieInVotesTargets.find(({ player }) => false)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.BAD_SHERIFF_SETTLE_VOTES_TARGET);
     }
killedBy: Game Plays Validator Service validateGamePlaySheriffTargets should do nothing when targeted player for sheriff settling votes is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:248:173
     }
   }
 
-  public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {
-    if (makeGamePlayTargetsWithRelationsDto.length < lengthBoundaries.min) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_LESS_TARGETS);
-    }
-    if (makeGamePlayTargetsWithRelationsDto.length > lengthBoundaries.max) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_TARGETS);
-    }
-  }
+  public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {}
 
   public validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
killedBy: Game Plays Validator Service validateGamePlayTargetsBoundaries should throw error when min boundary is not respected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:249:9
   }
 
   public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {
-    if (makeGamePlayTargetsWithRelationsDto.length < lengthBoundaries.min) {
+    if (makeGamePlayTargetsWithRelationsDto.length <= lengthBoundaries.min) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_LESS_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should do nothing when infected target data is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:249:9
   }
 
   public validateGamePlayTargetsBoundaries(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], lengthBoundaries: { min: number; max: number }): void {
-    if (makeGamePlayTargetsWithRelationsDto.length < lengthBoundaries.min) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_LESS_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should do nothing when infected target data is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:252:9
     if (makeGamePlayTargetsWithRelationsDto.length < lengthBoundaries.min) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_LESS_TARGETS);
     }
-    if (makeGamePlayTargetsWithRelationsDto.length > lengthBoundaries.max) {
+    if (makeGamePlayTargetsWithRelationsDto.length >= lengthBoundaries.max) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayInfectedTargets should do nothing when infected target data is valid.
statusReason: Error: expect(received).not.toThrow()

Error message: ""
