[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:252:9
     if (makeGamePlayTargetsWithRelationsDto.length < lengthBoundaries.min) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_LESS_TARGETS);
     }
-    if (makeGamePlayTargetsWithRelationsDto.length > lengthBoundaries.max) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.TOO_MUCH_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayTargetsBoundaries should throw error when max boundary is not respected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:257:172
     }
   }
 
-  public validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    this.validateGamePlaySheriffTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
-    this.validateGamePlayGuardTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
-    this.validateGamePlayPiedPiperTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayWildChildTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayRavenTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlaySeerTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayFoxTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayCupidTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayScapegoatTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayHunterTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayWerewolvesTargets(makeGamePlayTargetsWithRelationsDto, game);
-    this.validateGamePlayInfectedTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
-    this.validateGamePlayWitchTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
-  }
+  public validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[], game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public validateGamePlayTargetsWithRelationsDtoData(
killedBy: Game Plays Validator Service validateGamePlayRoleTargets should call targets validators when called.
statusReason: Error: expect(received).toHaveBeenCalledOnce(expected)

Expected mock function to have been called exactly once, but it was called:
  0 times

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:277:11
     makeGamePlayTargetsWithRelationsDto: MakeGamePlayTargetWithRelationsDto[] | undefined,
     game: Game,
     gameHistoryRecords: GameHistoryRecord[],
-  ): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction) {
-      return;
-    }
-    if (makeGamePlayTargetsWithRelationsDto === undefined || !makeGamePlayTargetsWithRelationsDto.length) {
-      if (requiredTargetsActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_TARGETS);
-      }
-      return;
-    }
-    if (![...requiredTargetsActions, ...optionalTargetsActions].includes(upcomingGamePlayAction)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_TARGETS);
-    }
-    this.validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
-  }
+  ): void {}
 
   public validateGamePlayVotesWithRelationsDtoData(makeGamePlayVotesWithRelationsDto: MakeGamePlayVoteWithRelationsDto[] | undefined, game: Game): void {
killedBy: Game Plays Validator Service validateGamePlayTargetsWithRelationsDtoData should throw error when there is no targets but they are required.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:282:62
     if (!upcomingGamePlayAction) {
       return;
     }
-    if (makeGamePlayTargetsWithRelationsDto === undefined || !makeGamePlayTargetsWithRelationsDto.length) {
+    if (makeGamePlayTargetsWithRelationsDto === undefined || makeGamePlayTargetsWithRelationsDto.length) {
       if (requiredTargetsActions.includes(upcomingGamePlayAction)) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_TARGETS);
killedBy: Game Plays Validator Service validateGamePlayTargetsWithRelationsDtoData should do nothing when there are no targets (empty array) and upcoming action doesn't require targets anyway.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:283:11
       return;
     }
     if (makeGamePlayTargetsWithRelationsDto === undefined || !makeGamePlayTargetsWithRelationsDto.length) {
-      if (requiredTargetsActions.includes(upcomingGamePlayAction)) {
+      if (true) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_TARGETS);
       }
killedBy: Game Plays Validator Service validateGamePlayTargetsWithRelationsDtoData should do nothing when there are no targets defined and upcoming action doesn't require targets anyway.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:283:68
       return;
     }
     if (makeGamePlayTargetsWithRelationsDto === undefined || !makeGamePlayTargetsWithRelationsDto.length) {
-      if (requiredTargetsActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_TARGETS);
-      }
+      if (requiredTargetsActions.includes(upcomingGamePlayAction)) {}
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayTargetsWithRelationsDtoData should throw error when there is no targets but they are required.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:288:9
       }
       return;
     }
-    if (![...requiredTargetsActions, ...optionalTargetsActions].includes(upcomingGamePlayAction)) {
+    if ([...requiredTargetsActions, ...optionalTargetsActions].includes(upcomingGamePlayAction)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_TARGETS);
     }
killedBy: Game Plays Validator Service validateGamePlayTargetsWithRelationsDtoData should throw error when there are targets but they are not expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:288:9
       }
       return;
     }
-    if (![...requiredTargetsActions, ...optionalTargetsActions].includes(upcomingGamePlayAction)) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_TARGETS);
     }

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:294:153
     this.validateGamePlayRoleTargets(makeGamePlayTargetsWithRelationsDto, game, gameHistoryRecords);
   }
 
-  public validateGamePlayVotesWithRelationsDtoData(makeGamePlayVotesWithRelationsDto: MakeGamePlayVoteWithRelationsDto[] | undefined, game: Game): void {
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction) {
-      return;
-    }
-    if (makeGamePlayVotesWithRelationsDto === undefined || !makeGamePlayVotesWithRelationsDto.length) {
-      if (requiredVotesActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_VOTES);
-      }
-      return;
-    }
-    if (!requiredVotesActions.includes(upcomingGamePlayAction)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_VOTES);
-    }
-    if (makeGamePlayVotesWithRelationsDto.some(({ source, target }) => source._id === target._id)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.SAME_SOURCE_AND_TARGET_VOTE);
-    }
-  }
+  public validateGamePlayVotesWithRelationsDtoData(makeGamePlayVotesWithRelationsDto: MakeGamePlayVoteWithRelationsDto[] | undefined, game: Game): void {}
 
   public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:299:60
     if (!upcomingGamePlayAction) {
       return;
     }
-    if (makeGamePlayVotesWithRelationsDto === undefined || !makeGamePlayVotesWithRelationsDto.length) {
+    if (makeGamePlayVotesWithRelationsDto === undefined || makeGamePlayVotesWithRelationsDto.length) {
       if (requiredVotesActions.includes(upcomingGamePlayAction)) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_VOTES);
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should do nothing when there are no votes (empty array) and upcoming action doesn't require votes anyway.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:300:66
       return;
     }
     if (makeGamePlayVotesWithRelationsDto === undefined || !makeGamePlayVotesWithRelationsDto.length) {
-      if (requiredVotesActions.includes(upcomingGamePlayAction)) {
-        throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_VOTES);
-      }
+      if (requiredVotesActions.includes(upcomingGamePlayAction)) {}
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there is no votes but they are required.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:300:11
       return;
     }
     if (makeGamePlayVotesWithRelationsDto === undefined || !makeGamePlayVotesWithRelationsDto.length) {
-      if (requiredVotesActions.includes(upcomingGamePlayAction)) {
+      if (false) {
         throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_VOTES);
       }
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there is no votes but they are required.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:305:9
       }
       return;
     }
-    if (!requiredVotesActions.includes(upcomingGamePlayAction)) {
+    if (requiredVotesActions.includes(upcomingGamePlayAction)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_VOTES);
     }
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there are votes but they are expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:305:65
       }
       return;
     }
-    if (!requiredVotesActions.includes(upcomingGamePlayAction)) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_VOTES);
-    }
+    if (!requiredVotesActions.includes(upcomingGamePlayAction)) {}
     if (makeGamePlayVotesWithRelationsDto.some(({ source, target }) => source._id === target._id)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.SAME_SOURCE_AND_TARGET_VOTE);
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there are votes but they are expected.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:308:9
     if (!requiredVotesActions.includes(upcomingGamePlayAction)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_VOTES);
     }
-    if (makeGamePlayVotesWithRelationsDto.some(({ source, target }) => source._id === target._id)) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.SAME_SOURCE_AND_TARGET_VOTE);
     }
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there are votes with the same source and target.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ArrowFunction
providers/services/game-play/game-plays-validator.service.ts:308:48
     if (!requiredVotesActions.includes(upcomingGamePlayAction)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_VOTES);
     }
-    if (makeGamePlayVotesWithRelationsDto.some(({ source, target }) => source._id === target._id)) {
+    if (makeGamePlayVotesWithRelationsDto.some(() => undefined)) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.SAME_SOURCE_AND_TARGET_VOTE);
     }
killedBy: Game Plays Validator Service validateGamePlayVotesWithRelationsDtoData should throw error when there are votes with the same source and target.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:313:135
     }
   }
 
-  public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
-    const { chosenSide } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (chosenSide && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_SIDE);
-    }
-    if (!chosenSide && upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_SIDE);
-    }
-  }
+  public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {}
 
   public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:316:23
   public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
     const { chosenSide } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (chosenSide && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
+    if (chosenSide && upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_SIDE);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenSideData should throw error when chosenSide is defined and game play action is not CHOOSE_SIDE.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:316:23
   public validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): void {
     const { chosenSide } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (chosenSide && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
+    if (chosenSide && true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_SIDE);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenSideData should do nothing when chosenSide is defined and game play action is CHOOSE_SIDE.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:319:9
     if (chosenSide && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_SIDE);
     }
-    if (!chosenSide && upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
+    if (true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_SIDE);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenSideData should do nothing when chosenSide is not defined and game play action is not CHOOSE_SIDE.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:319:24
     if (chosenSide && upcomingGamePlayAction !== GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_CHOSEN_SIDE);
     }
-    if (!chosenSide && upcomingGamePlayAction === GAME_PLAY_ACTIONS.CHOOSE_SIDE) {
+    if (!chosenSide && true) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.REQUIRED_CHOSEN_SIDE);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoChosenSideData should do nothing when chosenSide is not defined and game play action is not CHOOSE_SIDE.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:324:178
     }
   }
 
-  public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
-    const { doesJudgeRequestAnotherVote } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction || doesJudgeRequestAnotherVote === undefined) {
-      return;
-    }
-    const { voteRequestsCount } = game.options.roles.stutteringJudge;
-    const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
-    const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
-    if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
-        !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
-        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
-    }
-  }
+  public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {}
 
   public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:327:36
   public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const { doesJudgeRequestAnotherVote } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction || doesJudgeRequestAnotherVote === undefined) {
+    if (!upcomingGamePlayAction || doesJudgeRequestAnotherVote !== undefined) {
       return;
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should do nothing when doesJudgeRequestAnotherVote is undefined.
statusReason: Error: expect(received).not.toThrow()

Error message: ""

[Timeout] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:327:36
   public validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game, gameHistoryRecords: GameHistoryRecord[]): void {
     const { doesJudgeRequestAnotherVote } = makeGamePlayWithRelationsDto;
     const upcomingGamePlayAction = getUpcomingGamePlayAction(game.upcomingPlays);
-    if (!upcomingGamePlayAction || doesJudgeRequestAnotherVote === undefined) {
+    if (!upcomingGamePlayAction || false) {
       return;
     }

[Killed] ArrowFunction
providers/services/game-play/game-plays-validator.service.ts:331:70
       return;
     }
     const { voteRequestsCount } = game.options.roles.stutteringJudge;
-    const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
+    const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(() => undefined);
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
     if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but he has reach the request limit.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] MethodExpression
providers/services/game-play/game-plays-validator.service.ts:331:44
       return;
     }
     const { voteRequestsCount } = game.options.roles.stutteringJudge;
-    const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
+    const gameHistoryJudgeRequestRecords = gameHistoryRecords;
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
     if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:333:9
     const { voteRequestsCount } = game.options.roles.stutteringJudge;
     const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
-    if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
-        !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
-        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but upcoming action is not vote.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:333:9
     const { voteRequestsCount } = game.options.roles.stutteringJudge;
     const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
-    if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
-        !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
+    if (false ||
         gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but upcoming action is not vote.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BooleanLiteral
providers/services/game-play/game-plays-validator.service.ts:334:35
     const gameHistoryJudgeRequestRecords = gameHistoryRecords.filter(record => record.play.didJudgeRequestAnotherVote);
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
     if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
-        !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
+        !stutteringJudgePlayer || isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
         gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but he is dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:335:69
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
     if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
         !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
-        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
-    }
+        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {}
   }
 
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but upcoming action is not vote.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Killed] EqualityOperator
providers/services/game-play/game-plays-validator.service.ts:335:9
     const stutteringJudgePlayer = getPlayerWithCurrentRole(game.players, ROLE_NAMES.STUTTERING_JUDGE);
     if (!stutteringJudgeRequestOpportunityActions.includes(upcomingGamePlayAction) ||
         !stutteringJudgePlayer || !isPlayerAliveAndPowerful(stutteringJudgePlayer) ||
-        gameHistoryJudgeRequestRecords.length >= voteRequestsCount) {
+        gameHistoryJudgeRequestRecords.length < voteRequestsCount) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.UNEXPECTED_STUTTERING_JUDGE_VOTE_REQUEST);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoJudgeRequestData should throw error when judge request another vote but he has reach the request limit.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BadGamePlayPayloadException

Received function did not throw

[Timeout] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:340:140
     }
   }
 
-  public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {
-    const { votes, targets } = makeGamePlayWithRelationsDto;
-    const upcomingGamePlay = getUpcomingGamePlay(game.upcomingPlays);
-    if (!upcomingGamePlay) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.NO_UPCOMING_GAME_PLAY);
-    }
-    const gameHistoryRecords = await this.gameHistoryRecordService.getGameHistoryRecordsByGameId(game._id);
-    this.validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto, game, gameHistoryRecords);
-    this.validateGamePlayWithRelationsDtoChosenSideData(makeGamePlayWithRelationsDto, game);
-    this.validateGamePlayVotesWithRelationsDtoData(votes, game);
-    this.validateGamePlayTargetsWithRelationsDtoData(targets, game, gameHistoryRecords);
-    this.validateGamePlayWithRelationsDtoChosenCardData(makeGamePlayWithRelationsDto, game);
-  }
+  public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {}
 }
