[Killed] ConditionalExpression
providers/services/game-play/game-plays-validator.service.ts:343:9
   public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {
     const { votes, targets } = makeGamePlayWithRelationsDto;
     const upcomingGamePlay = getUpcomingGamePlay(game.upcomingPlays);
-    if (!upcomingGamePlay) {
+    if (false) {
       throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.NO_UPCOMING_GAME_PLAY);
     }
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoData should throw error when there is no upcoming game play action.
statusReason: Error: expect(received).toReject()

Expected promise to reject, however it resolved.

[Killed] BlockStatement
providers/services/game-play/game-plays-validator.service.ts:343:28
   public async validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto: MakeGamePlayWithRelationsDto, game: Game): Promise<void> {
     const { votes, targets } = makeGamePlayWithRelationsDto;
     const upcomingGamePlay = getUpcomingGamePlay(game.upcomingPlays);
-    if (!upcomingGamePlay) {
-      throw new BadGamePlayPayloadException(BAD_GAME_PLAY_PAYLOAD_REASONS.NO_UPCOMING_GAME_PLAY);
-    }
+    if (!upcomingGamePlay) {}
     const gameHistoryRecords = await this.gameHistoryRecordService.getGameHistoryRecordsByGameId(game._id);
     this.validateGamePlayWithRelationsDtoJudgeRequestData(makeGamePlayWithRelationsDto, game, gameHistoryRecords);
killedBy: Game Plays Validator Service validateGamePlayWithRelationsDtoData should throw error when there is no upcoming game play action.
statusReason: Error: expect(received).toReject()

Expected promise to reject, however it resolved.
