[Killed] EqualityOperator
game/providers/services/game-random-composition.service.ts:16:30
   public getRandomRolesForSide(availableRoles: Role[], rolesToPickCount: number, side: ROLE_SIDES): Role[] {
     const randomRoles: Role[] = [];
     const availableSidedRoles = getRolesWithSide(availableRoles, side);
-    const defaultSidedRole = side === ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
+    const defaultSidedRole = side !== ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
     let randomRolesToPickCount = 1;
     for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get only werewolves when side is werewolves and no roles are available.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:16:30
   public getRandomRolesForSide(availableRoles: Role[], rolesToPickCount: number, side: ROLE_SIDES): Role[] {
     const randomRoles: Role[] = [];
     const availableSidedRoles = getRolesWithSide(availableRoles, side);
-    const defaultSidedRole = side === ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
+    const defaultSidedRole = true ? defaultVillagerRole : defaultWerewolfRole;
     let randomRolesToPickCount = 1;
     for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get only werewolves when side is werewolves and no roles are available.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
game/providers/services/game-random-composition.service.ts:18:72
     const availableSidedRoles = getRolesWithSide(availableRoles, side);
     const defaultSidedRole = side === ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
     let randomRolesToPickCount = 1;
-    for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
-      const leftRolesToPickCount = rolesToPickCount - i;
-      const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
-      const randomRole = sample(leftRolesToPick);
-      if (randomRole === undefined) {
-        randomRolesToPickCount = 1;
-        randomRoles.push(defaultSidedRole);
-      } else {
-        randomRolesToPickCount = randomRole.minInGame ?? 1;
-        for (let j = 0; j < randomRolesToPickCount; j++) {
-          randomRole.maxInGame--;
-          randomRoles.push(randomRole);
-        }
-      }
-    }
+    for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {}
     return randomRoles;
   }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get only werewolves when side is werewolves and no roles are available.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 0
Received array:  []

[Killed] EqualityOperator
game/providers/services/game-random-composition.service.ts:18:21
     const availableSidedRoles = getRolesWithSide(availableRoles, side);
     const defaultSidedRole = side === ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
     let randomRolesToPickCount = 1;
-    for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
+    for (let i = 0; i <= rolesToPickCount; i += randomRolesToPickCount) {
       const leftRolesToPickCount = rolesToPickCount - i;
       const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get only werewolves when side is werewolves and no roles are available.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 11

[Timeout] ArithmeticOperator
game/providers/services/game-random-composition.service.ts:19:36
     const defaultSidedRole = side === ROLE_SIDES.VILLAGERS ? defaultVillagerRole : defaultWerewolfRole;
     let randomRolesToPickCount = 1;
     for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
-      const leftRolesToPickCount = rolesToPickCount - i;
+      const leftRolesToPickCount = rolesToPickCount + i;
       const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
       const randomRole = sample(leftRolesToPick);

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:20:85
     let randomRolesToPickCount = 1;
     for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
       const leftRolesToPickCount = rolesToPickCount - i;
-      const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
+      const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (true));
       const randomRole = sample(leftRolesToPick);
       if (randomRole === undefined) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should not get fox when minInGame is too high for left to pick.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 90
Received length: 100

[Killed] EqualityOperator
game/providers/services/game-random-composition.service.ts:20:117
     let randomRolesToPickCount = 1;
     for (let i = 0; i < rolesToPickCount; i += randomRolesToPickCount) {
       const leftRolesToPickCount = rolesToPickCount - i;
-      const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
+      const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame < leftRolesToPickCount));
       const randomRole = sample(leftRolesToPick);
       if (randomRole === undefined) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get three brothers when minInGame is exactly left to pick count.
statusReason: Error: expect(received).toIncludeAllMembers(expected)

Expected list to have all of the following members:
Received:
  [{"maxInGame": 99, "name": "villager", "side": "villagers", "type": "villager"}, {"maxInGame": 99, "name": "villager", "side": "villagers", "type": "villager"}, {"maxInGame": 99, "name": "villager", "side": "villagers", "type": "villager"}]

[Killed] BlockStatement
game/providers/services/game-random-composition.service.ts:22:37
       const leftRolesToPickCount = rolesToPickCount - i;
       const leftRolesToPick = availableSidedRoles.filter(role => role.maxInGame && (role.minInGame === undefined || role.minInGame <= leftRolesToPickCount));
       const randomRole = sample(leftRolesToPick);
-      if (randomRole === undefined) {
-        randomRolesToPickCount = 1;
-        randomRoles.push(defaultSidedRole);
-      } else {
+      if (randomRole === undefined) {} else {
         randomRolesToPickCount = randomRole.minInGame ?? 1;
         for (let j = 0; j < randomRolesToPickCount; j++) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get only werewolves when side is werewolves and no roles are available.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 0
Received array:  []

[Killed] BlockStatement
game/providers/services/game-random-composition.service.ts:25:14
       if (randomRole === undefined) {
         randomRolesToPickCount = 1;
         randomRoles.push(defaultSidedRole);
-      } else {
-        randomRolesToPickCount = randomRole.minInGame ?? 1;
-        for (let j = 0; j < randomRolesToPickCount; j++) {
-          randomRole.maxInGame--;
-          randomRoles.push(randomRole);
-        }
-      }
+      } else {}
     }
     return randomRoles;
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get seer, witch, pied piper, and all others are villagers when side is villagers and only seer an
statusReason: Error: expect(received).toIncludeAllMembers(expected)

Expected list to have all of the following members:
Received:
  []

[Killed] EqualityOperator
game/providers/services/game-random-composition.service.ts:27:25
         randomRoles.push(defaultSidedRole);
       } else {
         randomRolesToPickCount = randomRole.minInGame ?? 1;
-        for (let j = 0; j < randomRolesToPickCount; j++) {
+        for (let j = 0; j >= randomRolesToPickCount; j++) {
           randomRole.maxInGame--;
           randomRoles.push(randomRole);
killedBy: Game Controller GET /games/random-composition should get random composition when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
game/providers/services/game-random-composition.service.ts:27:58
         randomRoles.push(defaultSidedRole);
       } else {
         randomRolesToPickCount = randomRole.minInGame ?? 1;
-        for (let j = 0; j < randomRolesToPickCount; j++) {
-          randomRole.maxInGame--;
-          randomRoles.push(randomRole);
-        }
+        for (let j = 0; j < randomRolesToPickCount; j++) {}
       }
     }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get seer, witch, pied piper, and all others are villagers when side is villagers and only seer an
statusReason: Error: expect(received).toIncludeAllMembers(expected)

Expected list to have all of the following members:
Received:
  []

[Killed] UpdateOperator
game/providers/services/game-random-composition.service.ts:28:11
       } else {
         randomRolesToPickCount = randomRole.minInGame ?? 1;
         for (let j = 0; j < randomRolesToPickCount; j++) {
-          randomRole.maxInGame--;
+          randomRole.maxInGame++;
           randomRoles.push(randomRole);
         }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get seer, witch, pied piper, and all others are villagers when side is villagers and only seer an
statusReason: Error: expect(received).toIncludeAllMembers(expected)

Expected list to have all of the following members:
Received:

[Killed] ArithmeticOperator
game/providers/services/game-random-composition.service.ts:38:22
 
   public getWerewolfCountForComposition(playerCount: number): number {
     const werewolvesRatio = 6;
-    return Math.ceil(playerCount / werewolvesRatio);
+    return Math.ceil(playerCount * werewolvesRatio);
   }
 
killedBy: Game Random Composition Service getWerewolfCountForComposition should return 1 when called with 4 players.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 24

[Killed] BlockStatement
game/providers/services/game-random-composition.service.ts:49:33
       arePowerfulVillagerRolesPrioritized,
       arePowerfulWerewolfRolesPrioritized,
     } = getGameRandomCompositionDto;
-    return roles.filter(role => {
-      if (role.name === ROLE_NAMES.VILLAGER) {
-        return !arePowerfulVillagerRolesPrioritized;
-      } else if (role.name === ROLE_NAMES.WEREWOLF) {
-        return !arePowerfulWerewolfRolesPrioritized;
-      }
-      const isRolePermitted = !excludedRoles.includes(role.name);
-      const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
-      return isRolePermitted && isRoleMinInGameRespected;
-    });
+    return roles.filter(role => {});
   }
 
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should not include default villager role when powerful villager roles are prioritized.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
game/providers/services/game-random-composition.service.ts:50:46
       arePowerfulWerewolfRolesPrioritized,
     } = getGameRandomCompositionDto;
     return roles.filter(role => {
-      if (role.name === ROLE_NAMES.VILLAGER) {
-        return !arePowerfulVillagerRolesPrioritized;
-      } else if (role.name === ROLE_NAMES.WEREWOLF) {
+      if (role.name === ROLE_NAMES.VILLAGER) {} else if (role.name === ROLE_NAMES.WEREWOLF) {
         return !arePowerfulWerewolfRolesPrioritized;
       }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should include default villager role when powerful villager roles are not prioritized.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:50:11
       arePowerfulWerewolfRolesPrioritized,
     } = getGameRandomCompositionDto;
     return roles.filter(role => {
-      if (role.name === ROLE_NAMES.VILLAGER) {
+      if (false) {
         return !arePowerfulVillagerRolesPrioritized;
       } else if (role.name === ROLE_NAMES.WEREWOLF) {
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should include default villager role when powerful villager roles are not prioritized.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
game/providers/services/game-random-composition.service.ts:51:16
     } = getGameRandomCompositionDto;
     return roles.filter(role => {
       if (role.name === ROLE_NAMES.VILLAGER) {
-        return !arePowerfulVillagerRolesPrioritized;
+        return arePowerfulVillagerRolesPrioritized;
       } else if (role.name === ROLE_NAMES.WEREWOLF) {
         return !arePowerfulWerewolfRolesPrioritized;
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should not include default villager role when powerful villager roles are prioritized.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:52:18
     return roles.filter(role => {
       if (role.name === ROLE_NAMES.VILLAGER) {
         return !arePowerfulVillagerRolesPrioritized;
-      } else if (role.name === ROLE_NAMES.WEREWOLF) {
+      } else if (false) {
         return !arePowerfulWerewolfRolesPrioritized;
       }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should include default werewolf role when powerful werewolf roles are not prioritized.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
game/providers/services/game-random-composition.service.ts:52:53
     return roles.filter(role => {
       if (role.name === ROLE_NAMES.VILLAGER) {
         return !arePowerfulVillagerRolesPrioritized;
-      } else if (role.name === ROLE_NAMES.WEREWOLF) {
-        return !arePowerfulWerewolfRolesPrioritized;
-      }
+      } else if (role.name === ROLE_NAMES.WEREWOLF) {}
       const isRolePermitted = !excludedRoles.includes(role.name);
       const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should include default werewolf role when powerful werewolf roles are not prioritized.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
game/providers/services/game-random-composition.service.ts:53:16
       if (role.name === ROLE_NAMES.VILLAGER) {
         return !arePowerfulVillagerRolesPrioritized;
       } else if (role.name === ROLE_NAMES.WEREWOLF) {
-        return !arePowerfulWerewolfRolesPrioritized;
+        return arePowerfulWerewolfRolesPrioritized;
       }
       const isRolePermitted = !excludedRoles.includes(role.name);
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should not include default werewolf role when powerful werewolf roles are prioritized.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
game/providers/services/game-random-composition.service.ts:55:31
       } else if (role.name === ROLE_NAMES.WEREWOLF) {
         return !arePowerfulWerewolfRolesPrioritized;
       }
-      const isRolePermitted = !excludedRoles.includes(role.name);
+      const isRolePermitted = excludedRoles.includes(role.name);
       const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
       return isRolePermitted && isRoleMinInGameRespected;
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should not include some roles when there are excluded.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:56:40
         return !arePowerfulWerewolfRolesPrioritized;
       }
       const isRolePermitted = !excludedRoles.includes(role.name);
-      const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
+      const isRoleMinInGameRespected = false;
       return isRolePermitted && isRoleMinInGameRespected;
     });
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should include roles with recommended minimum of players when areRecommendedMinPlayersRespected is true when enough players.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 6
Received length: 1
Received array:  [{"maxInGame": 99, "minInGame": undefined, "name": "werewolf", "recommendedMinPlayers": undefined, "side": "werewolves", "type": "werewolf"}]

[Killed] EqualityOperator
game/providers/services/game-random-composition.service.ts:56:122
         return !arePowerfulWerewolfRolesPrioritized;
       }
       const isRolePermitted = !excludedRoles.includes(role.name);
-      const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
+      const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers > players.length;
       return isRolePermitted && isRoleMinInGameRespected;
     });
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should not include roles with recommended minimum of players when areRecommendedMinPlayersRespected is true and not enough pla
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
game/providers/services/game-random-composition.service.ts:57:14
       }
       const isRolePermitted = !excludedRoles.includes(role.name);
       const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
-      return isRolePermitted && isRoleMinInGameRespected;
+      return isRolePermitted || isRoleMinInGameRespected;
     });
   }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should not include some roles when there are excluded.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
game/providers/services/game-random-composition.service.ts:57:14
       }
       const isRolePermitted = !excludedRoles.includes(role.name);
       const isRoleMinInGameRespected = !areRecommendedMinPlayersRespected || role.recommendedMinPlayers === undefined || role.recommendedMinPlayers <= players.length;
-      return isRolePermitted && isRoleMinInGameRespected;
+      return false;
     });
   }
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition should include roles with recommended minimum of players when areRecommendedMinPlayersRespected is true when enough players.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 6
Received length: 1
Received array:  [{"maxInGame": 99, "minInGame": undefined, "name": "werewolf", "recommendedMinPlayers": undefined, "side": "werewolves", "type": "werewolf"}]

[Killed] ArithmeticOperator
game/providers/services/game-random-composition.service.ts:64:32
   public getGameRandomComposition(getGameRandomCompositionDto: GetGameRandomCompositionDto): GetGameRandomCompositionPlayerResponseDto[] {
     const availableRoles = plainToInstance(Role, this.getAvailableRolesForGameRandomComposition(getGameRandomCompositionDto));
     const werewolfRolesCount = this.getWerewolfCountForComposition(getGameRandomCompositionDto.players.length);
-    const villagerRolesCount = getGameRandomCompositionDto.players.length - werewolfRolesCount;
+    const villagerRolesCount = getGameRandomCompositionDto.players.length + werewolfRolesCount;
     const randomRoles = [
       ...this.getRandomRolesForSide(availableRoles, werewolfRolesCount, ROLE_SIDES.WEREWOLVES),
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getGameRandomComposition should return random composition when called [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
