[Killed] ObjectLiteral
game/providers/services/game.service.ts:31:52
   }
 
   public async getGameById(id: string): Promise<Game> {
-    const game = await this.gameRepository.findOne({ _id: id });
+    const game = await this.gameRepository.findOne({});
     if (game === null) {
       throw new ResourceNotFoundException(API_RESOURCES.GAMES, id);
killedBy: Game Service getGameById should return a game when called with existing id.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Received: undefined

[Killed] ObjectLiteral
game/providers/services/game.service.ts:39:57
   }
 
   public async createGame(game: CreateGameDto): Promise<Game> {
-    const gameToCreate = plainToInstance(CreateGameDto, {
-      ...game,
-      upcomingPlays: this.gamePlaysManagerService.getUpcomingNightPlays(game),
-    });
+    const gameToCreate = plainToInstance(CreateGameDto, {});
     return this.gameRepository.create(gameToCreate);
   }
killedBy: Game Controller POST /games should create game when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 124
+ Received  +   2

@@ -71,134 +71,12 @@
          "isTransformationRevealed": false,
        },

[Killed] ObjectLiteral
game/providers/services/game.service.ts:47:52
   }
 
   public async getGameAndCheckPlayingStatus(gameId: Types.ObjectId): Promise<Game> {
-    const game = await this.gameRepository.findOne({ _id: gameId });
+    const game = await this.gameRepository.findOne({});
     if (game === null) {
       throw new ResourceNotFoundException(API_RESOURCES.GAMES, gameId.toString());
killedBy: Game Service getGameAndCheckPlayingStatus should throw an error when called with unknown id.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "games", "85e3cabdfbdd79cf3941c5ab"

Number of calls: 0

[Killed] EqualityOperator
game/providers/services/game.service.ts:50:16
     const game = await this.gameRepository.findOne({ _id: gameId });
     if (game === null) {
       throw new ResourceNotFoundException(API_RESOURCES.GAMES, gameId.toString());
-    } else if (game.status !== GAME_STATUSES.PLAYING) {
+    } else if (game.status === GAME_STATUSES.PLAYING) {
       throw new BadResourceMutationException(API_RESOURCES.GAMES, game._id.toString(), BAD_RESOURCE_MUTATION_REASONS.GAME_NOT_PLAYING);
     }
killedBy: Game Controller DELETE /game/:id should get a bad request error when game doesn't have playing status.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
game/providers/services/game.service.ts:50:55
     const game = await this.gameRepository.findOne({ _id: gameId });
     if (game === null) {
       throw new ResourceNotFoundException(API_RESOURCES.GAMES, gameId.toString());
-    } else if (game.status !== GAME_STATUSES.PLAYING) {
-      throw new BadResourceMutationException(API_RESOURCES.GAMES, game._id.toString(), BAD_RESOURCE_MUTATION_REASONS.GAME_NOT_PLAYING);
-    }
+    } else if (game.status !== GAME_STATUSES.PLAYING) {}
     return game;
   }
killedBy: Game Controller DELETE /game/:id should get a bad request error when game doesn't have playing status.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
game/providers/services/game.service.ts:58:61
 
   public async cancelGameById(gameId: Types.ObjectId): Promise<Game> {
     await this.getGameAndCheckPlayingStatus(gameId);
-    const updatedGame = await this.gameRepository.updateOne({ _id: gameId }, { status: GAME_STATUSES.CANCELED });
+    const updatedGame = await this.gameRepository.updateOne({}, { status: GAME_STATUSES.CANCELED });
     if (updatedGame === null) {
       throw new ResourceNotFoundException(API_RESOURCES.GAMES, gameId.toString());
killedBy: Game Service cancelGameById should call update method from repository when game can be canceled.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "_id": "f903e787f81cccdcc3f8fb8b",
- }

[Killed] ObjectLiteral
game/providers/services/game.service.ts:58:78
 
   public async cancelGameById(gameId: Types.ObjectId): Promise<Game> {
     await this.getGameAndCheckPlayingStatus(gameId);
-    const updatedGame = await this.gameRepository.updateOne({ _id: gameId }, { status: GAME_STATUSES.CANCELED });
+    const updatedGame = await this.gameRepository.updateOne({ _id: gameId }, {});
     if (updatedGame === null) {
       throw new ResourceNotFoundException(API_RESOURCES.GAMES, gameId.toString());
killedBy: Game Controller DELETE /game/:id should update game status to canceled when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -72,11 +72,11 @@
        },
      },

[Killed] ConditionalExpression
game/providers/services/game.service.ts:70:9
     const gameDataToUpdate: Partial<Game> = {};
     const makeGamePlayWithRelationsDto = createMakeGamePlayDtoWithRelations(makeGamePlayDto, game);
     await this.gamePlaysValidatorService.validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto, game);
-    if (isGameOver(game)) {
+    if (false) {
       gameDataToUpdate.status = GAME_STATUSES.OVER;
       gameDataToUpdate.victory = generateGameVictoryData(game);
killedBy: Game Service makeGamePlay should set game as over when the game is done.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"_id": "88eb9ad638bcf0ce5d2c7fbf"},
- Object {
-   "status": "over",

[Killed] ConditionalExpression
game/providers/services/game.service.ts:70:9
     const gameDataToUpdate: Partial<Game> = {};
     const makeGamePlayWithRelationsDto = createMakeGamePlayDtoWithRelations(makeGamePlayDto, game);
     await this.gamePlaysValidatorService.validateGamePlayWithRelationsDtoData(makeGamePlayWithRelationsDto, game);
-    if (isGameOver(game)) {
+    if (true) {
       gameDataToUpdate.status = GAME_STATUSES.OVER;
       gameDataToUpdate.victory = generateGameVictoryData(game);
killedBy: Game Controller POST /game/:id/play should make a game play when called with votes.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -137,11 +137,11 @@
          "current": "werewolves",
          "original": "werewolves",
