[NoCoverage] BooleanLiteral
providers/services/player/player-killer.service.ts:18:12
 @Injectable()
 export class PlayerKillerService {
   public isAncientKillable(ancientPlayer: Player): boolean {
-    return true;
+    return false;
   }
 

[Killed] LogicalOperator
providers/services/player/player-killer.service.ts:23:12
 
   public isIdiotKillable(idiotPlayer: Player, cause: PLAYER_DEATH_CAUSES): boolean {
     const isIdiotPowerless = doesPlayerHaveAttribute(idiotPlayer, PLAYER_ATTRIBUTE_NAMES.POWERLESS);
-    return idiotPlayer.role.isRevealed || cause !== PLAYER_DEATH_CAUSES.VOTE || isIdiotPowerless;
+    return (idiotPlayer.role.isRevealed || cause !== PLAYER_DEATH_CAUSES.VOTE) && isIdiotPowerless;
   }
 
killedBy: Player Killer Service isIdiotKillable should return true when idiot is already revealed.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
providers/services/player/player-killer.service.ts:23:12
 
   public isIdiotKillable(idiotPlayer: Player, cause: PLAYER_DEATH_CAUSES): boolean {
     const isIdiotPowerless = doesPlayerHaveAttribute(idiotPlayer, PLAYER_ATTRIBUTE_NAMES.POWERLESS);
-    return idiotPlayer.role.isRevealed || cause !== PLAYER_DEATH_CAUSES.VOTE || isIdiotPowerless;
+    return idiotPlayer.role.isRevealed && cause !== PLAYER_DEATH_CAUSES.VOTE || isIdiotPowerless;
   }
 
killedBy: Player Killer Service isIdiotKillable should return true when idiot is already revealed.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
providers/services/player/player-killer.service.ts:30:12
     const { isProtectedByGuard: isLittleGirlProtectedByGuard } = game.options.roles.littleGirl;
     const isPlayerSavedByWitch = doesPlayerHaveAttribute(eatenPlayer, PLAYER_ATTRIBUTE_NAMES.DRANK_LIFE_POTION);
     const isPlayerProtectedByGuard = doesPlayerHaveAttribute(eatenPlayer, PLAYER_ATTRIBUTE_NAMES.PROTECTED);
-    return !isPlayerSavedByWitch && (!isPlayerProtectedByGuard || eatenPlayer.role.current === ROLE_NAMES.LITTLE_GIRL && !isLittleGirlProtectedByGuard);
+    return true;
   }
 
killedBy: Player Killer Service canPlayerBeEaten should return false when player is saved by the witch.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
providers/services/player/player-killer.service.ts:30:67
     const { isProtectedByGuard: isLittleGirlProtectedByGuard } = game.options.roles.littleGirl;
     const isPlayerSavedByWitch = doesPlayerHaveAttribute(eatenPlayer, PLAYER_ATTRIBUTE_NAMES.DRANK_LIFE_POTION);
     const isPlayerProtectedByGuard = doesPlayerHaveAttribute(eatenPlayer, PLAYER_ATTRIBUTE_NAMES.PROTECTED);
-    return !isPlayerSavedByWitch && (!isPlayerProtectedByGuard || eatenPlayer.role.current === ROLE_NAMES.LITTLE_GIRL && !isLittleGirlProtectedByGuard);
+    return !isPlayerSavedByWitch && (!isPlayerProtectedByGuard || eatenPlayer.role.current === ROLE_NAMES.LITTLE_GIRL || !isLittleGirlProtectedByGuard);
   }
 
killedBy: Player Killer Service canPlayerBeEaten should return false when player is protected by guard, is little girl but game options allows guard to protect her.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
providers/services/player/player-killer.service.ts:34:86
   }
 
   public isPlayerKillable(player: Player, game: Game, cause: PLAYER_DEATH_CAUSES): boolean {
-    if (cause === PLAYER_DEATH_CAUSES.EATEN && !this.canPlayerBeEaten(player, game)) {
-      return false;
-    }
+    if (cause === PLAYER_DEATH_CAUSES.EATEN && !this.canPlayerBeEaten(player, game)) {}
     if (player.role.current === ROLE_NAMES.IDIOT) {
       return this.isIdiotKillable(player, cause);
killedBy: Player Killer Service isPlayerKillable should return false when cause is EATEN and player can't be eaten.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
providers/services/player/player-killer.service.ts:34:9
   }
 
   public isPlayerKillable(player: Player, game: Game, cause: PLAYER_DEATH_CAUSES): boolean {
-    if (cause === PLAYER_DEATH_CAUSES.EATEN && !this.canPlayerBeEaten(player, game)) {
+    if (true) {
       return false;
     }
killedBy: Player Killer Service isPlayerKillable should call is idiot killable when player is an idiot.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "34e971ddabd432cdfe1bc025", "attributes": [], "death": undefined, "isAlive": true, "name": "Emmitt", "position": 4070499577495552, "role": {"current": "idiot", "isRevealed": false, "original": "idiot"}, "side": {"current": "villagers", "original": "villagers"}}, "vote"

Number of calls: 0

[Killed] BooleanLiteral
providers/services/player/player-killer.service.ts:35:14
 
   public isPlayerKillable(player: Player, game: Game, cause: PLAYER_DEATH_CAUSES): boolean {
     if (cause === PLAYER_DEATH_CAUSES.EATEN && !this.canPlayerBeEaten(player, game)) {
-      return false;
+      return true;
     }
     if (player.role.current === ROLE_NAMES.IDIOT) {
killedBy: Player Killer Service isPlayerKillable should return false when cause is EATEN and player can't be eaten.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
providers/services/player/player-killer.service.ts:37:51
     if (cause === PLAYER_DEATH_CAUSES.EATEN && !this.canPlayerBeEaten(player, game)) {
       return false;
     }
-    if (player.role.current === ROLE_NAMES.IDIOT) {
-      return this.isIdiotKillable(player, cause);
-    }
+    if (player.role.current === ROLE_NAMES.IDIOT) {}
     if (player.role.current === ROLE_NAMES.ANCIENT) {
       return this.isAncientKillable(player);
killedBy: Player Killer Service isPlayerKillable should call is idiot killable when player is an idiot.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "b3231df9880da1be84ec7c02", "attributes": [], "death": undefined, "isAlive": true, "name": "Hazle", "position": 5864608980008960, "role": {"current": "idiot", "isRevealed": false, "original": "idiot"}, "side": {"current": "villagers", "original": "villagers"}}, "vote"

Number of calls: 0

[Killed] ConditionalExpression
providers/services/player/player-killer.service.ts:37:9
     if (cause === PLAYER_DEATH_CAUSES.EATEN && !this.canPlayerBeEaten(player, game)) {
       return false;
     }
-    if (player.role.current === ROLE_NAMES.IDIOT) {
+    if (false) {
       return this.isIdiotKillable(player, cause);
     }
killedBy: Player Killer Service isPlayerKillable should call is idiot killable when player is an idiot.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "d1faee8cbf97ecdd992acca3", "attributes": [], "death": undefined, "isAlive": true, "name": "Donavon", "position": 7444878441054208, "role": {"current": "idiot", "isRevealed": false, "original": "idiot"}, "side": {"current": "villagers", "original": "villagers"}}, "vote"

Number of calls: 0

[Killed] ConditionalExpression
providers/services/player/player-killer.service.ts:40:9
     if (player.role.current === ROLE_NAMES.IDIOT) {
       return this.isIdiotKillable(player, cause);
     }
-    if (player.role.current === ROLE_NAMES.ANCIENT) {
+    if (false) {
       return this.isAncientKillable(player);
     }
killedBy: Player Killer Service isPlayerKillable should call is ancient killable when player is an ancient.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "3e9bdbf56ae1fa1f09c4eef8", "attributes": [], "death": undefined, "isAlive": true, "name": "Ian", "position": 4983760911073280, "role": {"current": "ancient", "isRevealed": false, "original": "ancient"}, "side": {"current": "villagers", "original": "villagers"}}

Number of calls: 0

[Killed] EqualityOperator
providers/services/player/player-killer.service.ts:40:9
     if (player.role.current === ROLE_NAMES.IDIOT) {
       return this.isIdiotKillable(player, cause);
     }
-    if (player.role.current === ROLE_NAMES.ANCIENT) {
+    if (player.role.current !== ROLE_NAMES.ANCIENT) {
       return this.isAncientKillable(player);
     }
killedBy: Player Killer Service isPlayerKillable should call is ancient killable when player is an ancient.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "9f2da1cb8bef8dc1bda1f43b", "attributes": [], "death": undefined, "isAlive": true, "name": "Bernardo", "position": 8404433557782528, "role": {"current": "ancient", "isRevealed": false, "original": "ancient"}, "side": {"current": "villagers", "original": "villagers"}}

Number of calls: 0

[Killed] ObjectLiteral
providers/services/player/player-killer.service.ts:49:55
   public getPlayerToKillInGame(playerId: Types.ObjectId, game: Game): Player {
     const playerToKill = getPlayerWithId(game.players, playerId);
     if (!playerToKill) {
-      const interpolations: ExceptionInterpolations = { gameId: game._id.toString(), playerId: playerId.toString() };
+      const interpolations: ExceptionInterpolations = {};
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.KILL_PLAYER, UNEXPECTED_EXCEPTION_REASONS.CANT_FIND_PLAYER_WITH_ID_IN_GAME, interpolations);
     }
killedBy: Player Killer Service getPlayerToKillInGame should throw error when player is not found.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Kill player",
  "Can't find player with id \"{{playerId}}\" in game \"{{gameId}}\"",
- Object {

[Killed] BooleanLiteral
providers/services/player/player-killer.service.ts:52:9
       const interpolations: ExceptionInterpolations = { gameId: game._id.toString(), playerId: playerId.toString() };
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.KILL_PLAYER, UNEXPECTED_EXCEPTION_REASONS.CANT_FIND_PLAYER_WITH_ID_IN_GAME, interpolations);
     }
-    if (!playerToKill.isAlive) {
+    if (playerToKill.isAlive) {
       const interpolations: ExceptionInterpolations = { playerId: playerId.toString() };
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.KILL_PLAYER, UNEXPECTED_EXCEPTION_REASONS.PLAYER_IS_DEAD, interpolations);
killedBy: Player Killer Service getPlayerToKillInGame should throw error when player is already dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UnexpectedException

Received function did not throw

[Killed] BlockStatement
providers/services/player/player-killer.service.ts:52:32
       const interpolations: ExceptionInterpolations = { gameId: game._id.toString(), playerId: playerId.toString() };
       throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.KILL_PLAYER, UNEXPECTED_EXCEPTION_REASONS.CANT_FIND_PLAYER_WITH_ID_IN_GAME, interpolations);
     }
-    if (!playerToKill.isAlive) {
-      const interpolations: ExceptionInterpolations = { playerId: playerId.toString() };
-      throw new UnexpectedException(UNEXPECTED_EXCEPTION_SCOPES.KILL_PLAYER, UNEXPECTED_EXCEPTION_REASONS.PLAYER_IS_DEAD, interpolations);
-    }
+    if (!playerToKill.isAlive) {}
     return playerToKill;
   }
killedBy: Player Killer Service getPlayerToKillInGame should throw error when player is already dead.
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UnexpectedException

Received function did not throw
