[Killed] StringLiteral
modules/health/controllers/health.controller.ts:22:98
   })
   @HealthCheck()
   public async check(): Promise<HealthCheckResult> {
-    return this.health.check([async(): Promise<HealthIndicatorResult> => this.mongoose.pingCheck("mongoose")]);
+    return this.health.check([async(): Promise<HealthIndicatorResult> => this.mongoose.pingCheck("")]);
   }
 }
killedBy: Health Controller GET /health should return app health when route is called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "details": Object {
-     "mongoose": Object {
