[Killed] ConditionalExpression
modules/role/helpers/role.helper.ts:6:31
 import type { Role } from "../types/role.type";
 
 function getRolesWithSide(roles: Role[], side: ROLE_SIDES): Role[] {
-  return roles.filter(role => role.side === side);
+  return roles.filter(role => true);
 }
 
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getGameRandomComposition should return random composition when called [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
modules/role/helpers/role.helper.ts:6:23
 import type { Role } from "../types/role.type";
 
 function getRolesWithSide(roles: Role[], side: ROLE_SIDES): Role[] {
-  return roles.filter(role => role.side === side);
+  return roles.filter(() => undefined);
 }
 
killedBy: Game Random Composition Service getAvailableRolesForGameRandomComposition getRandomRolesForSide should get seer, witch, pied piper, and all others are villagers when side is villagers and only seer an
statusReason: Error: expect(received).toIncludeAllMembers(expected)

Expected list to have all of the following members:
Received:
