[Killed] ObjectLiteral
src/server/helpers/server.helper.ts:5:39
 import { parse } from "qs";
 
 function queryStringParser(query: string): Record<string, unknown> {
-  const parseOptions: IParseOptions = {
-    arrayLimit: 100,
-    parameterLimit: 3000,
-  };
+  const parseOptions: IParseOptions = {};
   return parse(query, parseOptions);
 }
killedBy: Server Helper queryStringParser should call qs parse method with specific options when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "test",
- Object {
-   "arrayLimit": 100,
