[Killed] StringLiteral
src/server/server.ts:17:13
   createSwaggerDocument(documentationPath, app);
   app.useStaticAssets({
     root: `${process.cwd()}/public`,
-    prefix: "/public/",
+    prefix: "",
   });
   await app.listen(port, "127.0.0.1");
killedBy: Server bootstrap should serve public directory when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "prefix": "/public/",
+   "prefix": "",

[Killed] StringLiteral
src/server/server.ts:21:50
   });
   await app.listen(port, "127.0.0.1");
   const appUrl = await app.getUrl();
-  Logger.log(`🐺 App is available at ${appUrl}`, "NestApplication");
+  Logger.log(`🐺 App is available at ${appUrl}`, """;
   Logger.log(`📖 API Documentation is available at ${appUrl}/${documentationPath}`, "NestApplication");
   return app;
killedBy: Server bootstrap should print server and docs address with specific port when port is provided.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "🐺 App is available at http://127.0.0.1:4500", "NestApplication"
Received
       1: "🐺 App is available at http://127.0.0.1:4500", ""
       2: "📖 API Documentation is available at http://127.0.0.1:4500/docs", "NestApplication"

Number of calls: 2

[Killed] StringLiteral
src/server/server.ts:22:85
   await app.listen(port, "127.0.0.1");
   const appUrl = await app.getUrl();
   Logger.log(`🐺 App is available at ${appUrl}`, "NestApplication");
-  Logger.log(`📖 API Documentation is available at ${appUrl}/${documentationPath}`, "NestApplication");
+  Logger.log(`📖 API Documentation is available at ${appUrl}/${documentationPath}`, """;
   return app;
 }
killedBy: Server bootstrap should print server and docs address with specific port when port is provided.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "📖 API Documentation is available at http://127.0.0.1:4500/docs", "NestApplication"
Received
       1: "🐺 App is available at http://127.0.0.1:4500", "NestApplication"
       2: "📖 API Documentation is available at http://127.0.0.1:4500/docs", ""

Number of calls: 2

[Killed] StringLiteral
src/server/server.ts:22:14
   await app.listen(port, "127.0.0.1");
   const appUrl = await app.getUrl();
   Logger.log(`🐺 App is available at ${appUrl}`, "NestApplication");
-  Logger.log(`📖 API Documentation is available at ${appUrl}/${documentationPath}`, "NestApplication");
+  Logger.log(`` "NestApplication");
   return app;
 }
killedBy: Server bootstrap should print server and docs address with specific port when port is provided.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "📖 API Documentation is available at http://127.0.0.1:4500/docs", "NestApplication"
Received
       1: "🐺 App is available at http://127.0.0.1:4500", "NestApplication"
       2: "", "NestApplication"

Number of calls: 2
