[Killed] BlockStatement
src/server/swagger/swagger.ts:5:75
 import type { SwaggerCustomOptions } from "@nestjs/swagger";
 import { DocumentBuilder, SwaggerModule } from "@nestjs/swagger";
 
-function createSwaggerDocument(path: string, app: INestApplication): void {
-  const title = "Werewolves Assistant API Reference 🐺";
-  const version = process.env.npm_package_version ?? "?";
-  const config = new DocumentBuilder()
-    .setTitle(title)
-    .setDescription("Werewolves Assistant API provides over HTTP requests a way of manage Werewolves games to help the game master.")
-    .setVersion(version)
-    .build();
-  const document = SwaggerModule.createDocument(app, config);
-  const options: SwaggerCustomOptions = {
-    customSiteTitle: title,
-    customfavIcon: "public/assets/images/logo/square/werewolves-logo-small.png",
-    customCssUrl: "public/assets/css/custom-swagger.css",
-  };
-  SwaggerModule.setup(path, app, document, options);
-}
+function createSwaggerDocument(path: string, app: INestApplication): void {}
 
 export { createSwaggerDocument };
killedBy: Server Swagger createSwaggerDocument should call document builder methods when function is called with known version.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Werewolves Assistant API Reference 🐺"

Number of calls: 0

[Killed] StringLiteral
src/server/swagger/swagger.ts:6:17
 import { DocumentBuilder, SwaggerModule } from "@nestjs/swagger";
 
 function createSwaggerDocument(path: string, app: INestApplication): void {
-  const title = "Werewolves Assistant API Reference 🐺";
+  const title = ""
   const version = process.env.npm_package_version ?? "?";
   const config = new DocumentBuilder()
killedBy: Server Swagger createSwaggerDocument should call document builder methods when function is called with known version.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Werewolves Assistant API Reference 🐺"
Received: ""

Number of calls: 1

[Killed] StringLiteral
src/server/swagger/swagger.ts:10:21
   const version = process.env.npm_package_version ?? "?";
   const config = new DocumentBuilder()
     .setTitle(title)
-    .setDescription("Werewolves Assistant API provides over HTTP requests a way of manage Werewolves games to help the game master.")
+    .setDescription("")
     .setVersion(version)
     .build();
killedBy: Server Swagger createSwaggerDocument should call document builder methods when function is called with known version.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Werewolves Assistant API provides over HTTP requests a way of manage Werewolves games to help the game master."
Received: ""

Number of calls: 1

[Killed] StringLiteral
src/server/swagger/swagger.ts:16:20
   const document = SwaggerModule.createDocument(app, config);
   const options: SwaggerCustomOptions = {
     customSiteTitle: title,
-    customfavIcon: "public/assets/images/logo/square/werewolves-logo-small.png",
+    customfavIcon: "",
     customCssUrl: "public/assets/css/custom-swagger.css",
   };
killedBy: Server Swagger createSwaggerDocument should call createDocument and setup functions when function is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "docs",
  {},
  undefined,

[Killed] StringLiteral
src/server/swagger/swagger.ts:17:19
   const options: SwaggerCustomOptions = {
     customSiteTitle: title,
     customfavIcon: "public/assets/images/logo/square/werewolves-logo-small.png",
-    customCssUrl: "public/assets/css/custom-swagger.css",
+    customCssUrl: "",
   };
   SwaggerModule.setup(path, app, document, options);
killedBy: Server Swagger createSwaggerDocument should call createDocument and setup functions when function is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "docs",
  {},
  undefined,
