[Killed] StringLiteral
shared/api/helpers/api.helper.ts:6:30
 function getResourceSingularForm(resource: API_RESOURCES): string {
   const resourceSingularForms: Record<API_RESOURCES, string> = {
     [API_RESOURCES.GAMES]: "game",
-    [API_RESOURCES.PLAYERS]: "player",
+    [API_RESOURCES.PLAYERS]: "",
     [API_RESOURCES.GAME_ADDITIONAL_CARDS]: "additional card",
     [API_RESOURCES.ROLES]: "role",
killedBy: API Helper getResourceSingularForm should return player when called with players [#1].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "player"
Received: ""

[Killed] StringLiteral
shared/api/helpers/api.helper.ts:7:44
   const resourceSingularForms: Record<API_RESOURCES, string> = {
     [API_RESOURCES.GAMES]: "game",
     [API_RESOURCES.PLAYERS]: "player",
-    [API_RESOURCES.GAME_ADDITIONAL_CARDS]: "additional card",
+    [API_RESOURCES.GAME_ADDITIONAL_CARDS]: "",
     [API_RESOURCES.ROLES]: "role",
     [API_RESOURCES.HEALTH]: "health",
killedBy: API Helper getResourceSingularForm should return additional card when called with game-additional-cards [#2].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "additional card"
Received: ""

[Timeout] StringLiteral
shared/api/helpers/api.helper.ts:9:29
     [API_RESOURCES.PLAYERS]: "player",
     [API_RESOURCES.GAME_ADDITIONAL_CARDS]: "additional card",
     [API_RESOURCES.ROLES]: "role",
-    [API_RESOURCES.HEALTH]: "health",
+    [API_RESOURCES.HEALTH]: "",
   };
   return resourceSingularForms[resource];
