[Killed] ConditionalExpression
shared/api/pipes/validate-mongo-id.pipe.ts:8:9
 @Injectable()
 class ValidateMongoId implements PipeTransform<string> {
   public transform(value: string): Types.ObjectId {
-    if (Types.ObjectId.isValid(value)) {
+    if (true) {
       return new Types.ObjectId(value);
     }
killedBy: Game Controller GET /game/:id should get a bad request error when id is not mongoId.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
shared/api/pipes/validate-mongo-id.pipe.ts:8:40
 @Injectable()
 class ValidateMongoId implements PipeTransform<string> {
   public transform(value: string): Types.ObjectId {
-    if (Types.ObjectId.isValid(value)) {
-      return new Types.ObjectId(value);
-    }
+    if (Types.ObjectId.isValid(value)) {}
     throw new BadRequestException("Validation failed (Mongo ObjectId is expected)");
   }
killedBy: Validate MongoId Pipe transform should return the value as ObjectId when value is a correct MongoId.
statusReason: BadRequestException: Validation failed (Mongo ObjectId is expected)

[Killed] StringLiteral
shared/api/pipes/validate-mongo-id.pipe.ts:11:35
     if (Types.ObjectId.isValid(value)) {
       return new Types.ObjectId(value);
     }
-    throw new BadRequestException("Validation failed (Mongo ObjectId is expected)");
+    throw new BadRequestException("");
   }
 }
killedBy: Game Controller GET /game/:id should get a bad request error when id is not mongoId.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Validation failed (Mongo ObjectId is expected)"
Received: "Bad Request"
