[Timeout] StringLiteral
shared/exception/types/resource-not-found-exception.type.ts:10:21
 class ResourceNotFoundException extends NotFoundException {
   public constructor(resource: API_RESOURCES, id: string, reason?: RESOURCE_NOT_FOUND_REASONS) {
     const resourceSingularForm = getResourceSingularForm(resource);
-    const message = `${upperFirst(resourceSingularForm)} with id "${id}" not found`;
+    const message = ``;
     super(message, { description: reason });
   }

[Timeout] ObjectLiteral
shared/exception/types/resource-not-found-exception.type.ts:11:20
   public constructor(resource: API_RESOURCES, id: string, reason?: RESOURCE_NOT_FOUND_REASONS) {
     const resourceSingularForm = getResourceSingularForm(resource);
     const message = `${upperFirst(resourceSingularForm)} with id "${id}" not found`;
-    super(message, { description: reason });
+    super(message, {});
   }
 }
