[Killed] LogicalOperator
shared/validation/helpers/validation.helper.ts:5:10
 
 function doesArrayRespectBounds(array: unknown[], bounds: { minItems?: number; maxItems?: number }): boolean {
   const { minItems, maxItems } = bounds;
-  return (minItems === undefined || arrayMinSize(array, minItems)) && (maxItems === undefined || arrayMaxSize(array, maxItems));
+  return minItems === undefined || arrayMinSize(array, minItems) || maxItems === undefined || arrayMaxSize(array, maxItems);
 }
 
killedBy: Validation Helper doesArrayRespectBounds should return false when min bound is not respected.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
shared/validation/helpers/validation.helper.ts:5:10
 
 function doesArrayRespectBounds(array: unknown[], bounds: { minItems?: number; maxItems?: number }): boolean {
   const { minItems, maxItems } = bounds;
-  return (minItems === undefined || arrayMinSize(array, minItems)) && (maxItems === undefined || arrayMaxSize(array, maxItems));
+  return false;
 }
 
killedBy: Validation Helper doesArrayRespectBounds should return true when no bounds are provided.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
