[Killed] BlockStatement
shared/validation/transformers/validation.transformer.ts:4:25
 import type { TransformFnParams } from "class-transformer";
 
 function toBoolean({ value }: TransformFnParams): unknown {
-  if (value === "true") {
-    return true;
-  } else if (value === "false") {
+  if (value === "true") {} else if (value === "false") {
     return false;
   }
killedBy: Validation Transformer toBoolean should return true when input is {"value": "true"} [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] ConditionalExpression
shared/validation/transformers/validation.transformer.ts:4:7
 import type { TransformFnParams } from "class-transformer";
 
 function toBoolean({ value }: TransformFnParams): unknown {
-  if (value === "true") {
+  if (false) {
     return true;
   } else if (value === "false") {
killedBy: Validation Transformer toBoolean should return true when input is {"value": "true"} [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: "true"

[Killed] BooleanLiteral
shared/validation/transformers/validation.transformer.ts:5:12
 
 function toBoolean({ value }: TransformFnParams): unknown {
   if (value === "true") {
-    return true;
+    return false;
   } else if (value === "false") {
     return false;
killedBy: Validation Transformer toBoolean should return true when input is {"value": "true"} [#0].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
shared/validation/transformers/validation.transformer.ts:6:14
 function toBoolean({ value }: TransformFnParams): unknown {
   if (value === "true") {
     return true;
-  } else if (value === "false") {
+  } else if (value !== "false") {
     return false;
   }
killedBy: Validation Transformer toBoolean should return false when input is {"value": "false"} [#1].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: "false"

[Killed] BlockStatement
shared/validation/transformers/validation.transformer.ts:6:33
 function toBoolean({ value }: TransformFnParams): unknown {
   if (value === "true") {
     return true;
-  } else if (value === "false") {
-    return false;
-  }
+  } else if (value === "false") {}
   return value;
 }
killedBy: Game Controller GET /games/random-composition should get random composition when called.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
shared/validation/transformers/validation.transformer.ts:7:12
   if (value === "true") {
     return true;
   } else if (value === "false") {
-    return false;
+    return true;
   }
   return value;
killedBy: Validation Transformer toBoolean should return false when input is {"value": "false"} [#1].
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
